[
  {
    "id": "prod_mechanical_keyboards_172",
    "parent_asin": "B0BTLYNTWQ",
    "category": "Mechanical Keyboards",
    "title": "KEMOVE Maple Theme Keycaps, Thermal Sublimation PBT Keycap 70 Key Set, XDA Profile ANSI Layout for 60% Mechanical Keyboard, English (US) Layout-Orange White",
    "description": "",
    "rating": 4.3,
    "review_count": 117,
    "features": [
      "✅【60% keycaps】This Maple custom keycap set consists of 70 keycaps, compatible with 60% MX mechanical keyboards, applicable keyboard models: GANSS ALT61 series, RK61 series, IKBC poker series, Anne PRO, GH60, iqunix f60, GK64 GK61, etc., perfect for custom mechanical keyboard selection.",
      "✅【XDA Profile Keycaps】XDA keycaps have larger surface contact and larger finger touch area with ergonomic stepped design. Long-term use is not easy to fatigue, with better comfort.",
      "✅【PBT Heat Sublimation Keycaps】Compared with ABS, PBT has better high hardness, wear resistance and high temperature resistance. The color has penetrated into the keycap, and the service life is up to ten years without fading.",
      "✅【Unique Design】This set of keycaps has a unique autumn maple leaves design. Autumn gives people a comfortable and peaceful atmosphere, making you feel calm when using the keyboard, improving work efficiency and increasing the winning rate of games.",
      "✅【What You Get】1x70 PBT Keycap set (key puller included), Keycaps only, The keyboard in the picture is only for the demo and is not for sale. If you have any questions about the size of the keycap of your keyboard, please feel free to confirm with us."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Nice",
        "text": "Overall these are really nice keycaps that show off the light underneath well. However a few keys did have some small blemishes on the top side. The blemishes are hidden between the keys and only exists on the upper solid color portion.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Terrible QC, all keycaps had rough bumps",
        "text": "I just got my white set in the mail today and they would be good keycaps if there had been better quality control. It's like they took a bunch of flawed pieces and sold them to us as a set. Like another user said, I expected the shift, caps lock and tab keys to have the words spelled out and not just arrows.<br /><br />There are rough bumps and weirdly broken pieces of plastic at the top of every keycap, as you can see on my picture. It is very hard to read the keys with backlight on since the font is so thin. The keyboard photographs well but it's very hard to see what key you are pressing. I feel deceived by the company and wish I had bought the HyperX ones instead, even though I didn't like the font.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "KEMOVE",
    "tags": [],
    "price": 19.99,
    "position": 1,
    "page": 1
  },
  {
    "id": "prod_mechanical_keyboards_170",
    "parent_asin": "B09SJ1PDPQ",
    "category": "Mechanical Keyboards",
    "title": "Glorious Aura V2 (Black) - PBT Pudding Keycaps for Mechanical Keyboards - ANSI (US), ISO Compatible - Supports Full Size, TKL, 75%, 60% Layouts",
    "description": "",
    "rating": 4.6,
    "review_count": 230,
    "features": [
      "✅Glorious Aura Keycaps V2 : This redesigned 145 key pudding keycap layout is compatible with GMMK Regular/PRO and most keyboard sets",
      "✅Comes in black or white colors",
      "✅Standard OEM Profile: Glorious Aura Pudding Keycap Set features a standard OEM profile that is widely used over many mechanical keyboards",
      "✅Doubleshot injection legends, backlight RGB led compatible (transparent legends and sides), comes with 1 extra Glorious ASCEND ESC key and original Aura ESC key",
      "✅Thick, High-Quality PBT Plastic Keys : Glorious Aura Pudding Keycaps are made with quality material that is resistant to wear, friction, and solvents",
      "✅Transparent Legends, With Transparent Sides : Glorious Aura Pudding Keycaps are designed to let more light through, making your keyboard's RGB lighting more vibrant",
      "✅Updated font compared to Glorious Aura V1 and support for more mechanical keyboards, compatible with layouts with STANDARD BOTTOM ROW. Fully compatible with Glorious GMMK Mechanical Gaming Keyboards (KEYBOARD NOT INCLUDED), please check your keyboard layout for compatibility"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Best keycaps I have ever used.",
        "text": "Bought these for my GMMK pro.<br /><br />I have owned several mechanical keyboards, but never bought a high-end set of keycaps. Unlike every other set I've ever used, these just seem to ignore dirt and grease. I can stuff my face with a big Mac and go straight to typing, and the caps stay completely clean. I don't know how that works but I won't question it.<br /><br />Other keyboards require weekly wipe downs, I have never had to do it with these caps.<br /><br />They're also noticeably built well. These are going to outlast my fingers by a hundred years, likely.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 3.0,
        "title": "Legend doesn’t glow like other pics",
        "text": "For my Tofu65, I do like these pudding key caps, but I’m not sure why the legends on my key caps aren’t transparent. Everyone who posted reviews with pics show their legends glowing, so I’m not sure why mine are different. My other issue is I got several duplicative keys, and I’m missing a few. For example, I only have one home key and about 4 page down keys. So that’s slightly annoying. I’ve seen some others complain about this similar thing as well. But the feel and look of these key caps are quality. Slightly disappointed.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great caps work as advertised",
        "text": "Works great",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Glorious PC Gaming Race",
    "tags": [
      "Best Seller"
    ],
    "price": 29.99,
    "position": 2,
    "page": 1
  },
  {
    "id": "prod_mechanical_keyboards_099",
    "parent_asin": "B0B78GTSXC",
    "category": "Mechanical Keyboards",
    "title": "FINEDAY Keyboard 2.0, Red Switch, Retro Wireless Mechanical Keyboard, Typewriter Designed, Full 104 Keys with Bluetooth 5.0 & USB up to 4 Devices, Wired & Wireless for Desktop PC/Laptop Mac/Phone",
    "description": "",
    "rating": 3.8,
    "review_count": 81,
    "features": [
      "【 Connectivity 】 With Bluetoooth 5.0 connect up to 3 wireless devices & one USB connection, Use USB & Bluetooth at the same time total of 4 devices. FINEDAY Keyboard 2.0 \"compatible with\" iPad Pro size devices, Easily put the device on the holder",
      "【 Red switch keys 】 Enjoy the Ultimate Retro Typewriter Keyboard with Smooth Feels without Clickety-Clackety sound",
      "【 FN+TAB 】 Wired & Wireless mode to enjoy your typing in both way",
      "【 Left lever 】 works as an Enter key just like old typewriter, Enjoy your typing experiences just like you're using an old typewriter from 1874",
      "【 Left wheel 】 controls the LED backlight brightness. Clean and sharp white LED backlight",
      "【 Right wheel 】 controls the volume of the connected device, No need to touch your device to adjust the sound, Easily roll the wheel!",
      "【 Compatible 】 Windows/iOS/Android",
      "【 Number pad 】With a number pad, with full 104 keys, easily work with numbers",
      "【 Ergonomic 】 A 9.22-degree cradling angle for ergonomic comfort: Easily stow your devices in the mounting stand to type for long time intervals without feeling any strain on your neck",
      "【 NEWTRO 】 A retro typewriter keyboard that lets you experience NEWTRO (New Retro) with the most up-to-date technology, Immerse yourself in nostalgia and get those creative juices flowing while boosting typing speed and accuracy. Designed & Produced by FINEDAY, Every details are designed by FINEDAY"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Great for the look, 10 key A plus, Functional enough for device swap",
        "text": "I really wanted this keyboard for the typewriter look, device swap, and 10-key.<br /><br />The only setback is that even when plugged in via USB to the main device when waking up there is a few seconds of buffering time before being able to type at times. At first, it drove me crazy but now I notice that the green light signals when this is happening and goes solid when ready which alleviates the \"let's go\" anxiety because I know what's happening. I love that it pairs to 3 devices. 2 via Bluetooth and one via usb.<br /><br />Another weird thing is maybe at least 1 time a week I have to unplug and plug the keyboard back in when I cannot type on my device and I know that the correct device is selected and the solid green light is on. If there were a better typewriter-style keyboard in all black and chrome with 10-key and pairs to at least 3 devices that don't have the buffering when swapping device or intermittent typing issue,  I would have picked it but it doesn't exist.<br /><br />Overall 4 stars.<br /><br />Update:<br /><br />Key caps are already falling apart after 3 months use! My heart is so heavy it’s so noticeable and I cannot find a replacement key hundreds of dollars down the drain.",
        "verified": true,
        "helpful_votes": 9
      },
      {
        "rating": 3.0,
        "title": "Keys are dim",
        "text": "I sent mine back because I couldnt see the keys when I was 2 feet away. The backlight shines more between the keys than through them. It was ok in a very dark room but a dim indoor setting they were impossible to see unless you were right over the keyboard, even with the light turned all the way up. They were also kind of wobbly, cant see anyone typing fast on this. I bought a querty writer and the quality difference is huge.",
        "verified": true,
        "helpful_votes": 5
      },
      {
        "rating": 5.0,
        "title": "Love the retro feel and \"noise\"",
        "text": "Love the retro feel and clacking noise.  Typing accuracy has improved!  The ability to switch between 3 devices is extremely convenient!",
        "verified": true,
        "helpful_votes": 2
      }
    ],
    "store": "FINEDAY",
    "tags": [],
    "price": 198.0,
    "position": 3,
    "page": 1
  },
  {
    "id": "prod_mechanical_keyboards_189",
    "parent_asin": "B083XJPNJQ",
    "category": "Mechanical Keyboards",
    "title": "4-Port HDMI KVM Switch – 4K 60Hz – QHD 144Hz - Audio Output and USB Sharing – Mechanical & Gaming Keyboards Supported – HKS0401A2U",
    "description": "This 4x1 HDMI KVM Switch allows you to share one set of “keyboard, video monitor, and mouse” (“KVM”) with up to four PC’s or video devices (Xbox, PS4, Firestick, etc). The switcher does not require software and works with Windows, MacOS, Unix/Linux, Raspberri Pi, etc. HDMI 2.0 protocol supports 4K@60hz and blazing 144hz@1440P, making this device a perfect fit for work-from-home professionals and high-end video gaming.\nKey Features\n- Supports DisplayPort, DVI, & VGA with approved adapters.  - Keyboard passthrough mode allows for better compatibility plus multimedia key functions  - Hotkey triggers assignable to either Scroll Lock or Right-CTRL  - USB sharing works with printers, jump drives, USB headsets and webcams for teleconferencing.  - Auto-scanning with adjustable time interval from 1 to 250 seconds.  - 1-year US-based warranty when purchased from BuyTESmart\nFAQ\n- Audio is transmitted via HDMI connection. HDMI or DisplayPort monitor required for audio  - Use powered USB hub to expand the USB2.0 port if multiple connections are needed  - Use USB extender to reduce distance to receiver if wireless mouse/keyboard is “jumpy”  - Please install CR2025 battery before use (battery not included)\nMouse / Keyboard Compatibility\nDedicated mouse & keyboard ports have emulation programming. Second gen chipsets have “Passthrough Mode” to send special characters such as multimedia keys (play, pause, volume up/down), which improves keyboard compatibility. Keyboard software such as Logitech Options, Corsair iCUE, etc conflicts with the emulation and limits the ability to use macro keys. We recommend using the KVM’s USB2.0 port as a workaround if this software if needed. USB2.0 port does not have emulation programming and KVM will not recognize hotkey commands. Please use a powered USB hub to expand USB connectivity.",
    "rating": 3.9,
    "review_count": 25,
    "features": [
      "Share 4 computers with 1 monitor, keyboard, mouse. Switch between PC’s with push button, keyboard hotkeys, mouse gestures, or remote control. Can also use as HDMI switch for gaming consoles and streaming devices.",
      "HDMI 2.0 supports UHD 4K60hz (3840x2160), QHD 144hz (2560x1440), 1080P 144hz (1920x1080). Plus Ultrawide 60hz (21:9 & 32:9). HDCP 2.2, HDR10, Dolby Vision. EDID Emulation.",
      "Plug & Play. No software or drivers needed. Supported by IT departments for work-from-home professionals. Separate your work from your personal life without the hassle & clutter!",
      "Transmit audio to monitor via HDMI and/or external speakers via stereo output. Share USB device such as webcam and headset with dedicated USB2.0 port. Great for Zoom and Twitch users.",
      "Supports wired, wireless, mechanical, multimedia, and gaming keyboards. No delay, zero latency keyboard switching and pass-through mode for multimedia keys. READ FAQ & PICS.",
      "U.S. Based TECHNICAL SUPPORT from BuyTESmart available to help resolve all issues."
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "Mostly good",
        "text": "One of my connected PCs has a hard time getting the resolution to 1440, cannot figure out why.  I have to restart to get it to go from 1080 to 1440.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great KVM switch",
        "text": "I wasn’t sure what to expect , but after having it for a week I really like the switch.  Perfect size and functionality.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "BuyTESmart",
    "tags": [],
    "price": 124.99,
    "position": 4,
    "page": 1
  },
  {
    "id": "prod_mechanical_keyboards_092",
    "parent_asin": "B0B68V4FQC",
    "category": "Mechanical Keyboards",
    "title": "LexonElec Custom Coiled Keyboard Cable, 2.0M(0.66ft) USB-C to USB-A TPU Mechanical Keyboard Cable, Detachable Metal Aviator Double-Sleeved Wire for Gaming Keyboard(Orange)",
    "description": "",
    "rating": 4.5,
    "review_count": 64,
    "features": [
      "【High Quality and Durable】LexonElec custom coiled keyboard cable Uses four high-quality copper wires and aluminum shielding foil as the core, surface adopts metal and TPU. Professional reverse coil, strong and durable, not afraid of bending and will not break.",
      "【Metal Aviation Connector】The aviator connector allows you to quickly attach different cables to your keyboard or other accessories. Screw-type plug-in lock, self-locking structure, strong connection and stable transmission. All-steel metal, full of texture, Enhance the keyboard experience.",
      "【Professional reversed Coil】Coiled shape, more substantial, not easy to tangle. Even if it is overstretched, it will not only not be damaged but will quickly return to its original shape.",
      "【High-speed Charging and Transfer】USB Type-C to USB-A cable supports safe and fast data synchronization and charging, USB cable is compatible with most USB C mechanical gaming keyboards or printers, PS4, Switch.",
      "【Enough length】The length of the cable exceeds similar products on the market! 7.9 inches long with 20 mm Inner diameter coiled cable+1.1 meter straight cable. This length is enough to meet the distance of all keyboards. It will be a perfect replacement for your OEM or original cables with superior performance.",
      "【Quality Assurance】 After a number of technical tests, including transmission stability, sturdy cables durability, resilience of coils, firm welding of the joints, heavy load test on connect and swing test. Each product you own is high -quality."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Very nice coiled keyboard cable.",
        "text": "The cable came nicely coiled with no flaws. Plugs are high quality and the screw connection type is pretty heavy duty I don't see this breaking. Only wished the straight part of the cable was longer.<br /><br />I highly recommend this cable for anyone looking for a custom looking cable that wont break the bank.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Works as advertised!",
        "text": "This cable worked exactly as advertised. My keyboard has a USB c connector, and it fit together perfectly. I love the look of this cable as it neatly tucks under my desk and doesn't leave any unnecessary excess hanging around. Overall very happy with this product!",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Decent aviator cable for my keyboard setup.",
        "text": "These cables are an aesthetically great match for my “rebel scum” keyboard build.  The connections are tight and the materials used seems like they are great quality.  I don’t really have any complaints about the quality of this product.  I think it’s important to note these are not braided cables, and have a soft rubber feel, much like you would get on any standard USB type cable.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Good Quality!",
        "text": "Bright white coiled cable makes my desk look neater and organized. Matches my desk decor better. Keyboard response is the same as the original cable it came with, no complaints here.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Treat your keyboard to a nicer cable",
        "text": "What a nice cable, with solid metal USB plugs, a clean aviator connector, and tight and even coils. I got it in purple, to match some keycaps I like, and it looks perfect. The USB-C plug is about 5.5mm thick, so should fit most recessed plugs. I was able to charge every device I tried, even a chromebook (lenovo duet) and phone (pixel 6a).",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "LexonElec",
    "tags": [],
    "price": 15.99,
    "position": 5,
    "page": 1
  },
  {
    "id": "prod_mechanical_keyboards_028",
    "parent_asin": "B0951Q3JJF",
    "category": "Mechanical Keyboards",
    "title": "Spacebar Keycap,DIY PTB Keycaps,Five-Sided Sublimation Custom Keycaps,6.25U 6.25X Space Keycap OEM Profile Keycaps for DIY Mechanical Keyboard - A Variety of Personalized Patterns Optional (kit11)",
    "description": "",
    "rating": 4.5,
    "review_count": 37,
    "features": [
      "【DIY Space Keycaps for Mechanical Keyboard】This keycap kit include Space Keycap and a Keycap Puller, PBT Keycaps, a good choice for you to DIY your mechanical keyboard.",
      "【PBT Keycaps】This PBT keycaps provide top-notch durability and a great feel for your typing. The zero-shine matte look will last for as long as you use it. This keycap has high color fastness, wear resistance, and no fading.",
      "【OEM Profile Keycaps】With OEM height, it is suitable for most mechanical keyboards. Using five-sided sublimation process, it feels very good.",
      "【Perfect For Keyboard Decor】Ergonomic design, Elegant landscape painting design can better decorate your keyboard. Specially designed for mechanical keyboard, exquisite workmanship, easy to install and use.If you already hate the same solid color, it must be a good choice to embellish your keyboard with some patterns.",
      "【NOTE！】The keyboard in the picture is only for the demo and is not for sale。The kit only keycaps and keycap Puller."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Quality Keycaps",
        "text": "Quality keycaps.  Well made, and form fitting. Great colors, and good quality.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Lelukee",
    "tags": [],
    "price": 6.99,
    "position": 6,
    "page": 1
  },
  {
    "id": "prod_mechanical_keyboards_181",
    "parent_asin": "B0B4VZCQHP",
    "category": "Mechanical Keyboards",
    "title": "YMDK 144 Chess Board Keycaps Dye-Sub Thick PBT Cherry Profile Key caps for TKL 61 64 68 75 87 96 104 108 GMMK MX Mechanical Keyboard",
    "description": "Package Included 1x Full set Dye sub Cherry Profile Keycap set + Keycap puller No keyboard Included Details This link is only the keycaps,no keyboard included.The keycap loading board is only to take photo,not included in the sold package.We will pack the keycaps in our own carton. The printed ones are dye-sublimation. The keycap is made of durable PBT material,the thickness is about 1.5mm. Special Design,can use both with north south facing PCB Our store has opened DIY services.If you have interests,don't hesitate to leave us message. Compatiability Main 96 layout whose bottom is 1.25 1.25 1.25 6.25 1.5 1.5 1 1 or 1.25 1.25 1.25 6.25 1 1 1 1 1 or 1.25 1.25 1.25 6.25 1.25 1.25 1.25,such as Melody 96 YMD96 Kira 96 RS96 Standard 104 87 61 ANSI ISO layout whose bottom is 1x6.25u+7x1.25u. Compatible with Filco Ducky Poker 61 87 104 which is most common Main 84 layout, compatible with KBD75 YMD75 Keycool 84 XD84 NCR80 (6.25u space) Compatible with Ducky one 2 Mini SF It's compatible with popular 68 layout as well Incompatiability The spacebar is not 6.25u,it can't be compatible.It's not compatible with Cosair Logitech Razer Keyboard. It's not compatible some old Cherry brand keyboard whose caps lock back hole is off center,it can't be compatible,such as 1800 Some stabilizers are little issue with these big keycap, but it is easily fixable. Please contact us if you encounter any similar problem. Please inquire us if you need special keycaps. After Service If some keys missing or broken on the way,just leave us message,we will send you missing or broken ones soon.Don't worry about it & don't leave feedback immediately.",
    "rating": 4.4,
    "review_count": 36,
    "features": [
      "Package Included: 1x Full PBT Dye Sub keycaps + Keycap Puller",
      "This keyset is made of PBT.The thickness is around 1.5mm.Special Design,can use both with north south facing PCB",
      "The legend is dye-sublimation which never fades.The injection point is at the corner on the back.",
      "Compatible with most mx switches 61 64 68 75 84 96 104 108 mechanical keyboard whose space is 6.25u.",
      "Compatible with YMD96,Melody96,Kira96,GK64,Tada68,KBD75 KBD67 GMMK etc.Compatible with Cherry 3800 3000 3850.Compatible with SF Mini GK61 Anne Pro"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "High Quality Caps - Adore the Theme",
        "text": "As a typist, these caps have a great feel to them. They are thick without being heavy. No wobble. Improve the sound of the board and switch. I purchased the Smoke Cloud theme, and the images are adorable for a weather enthusiast like me. This set also had plenty of extra keys to complete the 96% keyboards, which not a lot of sets include. I was leary of paying $40 for a set without trying them first, but I don't regret it - great purchase - fast shipping!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Looks great, sounds like quality",
        "text": "I'm a bit of a keycap junkie.  I love being able to swap keys out to give my keyboard a different look.  If you're looking at this, you likely already like the look and I think they look better in person.  The keycaps are easy to install and provide good sound.  No hollow cheapness to these!",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Very thick keycaps",
        "text": "What I like<br />I really like the quality of the prints on these keycaps.<br />Also the thickness of these keycaps are even past some doubleshot ones I have.<br /><br />What I find questionable.<br />The character keys looked like they were a light green color, but they are bright white.  I ended up liking them anyway, just was a bit surprised.<br /><br />Overall they are a great set of keycaps, going to keep using them for sure.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "YMDK",
    "tags": [],
    "price": 39.99,
    "position": 7,
    "page": 1
  },
  {
    "id": "prod_mechanical_keyboards_048",
    "parent_asin": "B0BL7M3NPP",
    "category": "Mechanical Keyboards",
    "title": "Happy Balls PBT Keycaps Backlit Cherry MX Keycap Set Doubleshot OEM Profile Translucent with Keycap Puller for US Layout 61 87 104 108 MX Switches Mechanical Keyboard (Blue White Combo)",
    "description": "",
    "rating": 4.3,
    "review_count": 103,
    "features": [
      "This keycap set contain 109pcs pbt backlit keycaps and 1pcs key puller",
      "It can fit most Standard US layout 61/ 87 TKL / 104 / 108 mx switches mechanical keyboards",
      "Excellent double shot craftsmanship, shine through the keycaps no light leakage",
      "The height is OEM profile, the thickness is about 1.4mm",
      "Note: Some non standard US layout mechanical keyboards can't use this keyset. Because the size of the space bar / enter key / shfit key and win keys are different. You also can confirm with us, if you are not sure the keycaps size of your keyboard, if the key have some damage, you also can tell us and we will slove your problem"
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Good quality!",
        "text": "The thickness is nice and has a good feel when typing. I personally like the font on these keys compared to a lot of the others found on Amazon. It's very clean and sleek. The colors are very pastel though, so in some lightings it's hard to differentiate between the two colors as there's not much contrast. I eventually just switched out the pastel purple caps for darker purple caps I already had. Overall they're really nice and fit my Anne Pro 2 perfectly. (Bonus: The case for storing the keys is also pretty fancy).",
        "verified": true,
        "helpful_votes": 10
      },
      {
        "rating": 4.0,
        "title": "Poor man's white fox.",
        "text": "I put them on a Quisan Magicforce 68 key mechanical keyboard. The legends and not as pronounced / readable as the stock key caps, they also seat closer to the board which leads to a shorter key press. Quite happy with the product for the price. They feel very nice.<br /><br />Look grey in the photos but are bright white.",
        "verified": true,
        "helpful_votes": 8
      },
      {
        "rating": 5.0,
        "title": "A great replacement for any stock ABS keycaps",
        "text": "A great replacement for any stock ABS keycaps! Not the highest quality PBT, but still thicker than ABS and its doubleshot with clean text. Some compatibility issues with space bar and shift keys(or any larger keys), due to these not having stabalizers. So they wiggle a little bit. But not uncomfortable or hard to use if you deal with it.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Amazing build quality!",
        "text": "These key caps are as advertised. Very high quality key caps with a variety of colors available. Was shipped in a very organize box with the keys all separated so you dont have to dig through the box to find any particular keys. So far I am satisfy with the product. Will see how it holds up",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "Excellent keycaps for the price..",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Happy Balls",
    "tags": [],
    "price": 25.19,
    "position": 8,
    "page": 1
  },
  {
    "id": "prod_mechanical_keyboards_097",
    "parent_asin": "B07P71MGX3",
    "category": "Mechanical Keyboards",
    "title": "YMDK ANSI ISO PBT Doubleshot Shine Through Pudding Keycaps Suitable for MX Mechanical Keyboard Corsair Razer SF KBD75 Tada68 DZ60 (Black Pudding Full Set)(Only Keycap)",
    "description": "",
    "rating": 4.6,
    "review_count": 247,
    "features": [],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Looks great, shows off my RGB light on my Keychron  K4 now.",
        "text": "[[VIDEOID:2f9f1dbaca0dc20e2ddfad733f0e051c]] Looks great, shows off my RGB lights on my Keychron  K4 now.  The only downside is not having the function icons on the keys anymore. I’ll have to work on getting some little stickers.<br />Edit:Added a Movie Clip",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Great but some keys may not be suitable for your keyboard",
        "text": "they look really pretty tbh. However some keys had fitment issues. The spacebar had their slots just a little bit off so it couldnt fit. The caps lock is upside down. The windows and menu keys did not like being next to other keys. Other than that, the rest of the keys fit great.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "They work great",
        "text": "[[VIDEOID:eaa9e5229cc02ed31da7ef98d0a78ee4]] Replaced the most of my bottom row on my keyboard with these key caps.  They are good, the LED shines through and it really nice! for Corsair keyboards.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Quality can be improved but overall great price and compatibility",
        "text": "One of the few sets that actually fit my K95 (Corsair bottom row) Plenty of extra pieces for other keyboards too. The color black of these pieces appear much more grey compared to he caps my keyboard came with. And each piece has a little dimple at the top where they were cast or molded. Not the end of the world, but other sets don't have that. Also found small imperfections in several pieces. Time will tell how they do over prolonged use. Pretty good for the price, solid 4 of 5.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Just what I needed",
        "text": "I wanted some keycaps to match the theme of my keyboard but it's a struggle finding keycaps that fit the sizing of R1 on a Corsair keyboard. This is exactly what I needed!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Razer",
    "tags": [],
    "price": 29.9,
    "position": 9,
    "page": 1
  },
  {
    "id": "prod_mechanical_keyboards_021",
    "parent_asin": "B09X9BNL7K",
    "category": "Mechanical Keyboards",
    "title": "ikbc W200 Wireless Mechanical Keyboard with Cherry MX Red Switch for Windows and Mac OS, Enables Media Key and LED Indicator (2.4G Dongle, USB 2.0, PBT Double Shot 87 Keycaps, Black Color, ANSI/US)",
    "description": "",
    "rating": 4.2,
    "review_count": 59,
    "features": [
      "▼ Mechanical keyboard with Cherry MX Red Switches (Linear): A linear, lighter but does not have tactile bump and audible click found comparing with Cherry MX Blue switches. Cherry MX Red is ideal for gaming where the low articulation force and linear path allow for quick successive key presses. Typing with Cherry MX Red switches is similar to browns, though it does lack tactile feedback and It is always the best preference for gamers.",
      "▼ A durable computer keyboard with PBT Double Shot keycaps for Ergonomic Keycap Shapes designed to provide you with durable, long lasting and comfortable typing experience.",
      "▼ Plug-And-Play Simplicity. : Setup takes seconds—you simply plug the wireless receiver into a USB port and start using your keyboard right away without software. 100% Anti-ghosting with 6-key Rollover and convenient FN Multimedia Shortcuts Keys.",
      "▼ Other Features : Original Cherry MX Switch-Each Reliable Switches Rated for 50 million Typing Times. Using 2.4Ghz Wireless can Connectivity-Up to 6 Month Long Standby Time. Product structure include the Smart Power Indicator Light and 2 Adjustable Feetstand Height.",
      "▼ What You Can Get: iKBC Cherry MX Red switch mechanical keyboard x1, 2.4G wireless dongle x1 (equipped inside battery area), AAA batteries x2, dust cover x1, key puller x1, user manual x1."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great",
        "text": "It meets all my needs. I got it to replace a wireless Velocifire keyboard whose internal battery was dying. I had to plug my old one in everyday as I couldn’t see the key labels without the backlight, and it’s built in battery life decreased from 5 to 1 days over a couple years. So it was essentially wired, while I prefer the wireless aesthetic.<br /><br />This one avoids the backlight killing the battery life as well as internal battery degradation. I can see the key labels fine without a backlight, and it takes replaceable batteries. Battery life should be months without the backlight, and it even has a low battery warning light. No cord to deal with.<br /><br />Seems well built, heavy, and doesn’t slide on the desk. Nice price point. Easy to set up. It even has multiple tilt angle (height) options, although I like it flat. TKL is great to minimize the distance to reach the mouse, improving ergonomics.<br /><br />I went from brown to red switches as that’s all that was in stock, and it was an easy change, although I could tell a slight difference initially.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Quite Loud",
        "text": "If you can't stand the sound of a clacking keyboard, this isn't for you. It can get quite loud, especially when you're typing fairly quickly. This is probably better for techies who like the intense sound and the tactile key interface. The lighting is also nice. I can recommend this keyboard for those who either live or work alone.<br /><br />Thanks so much for taking the time to read this review.  I hope the information that I've provided helps make your decision a little easier.",
        "verified": false,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "A No-Cable Classic For Writers",
        "text": "I am not lying: This is hands down the best keyboard for writing I have used in the last twenty years. I liked the older acrylic Apple keyboard and I own a mechanical keyboard with click-switches (blue), but this one makes touch typing so much more comfortable.<br />I wasn’t sure if I would like the tactile keys without click, because I actually like the click. They are just very loud. Logitech’s K845 (with Cherry MX red) is a great keyboard as well, but louder and has a cable.<br />I wish this keyboard would be backlit though. Black keyboards in front of big screens need some sort of illumination. I got one of these USB LED lights that I plugged behind my monitor, that half-solves the problem by providing some backlight.<br />Still it’s awesome to write on it. It’s focus is to be a mechanical keyboard. So much that it seems that it skipped the product design. It looks like an OEM-Keyboard from 1995. That’s in a way uncompromisingly functional, but next to a modern flat butterfly keyboard it looks like someone parked an old Volvo next to a Miata.<br />The quality is good. The keycaps are heavy and lettering sharp. It might be confusing for some that the ‘upper’ characters are printed next to the main set in the same size.<br />Battery life seems not to be a problem. I am pretty much writing all day, and I’m still on the first set of batteries that came in the package.<br />PROS AND CONS<br />+ Precise keyboard for touch-typing<br />+ Quiet enough for shared work areas<br />+ Height adjustable<br />+ Great quality<br />+ Long Battery life<br />+ Connects via dongle, not Bluetooth (yes, for me that’s a pro. Bluetooth sucks)<br />+ Compact with no number pad<br /><br />- Chunky design<br />- No backlight<br />- Very heavy<br />- Vague keycap lettering<br />- No number pad (*conflict*)<br />I can recommend this keyboard to anyone who is typing over a long amount of times. It takes a while to get used to, but once adjusted it’s less tiring than modern butterfly or rubber cap keyboards, because the keys don’t bottom out that easily, and feel better to the fingertips. I took a few photos. I hope it helps to make a decision.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Silent Cherry Red Switches Work Well With Family Room Computer",
        "text": "While the cherry MX red keys are often used for gaming, I am reviewing this as a typing keyboard in a family room, where the loud clackity clack of a keyboard is unwelcome. And I find this keyboard to be a great solution for such an environment.<br /><br />This keyboard paired so effortlessly with my Mac that I wasn’t even aware it happened. I checked the keys for their mapping, and found them to be as one would expect for a Windows keyboard—just the usual issue with the non-Apple standard keys near the Shift key.<br /><br />It is not “full-size,” but 80% size, so it is somewhat smaller, but not so much so that you fee cramped.<br /><br />They keys are as silent as advertised. And while an old-school touch typist might miss the “click” feedback of a mechanical keyboard, these keys have decent travel, so if you are typing, you will have little doubt that you have actually engaged the key. (I can’t talk to gaming with these.)<br /><br />I have had no trouble with the bluetooth connection, nor the responsiveness while typing.<br /><br />If I have any reliability issues, I will be sure to revisit this review as necessary.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "ikbc",
    "tags": [],
    "price": 85.99,
    "position": 10,
    "page": 1
  },
  {
    "id": "prod_mechanical_keyboards_112",
    "parent_asin": "B09ZYC84B8",
    "category": "Mechanical Keyboards",
    "title": "EPOMAKER Airy 143 Keys ESA Profile ANSI ISO Layout Clear Shine Through Keycaps Set for Mechanical Keyboard, Compatible with MX-Clone Switches Cherry/Gateron/Kailh/Akko/Ajazz Switch(Airy Black)",
    "description": "",
    "rating": 4.2,
    "review_count": 142,
    "features": [
      "【EPOMAKER Airy Transparent Keycaps】EPOMAKER Airy Keycaps set is designed to fit on a standard ANSI/ISO keyboard with MX style switches. Perhaps you want to give your favorite AZERTY keyboards a makeover to match the modern design trends? Whatever your taste, we’re positive that this is the right choice for you! Shine-through RGB backlight creates an vivid atmosphere which plays an important role in play-ability and mood",
      "【ESA Profile, Compatible with MX Switches】From the community, for the community. EPOMAKER ESA Profile is the best practice of our pursue. ESA profile has a angled and spherical top similar to SA profile. The height is medium but not too tall. It provides unique experience unlike other profiles. This profile is considered as a solid option for both gaming and quick or regular typing",
      "【143 Keys Set, ANSI/ISO Layout Compatible】Apart from the basic full keycaps, this set also contains extra replacement keycaps, including Mac modifiers and ISO special keys, such as big Enter key, 1.25U Shift...Either you are using ANSI standard layout or you are more familiar with ISO layout, we cover it all for you. Simply get one set and meet all needs",
      "【High-Quality Polycabonate Material with UV Printing】Pursuing an ultimate transparency, this set adopts premium PC material to mould the keycaps and printing the characters through digital printing process. The rigorous production ensures the keycaps survive *wear-resistant and scratch-resistant tests. *Note: the test result comes from the laboratory data may differ from actual usage scenes. Due to the material properties, PC keycaps may still be vulnerable to scratches and hand sweat/oil/cream",
      "【Increased Compatibility】EPOMAKER Airy Clear keycaps set contains special shift sizes and modifiers like the 1u, 1.75u and 2u SHIFT key, so it is with more possibilities to customize your EPOMAKER keyboard, such as 60%/65%/75%/TKL/96%/1800-compact/100% keyboard. It also has split spacebar keys that you might need. A keycap set that makes your DIY journey worry-free"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Kawaii !!",
        "text": "Comes with all the keys caps you need, love how smooth it feels. You may need to dim your keyboard brightness, found the light through the clear key caps can hurt your eyes after a while.",
        "verified": true,
        "helpful_votes": 3
      },
      {
        "rating": 4.0,
        "title": "Exceptionally perfect feel EXCEPT no way to find your position!",
        "text": "I wanted to love these key caps. They look great! They feel superb and their smooth texture is exactly what I wanted.<br /><br />However, two major flaws: I didn't even know this was a thing to consider, but they don't have bumps on the positioning keys \"F\" and \"J\". So if you type a lot and remove your hands from the keys, you need to look down every time to find your position. This interrupts my workflow as a transcriptionist quite a bit. The other disadvantage is that the smooth feel of the material also makes it impossible to keep skin oil, snack residues, etc. from being left behind on these caps, making them somewhat difficult to grip after the first half hour.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Really nice visual upgrade",
        "text": "I wanted to upgrade my keyboard’s appearance, and after much Googling I settled on this product. I have a full size 104 key keyboard, and looking at keycaps on various websites makes it seem kinda complicated to know which set I’d need for my specific keyboard (Das Keyboard 4). Some Ctrl keys are wider than others, Spacebars shorter than others, etc. and what I liked about this set is that it includes different length keys and you just use the one that fits your keyboard and ignore the rest.<br /><br />This is my first set of keycaps so I can’t really speak with any knowledge to the quality of the keys, but I’m really happy with how they look. They feel similar to the ones that came with my keyboard but look muuuuch better.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Fantastic keycap set",
        "text": "They finally arrived! I plan on putting these keycaps on a 75% keyboard that won't arrive for another couple of months so in the pictures, I only put it on part of my keyboard to test them out. I want to \"preserve\" that new keycap feeling later. :)<br /><br />These keycaps are fairly thick and have the standard PBT texture. The doubleshot legends are quite clear and none of the spacebars are warped! This is a new profile I've never typed on and I can't find much information on the web about it so I included a lot of pictures. I compared them in the pictures to my Ducky keyboard with doubleshot ABS. They actually aren't too different from OEM keycap profile (from the Ducky) height but some of the rows are higher. They're much more shapely and the F and J keys have a deeper dish. Compared to DSA keycaps, they don't seem to be quite as deep dishey overall which I actually prefer.<br />The keycaps fit snug on cherry mx brown stems, more so than my Ducky keycaps. They aren't hard to put on though. Some of the stems have a small part of plastic missing from the MX cross area but it's only a handful of the keycaps and it didn't effect the fit. I've included photos of this as well.<br />Overall they're great keycaps that I won't be using yet until my keyboard for them arrives.",
        "verified": false,
        "helpful_votes": 1
      }
    ],
    "store": "EPOMAKER",
    "tags": [
      "Sponsored"
    ],
    "price": 45.99,
    "position": 11,
    "page": 2
  },
  {
    "id": "prod_mechanical_keyboards_025",
    "parent_asin": "B09CTNCBFG",
    "category": "Mechanical Keyboards",
    "title": "Wireless 60% Mechanical Gaming Keyboard, 3 Connection Mode Keyboard with Linear Red Switches, Portabl Compact Grey&Black Keyboard, 68 Keys Mini Keyboard for Mac/Windows, Gamer,Typist,Travel,Trip",
    "description": "",
    "rating": 4.4,
    "review_count": 1442,
    "features": [
      "✅ [ N-Key Rollover Mechanical Keyboard ] All keys non-conflict. This mechanical gaming keyboards allows multiple keys to work simultaneously with high speed. Let you enjoy high-grade games with fast response",
      "✅ [ Linear Red Switches ] Quiet click sound, fast action with small resistance without a tactile bump feel, gamers often prefer Red switches because they are not as springy, and easier to push down faster",
      "✅ [ Compact 60% Mini Gaming Keyboard ] Small size with 68 keys, save more space for your desk. And this mini gaming keyboard keyboard have the perfect size for travel and fits easily into most bags and backpacks",
      "✅ [ 3 Connection Mode Recharging Keyboard ] This mechanical gaming keyboard support both wired and wireless connections, this gaming keyboard can be connected to your PC, laptop, iPad, phone, and more via a 2.4G USB receiver or B1/B2/B3 modes. You can also charge and play simultaneously with the type-c cable. Connect up to 3 devices simultaneously and switch easily, perfect for home, office, outdoor and casual gaming",
      "✅ [ Ergonomic & Durable Wireless Keyboard ] Smooth lines,comfortable feeling and reduce your hand fatigue. Two-Color injection keycaps make this keyboard more durable and lasting"
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Constant spring buzzing",
        "text": "The keyboard is very visually appealing. I do not know if my lack of keyboard knowledge is why I give this 4/5 stars, but there are a few features I do not like. Starting with the positives, the backlight (light blue not changeable) is very appealing and not hard on the eyes, the swappable red switches are nice because I like red, and the linear red switches mean it has a nice click noise when typing. Moving into the cons, there is a bit that is annoying. The most notable, and would probably lower the rating more if I wasn't nice, is the spring noises from the keys. There is a buzzing noise that is left if a key is tapped too hard. This can be fixed by buying lube, but annoying nonetheless. Another feature is the lack of hotkey commands. I write a bit of papers and I usually have multiple tabs open. Trying to hotkey a tab to the left or right side of my screen doesn't work because to use arrow keys, the fn key needs to be held and that doesn't work for the windows hotkey: win+arrow_key. Another annoying hotkey feature is the 'del' key which is fn+n. The n key is in a bit of a bad spot to use the 'delete'' function. Of course, these can all be changed by editing the layers of the keyboard, but it is a long and annoying process that I have not taken the time to do yet. The last issue is the key colors. At night, seeing the gray keys, with the backlight on, is a bit difficult. The second photo attached also has extra keys added, not all of them can be attached to the keyboard because there isn't a spot for it (a bit weird but ok).<br /><br />Pros:<br />nice backlight (not changeable color)<br />clacking linear red switches<br />extra switch colors<br /><br />Cons:<br />Spring noise<br />keyboard's default button layer<br />hard to see switches at night",
        "verified": true,
        "helpful_votes": 3
      },
      {
        "rating": 5.0,
        "title": "I don't believe but, I got too! I'm looking right at it.",
        "text": "I didn't expect much for under $23 when I got it at the end of 2022. I figured it I'd get a couple of weeks of fun out of it and figure out if I like the form factor.<br /><br />When I took it out of the box it didn't look the same as in the photo. Well, you get an extra set of keys! Not every key but, nothing to sneeze at!<br /><br />It feels good and been holding up well! Other than a squeaky space bar. No issues. Got used to the FN usage and key placement. It's really an amazing value even at $30. I'm sure it's not as premium as the $80+ keyboards but, the value is here!",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "ASMR keyboard",
        "text": "I LOVE IT!!!! I don't really game but I work in a office and wanted something new and my sister that games showed me this colorful keyboard and I just had to buy it. I am currently using it and I just don't want to stop typing! It has a lot of different color modes and it is just fun to use. I got the white with blue and I would recommend. Also it is loud so keep that in mind.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Looks neat",
        "text": "Awesome 👍😎",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Love it",
        "text": "Very satisfied overall - ergonomic, super comfy (for mechanical keyboard lovers), a lot of different light effects. If it was wireless - would be just priceless",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Camiysn",
    "tags": [],
    "price": 39.99,
    "position": 12,
    "page": 2
  },
  {
    "id": "prod_mechanical_keyboards_143",
    "parent_asin": "B08CVGYFC4",
    "category": "Mechanical Keyboards",
    "title": "ASCENY Coiled & Double-Sleeved Mechanical Keyboard Cable, for Type-C Mechanical Keyboards (Purple)",
    "description": "As MK enthusiasts who are obsessed with building keyboards, we understood the needs of the mechanical keyboards community. This cable is our latest take on designed mechanical keyboard cables. Our goal was to create a mass production product that will allow more people to get into the hobby without having to spend a huge amount of money. After many failed attempts to make a great coil in mass production, we finally believe that we have created a great product that stands in one with the standards of mechanical keyboard enthusiasts.",
    "rating": 4.2,
    "review_count": 2322,
    "features": [
      "Stiff plastic injected Asceny connectors. No more amateurish heatshrinks.",
      "PET double sleeve that gives a beautiful texture, and extra durability.",
      "4.9ft long (excluding the coil length) & Super flexible 6\" tight coil that lasts.",
      "Comes in a beautiful package that holds the coil tight. Can be saved and re-used whenever you want to store your cable."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great cable for a small investment.",
        "text": "Being new to to the Mechanical Keyboard market, I recently purchased a prebuilt \"budget\" board that came with a long plain usb-c cable, which would be fine but I wanted a cleaner look for my desk.  Aviator cables are great but I did not want to invest $50+ for a single use cable.  In comes Asceny with a cable that costs half as much and looks just as good in my opinion.  The packaging was nicely made, and does not feel cheap in any way, this company really put a lot of love into the product.<br /><br />My only complaint is that with the direction of the coil, I can not have the Asceny logo facing up with a left side charge port on my keyboard, otherwise the cable does not sit correctly on the desk.  This would not dissuade me from recommending it though, and may even encourage some buyers.",
        "verified": true,
        "helpful_votes": 11
      },
      {
        "rating": 5.0,
        "title": "Keychron K4 Compatible",
        "text": "Read reviews about the plug not fitting on some Keychrons but was prepared to modify. Turns out, it fits just fine, and I haven’t had any issues so far.<br />Cable itself feels solid and durable, a bit stiff, but maneuverable.<br />Overall, for the price, I’d say go with it if you are debating.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Nice",
        "text": "Good value, sturdy, nice style",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Good starter coil cable for keyboard build",
        "text": "This is my first coil keyboard cable for my first mechanical keyboard build. I can’t compare it to one of the more popular brands like Glorious for example, but for what it is, it’s a nice, sturdy, well made cable. It looks good and is a nice accessory for my keyboard. The coils are actually smaller than I thought they would be, but still nice. I wish the cable was longer though, that’s my only complaint.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "good wire to save space and for the *aesthetic*",
        "text": "i love how the coiled-wire pairs with the mechanical keyboard. it makes my desk look less messy and looks fab LOL",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "ASCENY",
    "tags": [],
    "price": 14.99,
    "position": 13,
    "page": 2
  },
  {
    "id": "prod_mechanical_keyboards_103",
    "parent_asin": "B09699XBH4",
    "category": "Mechanical Keyboards",
    "title": "141 Keys Botanical Keycaps Cherry Profile PBT Dye Sub Keycap Set Suitable for 61/64/68/84/87/96/104/108 Cherry Mx Switches Mechanical Gaming Keyboard",
    "description": "",
    "rating": 4.6,
    "review_count": 198,
    "features": [
      "【PBT Keycaps】These 141 cherry profile keycaps are made of thick PBT material, with a matte texture and anti-grease coating, which can provide good durability and typing.",
      "【Cherry Profile】This set of pbt keycaps uses the cherry height, which is higher than the XDA profile. It's ergonomically designed, so you will not feel tired even if you type or play games for a long time.",
      "【Rugged and Durable】The thickness of these keycaps are about 1.4~1.5mm, so the keycaps are very durable. The thick PBT material will effectively extend the service life of the keycaps.",
      "【Wide Selection】These keycaps are suitable for most keyboards, such as 61/64/68/84/87/96/104/108 cherry mx switches mechanical Keyboards.If you are not sure whether this keycaps set is fit for your keyboard, please consult customer service.",
      "【Warm Tips】This product is a set of keycaps, not a keyboard. If the keycaps are missing or cracked, don't worry, we'll send you new replacement keys."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "OMG great keycap set!",
        "text": "I have been looking for these sets for the longest time, outside of GB and these guys have made a solid replica. i am so impressed with the quality and feel of these Botanical keycap sets that the premium sets can remain on the shelf.  They look so nice and very very close and clean to the originals.<br /><br />the only way you can tell that they are not GMK is by looking at the bottom. The dye-sub is a little weak in the finish but you never look under the hood.<br /><br />If you like the greenery landscape or the color great fanatic this is the best set. It's super clean, subtle, and sounds great! I have this set on my KBD67 Lite and it sounds so much better than my ABS keycaps i paid $80 for. The texture is also very nice and I seem to be keen on this rough like texture than the ABS smoother feel. It kind of is matte if that makes sense.  The legends on all the alphas are uniform, no thickness issues.  The ,.? and other modifiers might have a thinner font but negligible.<br /><br />I can't say enough what a great first impression these sets have given me and if they produce an \"Oblivian\" replica i'm jumping on it as well. Pictures to come, after I pickup my desk from all the loose keycaps.",
        "verified": true,
        "helpful_votes": 7
      },
      {
        "rating": 5.0,
        "title": "Great sound",
        "text": "Don’t wait years for a gmk set these are just as good lol",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Sumgsn",
    "tags": [],
    "price": 34.99,
    "position": 14,
    "page": 2
  },
  {
    "id": "prod_mechanical_keyboards_140",
    "parent_asin": "B09NN54DPG",
    "category": "Mechanical Keyboards",
    "title": "HONKID Esc Keycap for Mechanical Gaming Keyboard Switches, Custom Keycaps for Esc and Tab Key with Magnetic Light Macintosh Retro Style Design (White)",
    "description": "",
    "rating": 4.5,
    "review_count": 23,
    "features": [
      "TRIBUTE TO THE CLASSICS: The retro computer keycaps is in honor of the the classic 1984 Macintosh computers, the unique retro styling of ESC keycap and Tab keycap give you a new experience",
      "COMPATIBILITY: Uinversal mechanical keyboard Cross interface, compatible with most MX switches as cherry MX, kailh, outemu, gateron, ect. Our custom keycaps fit most keyboards especially 60% mechanical gaming keyboard, the keycaps include ESC keycap and Tab keycap",
      "LIGHT-TRANSMISSION DESIGN: Unique light guide design, the light transmission is brighter and more uniform. If your keyboard has a backlight function, then your light will be delivered through the keycap card, and the effect is perfect. Five classic card patterns, which can be changed at will",
      "MAGNETIC DESIGN: Both ESC and Tab keycap have magnetic, simple and stable.You can attach the mini keyboard to any keycap, card panel of the keycap also uses the magnetic function, which makes it very convenient and fast to replace the translucent cards",
      "DELICATE EXQUISITE: You will feels better and more delicate and comfortable,The delicate matte texture and the details of the back are enough to make you miss the first generation of MAC"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Perfect starter Artisan keycap!",
        "text": "Edit: purchased the black AND the white one. 10/10<br /><br />I purchased this keycap as I wanted an artisan but did not want to have to pay resale on ebay or Mechmarket. After a quick search, I was glad to find this combo as it covers the escape key AND the tab key in a matching set. I tried both keycaps on multiple boards and I am thoroughly impressed.<br /><br />I can easily say that this keycap set will fit both regular MX stems and box stems, as they fit on my box inks and NK creams without issue. I swapped them on 6 different boards just to see how they looked with different sets and did not find there to be any loosening.<br /><br />Being able to change the \"screen\" is a fun touch but I am leaving it on the apple logo for nostalgia. The keyboard on the tab key is magnetic and I have found myself playing with it while working today.<br /><br />Overall this is an easy 10/10 for both price and quality. I highly recommend it for both enthusiasts who want a fun budget set but also for anyone with a keyboard in general!",
        "verified": true,
        "helpful_votes": 5
      }
    ],
    "store": "HONKID",
    "tags": [],
    "price": 19.99,
    "position": 15,
    "page": 2
  },
  {
    "id": "prod_mechanical_keyboards_011",
    "parent_asin": "B08B7YZKLH",
    "category": "Mechanical Keyboards",
    "title": "VELOCIFIRE Keycap Puller Tool, 3 in 1 Keycap Puller, Stainless Steel Keycap Removal Tool, Key Pulling, Loosen, Tighten Keycap Stem, Expert for Mechanical Keyboard(Black)",
    "description": "",
    "rating": 4.2,
    "review_count": 169,
    "features": [
      "This wire style keycap puller is a necessary tool for any mechanical keyboard owner. Easily remove and replace keycaps with this keycap removal tool.",
      "Creative two-stage combination design, multifunctional keycap puller, one part is keycap puller, one part is keycap stem adjust.",
      "You just need to place the keycap puller metal at the bottom of the keycap and pull the keycap out vertically.",
      "Round body shape designed for maximum comfort.Compatible for most mechanical keyboards including Cherry MX，Kailh, Outemu, and Content Switches.",
      "Wires can bend outward to fit onto every key except the spacebar. (The spacebar key can be removed by hand after the surrounding keys are removed)."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "It's good, but it doesn't fit Daskeyboard keys",
        "text": "I have a das keyboard.  This doesn't fit over the keys.  I had to twist and bend it to make it work.  It's not the right tool for a das keyboard.  With that said, it's a good quality tool.  I would buy it again for something with smaller keys.  Just don't bother for the mechanical das keyboard.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "VELOCIFIRE",
    "tags": [],
    "price": 6.99,
    "position": 16,
    "page": 2
  },
  {
    "id": "prod_mechanical_keyboards_119",
    "parent_asin": "B07BMQPTV1",
    "category": "Mechanical Keyboards",
    "title": "TECWARE Phantom 87 Key Mechanical Keyboard, RGB led, Outemu Brown Switch",
    "description": "",
    "rating": 4.6,
    "review_count": 5974,
    "features": [
      "RGB BACKLIGHTING - Enhance your gaming experience with 18 pre-set configurations on the mechanical keyboard, or create a unique one to match your setup",
      "OUTEMU SWITCHES - The gaming mechanical keyboard comes with Outemu mechanical switches for precise gaming and comfortable typing. Spare switches + keycap & switch remover tools are provided for easy replacement",
      "FIBERGLASS PCB - Built with SMD LEDs and FR-4 fiberglass printed circuit board, this Tecware mechanical keyboard is able to withstand extended periods of intensive and hardcore gaming sessions",
      "DOUBLE-SHOT KEYCAPS – Featuring an all-new font, the keycaps on this mechanical keyboard are double-shot ABS (dual-injection molding process) which guarantee high resistance against surface wear; markings that cannot be worn off as they are physically part of the keycaps",
      "SPEED ADVANTAGE - With full N-key rollover and 1000Hz pooling rate, Tecware keyboards allow faster and smoother gaming experience. The depression of each key is detected individually, meaning all key presses will be registered, no matter how many keys you press down simultaneously"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great quality",
        "text": "Very bright lights. Click clack noise keys. Small the way I like it. Portable. Works great. Has usb cover cap too.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Excellent keyboard.",
        "text": "This is my first mechanical keyboard and I really love the quality of this keyboard. The LED's are bright and on keyboard LED controls are very useful as you don't have to depend on the software. The keyboard feels very premium and on par with any other expensive keyboard. I would highly recommend this to others looking for new mechanical keyboard.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "the smaller one with the browns... i love it",
        "text": "ok the onboard RGB stuff is really why i bought this. Its not Razer RGB but for +/- 50 bucks? oh hell yea. The keys are great, if your used to others it might take a sec to get accustomed, but if you use it your fingers will get to know it real nice :) Solid thru and thru.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Yes",
        "text": "Custom color mapping, might need to buy some more resistant switches for keys near my palms.. or I could learn to type properly. Either way, I approve.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great colors",
        "text": "Exactly what my son wanted.  Color control is amazing.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "TECWARE",
    "tags": [
      "Sponsored"
    ],
    "price": 45.99,
    "position": 17,
    "page": 2
  },
  {
    "id": "prod_mechanical_keyboards_068",
    "parent_asin": "B079GZ7KCN",
    "category": "Mechanical Keyboards",
    "title": "YMDK 96 84 ANSI ISO Keyset OEM Profile Thick PBT Keycap Set for Cherry MX Mechanical Keyboard YMD96 RS96 KBD75 YMD75 FC980M(Only Keycap)",
    "description": "Details\nThis link is only the keycaps,no keyboard included.The keycap loading board is only to take photo,not included in the sold package.We will pack the keycaps in our own carton. This keycap set is OEM profile,higher than Cherry profile.The legend is laser engraved. The keycap is made of durable PBT material,the thickness is about 1.5mm. Our store has opened keycap DIY services.If you have interests,don't hesitate to leave us message.\nCompatiability\n115 keys Keyset is Compatible with the 96 84 ANSI and ISO layout whose The bottom row is\n1.25 1.25 1.25 6.25 1.5 1.5 1 1 1 1.25 1.25 1.25 6.25 1 1 1 1 1 1\n125 Keyset Compatible with\nMain 96 layout whose bottom is\n1.25 1.25 1.25 6.25 1.5 1.5 1 1 or 1.25 1.25 1.25 6.25 1 1 1 1 1 or 1.25 1.25 1.25 6.25 1.25 1.25 1.25,suitable for Melody 96 Kira 96 RS96\nStandard 104 87 61 ANSI ISO layout,suitable for Filco Ducky Poker which is most common\nMain 84 layout, suitable for KBD75 YMD75 Keycool 84 XD84\nAfter Service\nIf some keys missing or broken on the way,just leave us message,we will send you missing or broken ones soon.Don't worry about it and don't leave feedback immediately.",
    "rating": 4.3,
    "review_count": 655,
    "features": [
      "This link sells only the keycaps,no keyboard included.There is a puller presented",
      "This keycap set is OEM profile,higher than Cherry profile.The legend is laser engraved.The keycap is made of durable PBT material,the thickness is about 1.5mm.",
      "This Keyset Is Compatible With The 96 84 Keyboard Whose Bottom Row Is 1.25 1.25 1.25 6.25 1.5 1.5 1 1 1 and 1.25 1.25 1.25 6.25 1 1 1 1 1 1",
      "Compaitble with 61 87 104 standard ANSI ISO layout whose bottom row is 1x6.25u+7x1.25u.Space size is around 11.7cm"
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Nice keys, font size a little horsey",
        "text": "Note: I chose the Grey/Beige set. This set (YMDK 96 84 ANSI ISO Key) went on just fine, and are a great frugal find.<br /><br />I bought these for an relatively inexpensive TKL mechanical wireless keyboard (RK87G) because the OEM keycaps were set in a truly fugly and illegible typeface.<br /><br />These YMDKs feel good, and have a slightly deeper \"thunk\" when they bottom out. The two-character keys are typeset vertically, as Underwood and Remington intended. Although the font size on most of the keys is a big, they are fine and give the keyboard a bit of a homemade retro look.<br /><br />NOTE Specific to the RK87G: This YMDK set does not have a ScrlLk key.  The right Shift and right CTRL on this set are a little too small, so I just left the old ones on. I also left the OEM ScrlLk, Page Up, and arrow keys on because they have symbols for controlling the RGB LEDs. If you use the RKs function keys for app and control shortcuts, you may want to leave those on as well.<br /><br />May 30, 2021<br />I've had these for a little over six months now. Still a great value set the money. I installed them on a keyboard I use for hours on end nearly every day. The printing on the beige keys hasn't faded, but I've noticed that the grey keys with white printing are beginning to fade. I'm not taking any stars off because before I purchased these I had already read other reviewers who had the same experience.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Good for the money",
        "text": "It didn’t give me the thoc sound that I wanted but given the price it is good enough",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Rough surface, washed out colors",
        "text": "These caps seems well made enough, with a rough texture that provides ample grip without having a sandpaper effect on your fingers. The colors are a fair bit less saturated than the images make them look. Slightly annoying but they're still quite nice.<br /><br />Do note that this set does not come with a long shift or scroll lock cap. This isn't an issue as they'll be going on a 65% for me but if you're looking to put them on a full size board you may be disappointed.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "good value",
        "text": "satisfied with this purchase although the caps do feel a tad bit rough",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "YMDK",
    "tags": [
      "Sponsored"
    ],
    "price": 24.0,
    "position": 18,
    "page": 2
  },
  {
    "id": "prod_mechanical_keyboards_100",
    "parent_asin": "B09MVGJ2PW",
    "category": "Mechanical Keyboards",
    "title": "IDOBAO 10pcs MA Profile Keycaps 1u Ball Shape for Mechanical Keyboard DIY Blank Keycaps (Blue)",
    "description": "1u MA profile keycaps for DIY",
    "rating": 5.0,
    "review_count": 1,
    "features": [],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Good quality",
        "text": "Good quality and even better sound. Slightly pricey for the quantity but very much worth it.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "IDOBAO",
    "tags": [],
    "price": 7.0,
    "position": 19,
    "page": 2
  },
  {
    "id": "prod_mechanical_keyboards_136",
    "parent_asin": "B092DG81H3",
    "category": "Mechanical Keyboards",
    "title": "Redragon K556 RGB Mechanical Gaming Keyboard M612 Wired Gaming Mouse Bundle",
    "description": "",
    "rating": 4.6,
    "review_count": 16,
    "features": [
      "This bundle includes a K556 gaming keyboard and a M612 Mouse.",
      "K556 Keyboard: The mechanical brown switch offers the best tactile typing experience, also being ever so slightly quieter, fitting for office or gaming use. And you will get 8 spared switches as a gift.",
      "K556 Keyboard: RGB LED adjustable lighting with 6-themed backlights -18 lighting models. You can also adjust their brightness with FN+“↑”and“↓” Besides, there is a 9-color single backlit mode for this keyboard.",
      "M612 Mouse: Pentakill, 5 DPI Levels - Geared with 5 redefinable DPI levels (default as: 500/1000/2000/3000/4000), easy to switch between different game needs. Dedicated demand of DPI options between 500-8000 is also available to be processed by software.",
      "M612 Mouse: Any Button is Reassignable - 11 programmable buttons are all editable with customizable tactical keybinds in whatever game or work you are engaging. 1 rapid fire + 2 side macro buttons offer you a better gaming and working experience."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Small kickstands",
        "text": "The kickstands or keyboard legs are short so even when they are up, keyboard still feels pretty small. Other than that, really good keyboard.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Redragon",
    "tags": [],
    "price": 68.99,
    "position": 20,
    "page": 2
  },
  {
    "id": "prod_mechanical_keyboards_020",
    "parent_asin": "B09RSKHGMH",
    "category": "Mechanical Keyboards",
    "title": "SNAP 75% Mechanical Keyboard Kit (White)",
    "description": "A stylish, 75% split The SNAP is a 75% split mechanical keyboard kit with support for 2 rotary encoders, 2 OLED displays, speaker, and RGB underglow. We took all the best parts of the NIBBLE and added some of the most popular requests: true split shift/space/backspace. The SNAP is configurable, programmable, and easily assembled. 100% through hole design The SNAP uses a Pro Micro MCU instead of a discrete micro-controller chip. It offers the fun and aesthetic of a kit without having to worry about soldering the difficult bits like USB connectors. All required parts diodes, caps, and ICs) are through-hole, meaning they're easy and forgiving to solder. underglow LEDs are surface-mount Multiple Layout Options Use the SNAP in split mode, or snap it whoa, get it?) together for a more traditional layout. Strong internal magnets hold the two sides together and magical spring-loaded pogo pin contacts mean there's no need for a TRRS cable when the two sides are attached. The SNAP supports many configurations and layouts: Split space/backspace, split shift, ISO enter, and more. Since it runs QMK firmware and uses VIA, it's easy to change keymaps, program macros, and customize functionality. RGB underglow ready 10x optional bottom-mounted SMT LEDs shine nicely through the acrylic support material. Included Top & bottom PCB Acrylic supports M2 standoffs & screws Diodes, ICs, decoupling caps, reset switch RGB underglow, speaker, magnets, and pogo pins Rotary encoder & color-matched knob TRRS cable and mini bumpons Not included 2x Bit-Cs or Pro Micro Compatible MCU MX-compatible switches & keycaps PCB-mount stabilizers NOTE: This is a kit which requires assembly and soldering! Bit-Cs, switches, keycaps, and other accessories are sold separately",
    "rating": 4.3,
    "review_count": 17,
    "features": [
      "The SNAP is a high-quality split 75% keyboard kit with tons of room for customization",
      "Use the SNAP together, or separate! It snaps together for a traditional 75% layout or pulls apart for use as a split board",
      "Built around a Pro Micro, rather than a discrete microcontroller. This saves assembly time, and also reduces the build difficulty",
      "All required parts (diodes, caps, and ICs) are through-hole, meaning they're easy and forgiving to solder",
      "RGB underglow ready: 10x optional bottom-mounted SMT LEDs shine nicely through the acrylic support material. RGB underglow is supported natively in QMK, allowing for easy programming and configuration"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Not for the faint of heart",
        "text": "This kit does take a lot of work so I would not recommend it as a first build, or for someone looking for a quick build.<br /><br />It is also a fairly unique one of a kind kit. I don't know of other split 75% keyboards with pro micro support that also have great documentation, support and community. If you are willing to put in the time you will be rewarded with a unique keyboard, and the kit really is fun to put together for experienced builders.<br /><br />I would knock down half star as I encountered some issues with the fitting of the acrylic plate, specifically in these areas:<br />1. acrylic plate fitting at the keyboard split edge, had to use an exacto knife<br />2. acrylic plate fitting with bottom screws of the PCB mount stabilizers, had to make the holes wider<br />3. snap magnets did not fit, gave up trying to fit these<br />4. components pin through the solder joints interfered with acrylic, this is expected and is easily fixable by trimming them down.<br /><br />Apart from that everything worked as expected. Firmware worked on first try and I was easily able to get it working with VIA.",
        "verified": true,
        "helpful_votes": 5
      }
    ],
    "store": "nullbits",
    "tags": [],
    "price": 99.99,
    "position": 21,
    "page": 3
  },
  {
    "id": "prod_mechanical_keyboards_086",
    "parent_asin": "B0727KMLD7",
    "category": "Mechanical Keyboards",
    "title": "Bloody Gaming B740 Wired Optical Gaming Keyboard with Ergonomic Wrist Rest – Quiet & Satisfying Switch Keyboard - LED Backlit Illuminated Keys – Water/Splash Resistant - [Black Switches – LK Gen 1]",
    "description": "",
    "rating": 4.0,
    "review_count": 102,
    "features": [
      "【Ergonomic Integrated Wrist Rest】Bloody’s B740 Optical Gaming Keyboard makes long time typing easier for our users. With the optimal high of the wrist rest set, this allows the wrist to be comfortably placed on the keyboard to easily support the wrist. No matter how long or intense your sessions are, you are always comfortable on this wrist rest.",
      "【LED Backlit Gaming Keyboard】 Bloodys B740 LED Optical Gaming keyboard lighted keyboard come with pre-set animations and static lighting modes. The illumination can be completely turned off or you can also adjust the brightness and effects of the LED at your preference. 8+ preconfigured vivid LED lighting modes allow you to choose immersive lighting effects. Note: All rows are LED and not RBG, LED Gaming Keyboard lights are static.",
      "【Anti-Ghosting & Durability】Award winning Optical Gaming Switches (Light Strike) transmit switch actuation at 0.2ms response times. Being the fastest gaming keyboard switch in gaming. This gaming keyboard is equipped with floating ABS Keycaps that are removable and come with 8 extra silicon keycaps. This Gaming keyboard is also FULLY WATER RESISTANT and will not break now in when accidents happen – 100% anti-ghosting & full N-key rollover over USB and fully programmable with advanced macros.",
      "【PC Optical Gaming Keyboard Compatibility】Windows 10, Windows 8, Windows 7, Windows Vista, or Windows XP, Limited Mac OS keyboard support. Works well with all major Computers Brands and Gaming PCs MSI, Dell, Corsair, Alienware, Razer, Xbox One, Asus and others.",
      "【Console Compatibility】Compatible with Xbox One to play keyboard enabled games"
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "Where's the documentation?",
        "text": "Very heavy keyboard. Certainly doesn't feel like a mechanical keyboard. The tiny insert offers ZERO CLUES as to how the keyboard is supposed to function, ie there is no documentation. The web site reads more like an ad, no clues there, either. The flashing color LEDs remind me of a 1980s video arcade game. You can reduce the brightness down to zero but that's about it. There's a really ugly and difficult to read quasi-sci-fi typeface used on the key caps. The keyboard itself is quite nice, quite heavy. Little kickstand-type feet if you want it angled. A small plastic ramp is included if  you want to rest  your left hand. What's missing here is a MANUAL of some kind. Even a PDF would be just great. Otherwise it's a mystery how this keyboard is supposed to work, what the features are. Somebody blew it. It's nicely designed with some interesting features, but unless you enjoy hardware sleuthing, how are you supposed to know what works, and how it works? Rather maddening. So I don't see this being used, I'll go back to my older keyboard which actually has mechanical clickity click key responses. It's baffling that with  the attention to detail paid to this keyboard that they wouldn't include or provide some DOCUMENTATION. It's basic.",
        "verified": false,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "This is an amazing keyboard! With this and the mouse, I am ecstatic! Don't hesitate on this! Can I give it 6 stars?",
        "text": "Oh wow!  I have waited for several days to review this because my computer was broken and I had to wait for a service tech to drive down and DO something, ANYTHING, with it. When the box came, I was asking myself what it was because the box was HUGE, The inner box was still pretty big, but not huge, It provides a lot of information--including that the keyboard is waterproof, nice since I'm a klutz--and something I'd either not noticed or had forgotten. In side that was a plain black box with a Bloody  hand--or is it a hand print?  The lights are cool, and the bloody hand lights up on both the keyboard and the Bloody Mouse I got a couple of days before the keyboard arrived.  The fast key response is amazing. Even though I'm not a &quot;gamer,&quot; I'm not a total computer novice, having gotten my first one with a gig on the hard drive--custom built--and my co-workers said I'd never use all that memory. Right. Now, my phone has 64 times that with room for expansion and does more than that first computer--or the second--and maybe more than the fifth or sixth.  I still have to download the software, which will probably wait until tomorrow, but I could not wait to start playing with this. It will take me a little bit to get used to the clicking keys, but I am finding I don't mind it, after just writing this much and, well, it does bring back memories. Also, they help me notice if I don't hit a key quite hard enough. (My high school graduation present was a used Royal portable typewriter in a horrible shade of blue--and I still dislike blue. But, I think I can get past those memories. My parents weren't cheap. They were broke at that point in time.) And now, I have probably spent more on this keyboard, even though I was amazingly fortunate to be able to get this at a discount in exchange for my honest, unbiased review, than my family spent on that typewriter.<br /><br />I didn't know what to expect of this, but read what one of the other reviewers said about not needing to be a gamer to appreciate this and I can see, already, how true it is. My typing is faster and I'm just using this for the first time. And now with this and the matching mouse, I can dare to try some of the things I hear about. No, even with this pair, I won't have the fast response time of someone a few decades (well, quite a few) younger, but it will sure help even the playing field for me.  I am so eager to put this through its paces and I am SO happy with it, even this soon, that I have no problem recommending anything with the Bloody name on it.  And I did live in New Zealand for a while, so know that Bloody is not quite considered a polite word.  Too Bloody bad. I love the keyboard and mouse!<br /><br />Addendum: Two days along and I'm even happier! Wow! This thing is great!",
        "verified": false,
        "helpful_votes": 1
      },
      {
        "rating": 4.0,
        "title": "Keyed Up",
        "text": "I don't do a lot of gaming but this is nicer than the old Dell keyboard I was using.  It's kind of loud but otherwise I haven't had any problems typing.  The keys light up when the computer is on and during idle times it puts on a little light show.  I use the old home row technique and haven't seen any increase in errors.  Hunt and peck types might feel differently. I already have a wrist rest so I haven't used the one that attaches to the keyboard.",
        "verified": false,
        "helpful_votes": 1
      },
      {
        "rating": 4.0,
        "title": "Nice keyboard even if it's not mechanical",
        "text": "Nice keys that feel similar to mechanical.  Spacebar is set up so you can press it on the edges and it will  respond just as well as hitting the middle.  Larger keys such as Backspace, Return, Ctrl, and the Windows all work fine.<br /><br />QWER and ASDF keys are colored orange and have a unique, bumpy texture you don't feel on the smooth black keys. I would have preferred orange keys on ASDF and JKL; since that is \"Home Row\" for typists.  The bumpy texture would make it easier to find Home Row without looking.<br /><br />Arrow keys are the common one on top and three below configuration.  The keys I don't often see are a FN key and a weird key with no text label  instead of a second Windows key on the right of the spacebar. The \"weird\" key seems to work as if you right-clicked the mouse. Finally,  you will see the Print Screen (PS), Scroll Lock (SL), and Page/Break (PB) keys placed above the numeric keypad.<br /><br />Aside from the extra keys, the slightly increased resistance, lit keys, and the increased weight of the keyboard itself, there isn't much else that separates this from a standard keyboard.  All keys stay lit when you type and switch to rotating patterns after a minute or two of inactivity. Hit any key and you are back to fully lit.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Solid and positive",
        "text": "There is a lot to like about the Bloody Gaming LED B720 Light Strike Mechanical Gaming Keyboard. Fit and feel, construction, lighting scheme, and most importantly “mechanical keys” are all first rate.<br /><br />Right out of the box, you can feel the weight of this keyboard.  No lightweight here.  Plugging it in, there are no issues with Windows 7 to 10 – drivers are automatically detected and the keyboard is immediately available. The keys light up with a rainbow of color, with each row presenting a different color. On this B720 model, there is no way to change the color scheme, but most people will find it pleasant.  In idle mode, it presents a couple of animations, upon which any key touch will immediately bring back full lighting. Lighting is dimmable to totally “off”.<br /><br />Of course, you do not purchase a keyboard like this without awareness that a variety of mechanical key types exist.  My other keyboard is a Tt esport MEKA Cherry Brown with Cherry MX Brown switches.  Cherry MX brown switches have a moderate travel distance, with some tactile feedback for keystroke and a definite bottom and light clicking noise.  For me, Brown switches provide a nice blend for gaming and touch typing. The Bloody B720 has an Infrared Optic Switch exclusively developed by Bloody, and indicated to be closest to a Cherry MX Black switch. For me, comparing the Optic Switch to Cherry Brown switches, the throw distance seems shorter for the Bloody keys, with less resistance and the bottom just slightly softer.  Click wise, it is mechanically positive, but noise wise less than the brown switch.  Personally, I find both very desirable for the way I type and game, and struggle with finding a preference between “Optic black” and Cherry Brown.<br /><br />On other aspects of the keyboard, the Bloody B720 comes with textured and differently colored gaming silicone keys, along with a nice little left hand support for same.  The quick guide provides limited documentation and the Bloody website for software download. While I did not spend a lot of time with the software, it allows macros and some customization—although no changes to lighting for the B720.<br /><br />If there is anything someone might not like about the Bloody B720 it would probably be the font selection for the keys (a bit sci-fi) along with an inability to control the lighting a bit more fully.  For me, it is fine, I like the way it behaves during use and in its more animated modes.<br /><br />Bloody Gaming may or may not be right about their own proprietary keys becoming popular, since gamers have definite preferences and a multitude of experiences with a variety of keyboards.  I can say, that for the type of work and play I do on a daily basis, I would recommend this keyboard to anyone thinking about a mechanical keyboard.  The Bloody B720 is an attractive solid keyboard providing a great mechanical key typing and gaming experience.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "BLOODY",
    "tags": [],
    "price": 64.99,
    "position": 22,
    "page": 3
  },
  {
    "id": "prod_mechanical_keyboards_156",
    "parent_asin": "B07X3XSP5Y",
    "category": "Mechanical Keyboards",
    "title": "G.SKILL USB KM360 Professional Tenkeyless Mechanical Keyboard, Cherry MX Red, ABS Dual Injection Keycap, (Black)",
    "description": "The G.SKILL KM360 tenkeyless mechanical keyboard is a compact 87-key layout keyboard designed for durability. Featuring long-lasting Cherry MX mechanical keyswitches, wear-proof ABS double injection keycaps, and a solid aluminum top-plate, the KM360 mechanical keyboard is the perfect daily mechanical keyboard. With a detachable USB Type-C cable, it's easy to replace a worn cable by simply swapping it out with another USB Type-C cable of your choice.",
    "rating": 4.7,
    "review_count": 887,
    "features": [
      "CHERRY MX - Most popular mechanical keyswitch for their high standards of quality, reliability, and durability; rated for over 50 million keypresses.",
      "COMPACT & PORTABLE - Designed with a detachable USB Type-C cable and a tenkeyless layout for more desk space and great portability.",
      "WEAR-PROOF KEYS - Using ABS dual-injection keycaps mean the keys won't wear out like printed or laser etched keycaps.",
      "HIGH DURABILITY - Constructed with a solid aluminum top plate and floating keyswitches for easy cleaning.",
      "MODERN DESIGN - Featuring ergonomic keys, white LED backlight, and n-key rollover for comfort and ease of use."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Clicky clack who’s at the rack with the jackets? Me!",
        "text": "I had been eyeing a mechanical keyboard for years, hesitant to buy one because A) I already had a perfectly fine working keyboard and B) Reviews I had read made it sound like they were so noisy you needed to wear ear protection while using one. During a recent move I left my previously mentioned perfectly fine working keyboard outside for an extended period of time, uncovered in the rain and sun and any other elements that rolled though Southern California for those few months. When I finally returned to the keyboard, I found that it had become yet another casualty of the pandemic. Finally I had good cause for a new keyboard, and my research led me to try this one. And like the famous tattoo says, I have no ragrets!<br /><br />I plugged it in and immediately it lit up and off my little fingies went, zipping around the keyboard with the grace and elegance of a gold medal winning gymnast at the 2021 Tokyo Olympics. Every click and clack was like music to my ears, each sentence I typed sounding like a symphony composed by Mozart himself! I now look forward to typing my weekly emails to mother, catching her up with her favorite son’s (sorry Richard, but you know it’s true!) comings and goings!<br />I’ve only had this keyboard for about a week, so time will tell if it will hold up to the rigorous poundings that accompany each email I compose, but as of now I would not hesitate to recommend this keyboard to all my many (ok, zero) friends! Now I can’t wait to get off from my day job as a clerk typist and go home and get some typing in!",
        "verified": true,
        "helpful_votes": 9
      },
      {
        "rating": 5.0,
        "title": "Great Initial Impression",
        "text": "My first foray into mechanical KB and cherry switches. I was familiar with GSkill as they are a trusted brand in performance PC DDR4 RAM. I liked the price point and the size was perfect. Smaller than a full size but still having arrow keys and delete, etc off to the side.<br />I’m no KB expert, but it appears to be of good quality and finish. Nice adjustable LED backlighting. It has a sleeved nylon cable that’s white and matches the board nicely. Typing on it will take some getting used to, but I’m liking it so far and will update later if there’s any issues.",
        "verified": true,
        "helpful_votes": 3
      },
      {
        "rating": 5.0,
        "title": "Amazing keyboard EDIT:",
        "text": "Amazing keyboard.  I'm typing on my new G.SKILL KM360 Professional Tenkeyless Mechanical Keyboard and YES it amazing!  Seriously if you have the money by this product.  Totally worth every penny! It's been just over a year since I got this mechanical keyboard & the USB type C is coming loose, I have to move the cord back N forth so it will connect again. Not sure if it can be fixed or not. (EDIT) I got this in October of 2019 & the small side of the USB Type-C female side is breaking off, causing the keyboard to flicker on and off. Other than that it's awesome keyboard",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Great keyboard from a regular joe",
        "text": "This is my first keyboard and saw great review. I’m not a big gamer or anything but recently started playing a little on a gaming laptop and thought why not. I thought the keyboard on the laptop were fine but damn these are better. I started using them for work and everything and love this key board now. So if your on the fence just do it.<br /><br />10/10",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Almost perfect",
        "text": "Exactly what I was looking for in an TKL board. The only thing that’s below standard are the kick stands. They don’t provide much resistance, so when you just nudge the keyboard forward the kickstands collapse - not sure if they need to be more sturdy or have a more grippy rubber foot but a rather disappointing feature to an otherwise perfect set up.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "G.Skill",
    "tags": [],
    "price": 55.99,
    "position": 23,
    "page": 3
  },
  {
    "id": "prod_mechanical_keyboards_056",
    "parent_asin": "B013D4RQ9W",
    "category": "Mechanical Keyboards",
    "title": "UniFire V60 Waterproof 2.4G Wireless Gaming Keyboard with Mouse DPI Control For DESKTOP PC Laptop Wireless Keyboard Mouse Combos (black)",
    "description": "Specification:\n1. Model: V60 2. Optical resolution: 1600DPI 3. Mouse Resolution : 1000DPI 4. Type : Wireless keyboard and mouse combo 5. Operation Range : Up to 10 m 6. Compatible with laptops/desktops/intelligent televisions 7. Keyboard: - Keyboard Dimensions: 445x150x25mm(L x W x H) - All of the keys lifespan up to 1-500-000 times - 8 multimedia key combination- simple and convenient 8. Mouse: - Mouse size: 115 * 67 *45mm - Ergonomically designed- comfort grip - Micro nano-receiver 9. Keyboard battery: 1 * AA battery(not included) 10. Mouse battery: 1 * AA batteries (not included)\nPackage Contents:\n* 1 X Wireless Keyboard * 1 X USB Wireless Mouse * 1 X USB receiver",
    "rating": 4.0,
    "review_count": 117,
    "features": [
      "Wireless QWERTY Keyboard , Wireless Mini Optical Mouse, Tiny USB Receiver.OS: Windows Me/2000/XP/Vista/7 Android TV BOX & Tablet PC.",
      "Compact size & fashionable design.",
      "Support 32 equipments without to disturb each other",
      "Compact size & fashionable design. Wireless carrier frequency: 2402MHz-2480MHz.",
      "Mouse with DPI governor, keyboard and mouse Share one receiver, more convenient."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "I love your keyboard and mouse it has wireless the rechargeable ...",
        "text": "I love your keyboard and mouse it has wireless the rechargeable batteries last weeks to a month depending on extended usage. It looks super cool and lightweight and small to fit for my favorite gaming games.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Flimsy & Cheap",
        "text": "The keyboard and mouse refused to connect to my computer at the same time.  When one connects the other stops functioning.<br /><br />I've missed the return window.  But it is flimsy and poorly made.  Do not buy.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great!!",
        "text": "Great very easy to use.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Soke-Six",
    "tags": [],
    "price": 32.99,
    "position": 24,
    "page": 3
  },
  {
    "id": "prod_mechanical_keyboards_091",
    "parent_asin": "B09TP9JZ6F",
    "category": "Mechanical Keyboards",
    "title": "EPOMAKER Mix 1.8m Coiled Type-C to USB A TPU Mechanical Keyboard Space Cable with Detachable Aviator Connector for Gaming Keyboard and Cellphone(Grey)",
    "description": "",
    "rating": 4.6,
    "review_count": 628,
    "features": [
      "【Epomaker MIX Cable For Keyboards and More】Ideas coming from our community, Epomaker custom MIX cable is designed to matches your keyboard, no matter what type of setup you’re working with. Choose from our different color options, it comes easy for you to match your keyboard and top off your setup. Besides that, this cable features all you want and need: Double-shielded USB 2.0 compliant, 61-gauge, 4-conductor, etc",
      "【Durable and Flexible】Epomaker custom MIX cable is durable and flexible due to the strict selection of the durable techflex and PP double-sleeves raw materials. The coiled design enables the cables easily to integrate into a wide range of spaces",
      "【USB-C Interface, USB 2.0/3.0 Compatible】For versatile connectivity, each one is equipped with a detachable aviator port to accommodate different connectors. Included in this run is a USB-C connector cable to fit modern boards",
      "【Various Colors Choices】The cable is designed in various vivid colors to match different keyboard trend. Epomaker custom MIX cable is dedicated to adding more vibrant energy to your daily life and work. Solid color, contrast colors, or one with various colors like a rainbow? It is up to you! Get one to match your keyboard right away!"
    ],
    "reviews": [
      {
        "rating": 2.0,
        "title": "That's not what I expected",
        "text": "The cable does not have the diameter of the expected coils and the aviator connector is not of good quality. I don't think it will last long.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Nice looking and a great add for keyboard enthusiasts!",
        "text": "Do you need a cable with an aviator connection?  No, but do you want one? Yes!  I like the mesh sleave on the cable, that gives a premium look and a perceived ruggedness.  I chose the grey so whatever keyboard I hook up (or any USB-c peripheral) it looks nice.<br /><br />Only ding I would give it is that if the keyboard needs to be to the left the cable off the coils is on top and does not look as nice.  If the cable is oriented to the right, it looks better.  I don't have any major issues here, but it is something that shoudl be in the product description maybe.<br /><br />Overall, really nice and glad I bought it!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "EPOMAKER",
    "tags": [
      "Sponsored"
    ],
    "price": 19.99,
    "position": 25,
    "page": 3
  }
]