[
  {
    "id": "prod_toothbrushes_093",
    "parent_asin": "B083VW4MGZ",
    "category": "Toothbrushes",
    "title": "GUM Crayola Twistables Kids Toothbrush with Fun Twisting Head, Soft Bristles, Ages 3+ (Pack of 4) -230TT",
    "description": "Product Description\nGetting your kids excited about their daily tooth brushing routine requires more than just an ordinary kids toothbrush. Give them the fun and functional GUM Crayola Twistables Toothbrush for kids. It’s one of the best toothbrushes to keep kids engaged with bright and colorful handles, as well as a twistable head that can be extended from the toothbrush handle with a twist of the bottom green knob. When not in use, kids can twist the toothbrush back and store upside down in the included toothbrush cap. The cap doubles as a stand to keep the brush from rolling off the bathroom sink. This toothbrush also comes with soft, antibacterial bristles to further inhibit germ growth. The toothpaste sweet spot is highlighted by the colored bristles in the center of the compact head to teach children how much toothpaste they should be using. If you want to equip your little ones with a kids' toothbrush that will get them enthusiastic about their twice-daily tooth brushing routine, the GUM Crayola Twistable Toothbrush is what you need.\nManufacturer Contact Information\n1-888-777-3116",
    "rating": 4.0,
    "review_count": 52,
    "features": [
      "EXTENDABLE TOOTHBRUSH HEAD: Twist the green knob on the handle to extend the compact toothbrush head for a fun and functional cleaning experience",
      "KIDS TOOTHBRUSH CAP & STAND: Convenient antibacterial cap and stand to keep the brush from rolling off the sink. When it’s time to travel, pop the cap on top to cover the brush – perfect for road trips, camping, and sleepovers",
      "CLINICALLY PROVEN BRISTLES: GUM Dome Trim brushes feature a raised center bristle design that provides greater contact with the tooth surface, while also reaching under the gum line",
      "TOOTHPASTE SWEET SPOT: The compact head features colored centered soft bristles that teach children where to place their toothpaste and how much paste is needed",
      "THE GUM MISSION: We are committed to helping people of all ages have stronger, healthier teeth, and gums by providing high quality, innovative oral care products that promote optimal dental health"
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "Meh its ok",
        "text": "Its just a cheap what you would get for free at the kids dentist office kind of brush. Its totally flat but thats not a huge deal for me. The brush twisting gets my kids more into brushing their teeth but when I am brushing, the brush itself doesn't lock into place as as you are going around in their mouth and moving your hand it twists and doesn't stay in place. So I am typically adjusting at least once mid brush. Usually my kiddos are good about brushing but they have their days so its those days its really an issue for me. For the price it isn't worth it for me.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great product! Decent price!",
        "text": "(Picture only shows three but there were four) adorable colors and tons of fun for my four year old. I thought they twisted all the way down but actually the head stays out then u use the stand as a cover which is what I needed since hes always knocking stuff off the bathroom sink. Will recommend to friends and family, and buy again in the future, really great product!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "GUM",
    "tags": [],
    "price": 8.67
  },
  {
    "id": "prod_toothbrushes_024",
    "parent_asin": "B01KCJCMIG",
    "category": "Toothbrushes",
    "title": "DentistRx Intelisonic Brush Heads Refill, 2 ea - 2pc",
    "description": "This DentistRx Intelisonic Brush Head Refill includes 4 brush heads. The heads have a Tri-Peak bristle head that conforms to the contour of the tooth for more effective deep cleaning. The heads are designed for use with the DentistRx Intelisonic Sonic Toothbrush. Contains 4 brush heads.",
    "rating": 4.8,
    "review_count": 251,
    "features": [
      "DentistRx Intelisonic Brush Head Refill",
      "Designed for use with the Intelisonic Sonic Toothbrush",
      "Tri-Peak bristle design for effective cleaning",
      "Conforms to the contour of teeth for deep cleaning",
      "Includes 4 brush heads"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Excellent Product",
        "text": "Excellent Product",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Just like the originals.",
        "text": "Just like the originals. Works great.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "DentistRx",
    "tags": [],
    "price": 36.09
  },
  {
    "id": "prod_toothbrushes_103",
    "parent_asin": "B09XJHV9V8",
    "category": "Toothbrushes",
    "title": "American Comb Toothbrush Holder - Translucent White - Made in The USA!",
    "description": "",
    "rating": 4.3,
    "review_count": 8,
    "features": [],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Awesome",
        "text": "I have never seen a toothbrush holder with this type of new engineering. It has like a magic see through metal that is lighter. This \"magic metal\" don't even rust 🤔",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Does it’s job, inexpensive…",
        "text": "Had to trim flashing in order to close.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "American Comb",
    "tags": [],
    "price": 4.99
  },
  {
    "id": "prod_toothbrushes_088",
    "parent_asin": "B09FR82V6F",
    "category": "Toothbrushes",
    "title": "Milos Electric Toothbrush Replacement Heads for Kids, Oral B Compatible Pack of 16, Extra Soft Bristles, Fits for Electric Braun Brush Heads, Refill for Vitality Precision Sensitive and Clean Triumph",
    "description": "",
    "rating": 4.5,
    "review_count": 461,
    "features": [
      "Compatible - Our toothbrush head set is versatile and compatible with most Braun and Oral B toothbrushes (excluding Oral B Pulsonic and iO).",
      "Professional - Show those pearly whites with confidence! The flexible DuPont bristles on our toothbrush replacement brush heads are designed to remove plaque and promote healthy gums.",
      "Convenient - Each brush on our kid toothbrush head replacement set has a color-coded ring at the bottom to make differentiation easy for the whole family.",
      "Fading Bristles - Take the guesswork out of your hygiene routine. The colored bristles on these toothbrush refills fade to let you know when it's time for a replacement.",
      "Pack Includes - This electric toothbrush head set comes with 16 replacements to make sure you stay on top of your oral health."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "I just got it so I can't comment on durability, but...",
        "text": "This is much less expensive than Oral B brush heads. I contacted Oral B to tell them I thought their brush heads are exorbitantly priced, but they blamed it on supply chain issues. So apparently Milos is somehow not affected by supply chain issues. It kinda makes it seem like Oral B's response was B.S. Anyway, these heads I bought fit my Oral B ProHealth toothbrush. It's kind of weird that the bristles aren't all flush with one another, but they seem to work fine. I don't care that the colors don't match with the toothbrush body.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Cheap off brand",
        "text": "You will go through these fast as they seem to wear down super quick. They came fast and were cheap I need them quick as we ran out but I won't order them again.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Milos",
    "tags": [],
    "price": 17.75
  },
  {
    "id": "prod_toothbrushes_066",
    "parent_asin": "B0956W79T9",
    "category": "Toothbrushes",
    "title": "Pop Sonic Electric Toothbrush with Travel Case (Teal) - Soft Electric Toothbrushes Keeps Mouth Fresh All-Day Toothbrush w/ 2 Speed - 18,000-24,000 Strokes/Minute Vibrations",
    "description": "",
    "rating": 4.2,
    "review_count": 284,
    "features": [
      "Portable Electric Toothbrush With Case: Our battery operated toothbrush for adults and kids keeps your mouth fresh all day. This kit includes 1 x soft bristle electric toothbrush handle, 2 x Brush Heads with Nylon Bristles, 1 x Toothbrush Case, One AAA Battery, & Instruction Manual.",
      "Gives Perfect Strokes: Our tooth brushes for teeth electric feature 2 speeds (to control your cleaning) with vibrations from 18,000 to 24,000 brush strokes per minute. These electric travel toothbrushes contain an easy-to-use on / off switch.",
      "Styling Carrying Case: This portable toothbrush electric comes with its own carrying case making travel toothbrushes ideal for on-the-go oral care. The stylish electric toothbrush carrying case protects from unclean surfaces and avoids spillage from a wet toothbrush after use.",
      "Great for Kids Too: With our whitening toothbrush, handy carrying case, and selection of bright colors, kids will love the Go Plus Sonic Toothbrush. Perfectly sized electric toothbrush for kids 8-12 or above that fits smaller hands for younger, more sensitive mouths.",
      "Durable, Develop Healthy Brushing Habits: These oral hygiene products are programmed with a quadrant pacer and a 2-minute timer. Our travel electric toothbrushes for adults and kids are made with high-quality and long-lasting DuPont nylon bristles for longer life."
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "Nice toothbrush with a travel case",
        "text": "Nice toothbrush with a travel case. The vibrations are weaker than expected.  I like the timer.  We'll see if the dentist notices a difference.",
        "verified": true,
        "helpful_votes": 5
      },
      {
        "rating": 5.0,
        "title": "Great toothbrush to take for travel",
        "text": "I hate when having to choose to use a regular stationary toothbrush, or my big rechargeable toothebrush when traveling. This toothbrush was perfect to take with me on my last trip as it is small, lightweight, sleek with the rose gold design, and comes with a really nice and compact case. Another huge plus is that it is really very quiet when it is on, so you don't risk having to wake others up. It is a great choice for a travel toothbrush.",
        "verified": true,
        "helpful_votes": 4
      },
      {
        "rating": 2.0,
        "title": "It's just a vibrating toothbrush",
        "text": "This is really just a vibrating toothbrush.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "I really love it",
        "text": "This toothbrush is perfect in every possible way.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Pop Sonic",
    "tags": [],
    "price": 19.99
  },
  {
    "id": "prod_toothbrushes_193",
    "parent_asin": "B093T23TGR",
    "category": "Toothbrushes",
    "title": "Patelai 200 Pieces Dual-Use Interdental Brushes Soft Silicone Dental Picks Toothpicks Between Teeth Brush, Tooth Flossing Brush for Cleaning Orthodontic Wire Toothbrush Clean Tool",
    "description": "Features:  Wide scopes of usage: You can use our interdental brushes to remove dental plaque and food residues between your teeth and orals, it can also be applied to massage your oral, help remove bad breath and keep your teeth clean, also improve your oral health. Besides, it can effectively clean dental appliances, implants and bridges, which are easy to hide dirt in the oral cavity.  Easy to carry: This set of interdental brush is small in size and light in weight, it is very convenient to carry, whether it is at home, school, home or traveling, you can carry it with you and use it anytime, anywhere.  Specifications: Color: blue, green Size: approx. 5.2 x 0.7 cm/ 2.04 x 0.27 inches (each piece) Material: soft silicone Quantity: 200 pieces  Package includes: 200 x Interdental brushes  Warm notes: Please allow slight deviation due to manual measurement. Please allow slight color difference due to different monitor. Pointed parts included, please keep away from the little kids.",
    "rating": 4.3,
    "review_count": 313,
    "features": [
      "What you will get: you will receive 200 pieces of interdental brushes, including 100 pieces in blue and 100 pieces in green, each with a size of about 5.2 x 0.7 cm/ 2.04 x 0.27 inches, with a storage box, enough number to meet your daily life use and replacement, you can choose the color you like and use it with your family",
      "Practical dual-use design: you can use the toothpick at both ends, soft material gently touch your mouth, curved design makes it more flexible to clean your mouth, the tip makes it ideal for cleaning in smaller and wider spaces, and the texture on the handle has an anti-slip effect, making it easier to control during use. Disposable design, discarded after each use, helps maintain clean",
      "Strong cleaning performance: the toothbrush alone cannot effectively clean your teeth, you can use our dental picks to remove dental plaque and food residues between your teeth and oral, it can also be applied to massage your orals, help remove bad breath and keep your teeth clean, also improve your oral health",
      "Portable and compact size: this set of tooth flossing brush with storage box is small in size, light in weight, compact and convenient, easy to put in your pocket or wallet, light and easy to store. Whether it is at home, school, work or traveling, it can be carried with you and applied anytime, anywhere",
      "Versatile applications: this soft toothpick is small and flexible, it can not only clean teeth but also effectively clean dental appliances, implants, and bridges, which are easy to hide dirt in the oral cavity. It can easily enter the narrow breach area for cleaning. Help you maintain a healthy oral and a good personal image"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Good quality.",
        "text": "Just as good as name brands.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 3.0,
        "title": "Too unstable",
        "text": "Not sturdy.  Bends",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Sturdy",
        "text": "We use these for extra cleaning between teeth!  It doesn’t disintegrate like some, they are pretty sturdy.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Patelai",
    "tags": [],
    "price": 11.99
  },
  {
    "id": "prod_toothbrushes_013",
    "parent_asin": "B004C6QP3Y",
    "category": "Toothbrushes",
    "title": "Philips Sonicare Toothbrush e Series Heads Fits: Essence, Xtreme, Elite and Advance - 6 Pack",
    "description": "Clasic Clean: Fits the natural shape of your teeth for a thorough clean Reminder bristles fade when replacement is needed For best results use only Philips Sonicare brush heads Recommended to replace brush head every 3 months for optimal results e series Fits: Essence, Xtreme, Elite and Advance.",
    "rating": 4.7,
    "review_count": 2023,
    "features": [
      "Clasic Clean: Fits the natural shape of your teeth for a thorough clean",
      "Reminder bristles fade when replacement is needed",
      "For best results use only Philips Sonicare brush heads",
      "Recommended to replace brush head every 3 months for optimal results",
      "e series Fits: Essence, Xtreme, Elite and Advance"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great Toothbrush Heads",
        "text": "This is the 3rd time ordering these and it's a great deal! Nice to have a stock of these. These are real Philips Sonicare so they work perfectly in our toothbrush bases. Great price. Great product.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Four Stars",
        "text": "Needed then for the sonicare. price is reasonable. got them when there was not sales tax at that time",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Philips Sonicare toothbrush head",
        "text": "These toothbrushes are a very good deal. There are enough in the 6 pack to last over a year because one toothbrush lasts at least 3 mos.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "A good value. Most cost $12",
        "text": "A good value. Most cost $12.00 and up apiece. Here it comes out to $8 and some change.Will last a year and a half.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Best Deal for Philips Sonicare Replacement Heads",
        "text": "I doubt you can beat this deal. Always use the Philips Sonicare e Series replacement heads. The knockoffs do not work!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "PHILIPS",
    "tags": [],
    "price": 92.0
  },
  {
    "id": "prod_toothbrushes_017",
    "parent_asin": "B00C7P8BAC",
    "category": "Toothbrushes",
    "title": "Dental Source Travel Toothbrush and Crest Toothpaste Kit, 2 Piece set",
    "description": "",
    "rating": 4.4,
    "review_count": 65,
    "features": [],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Just what we needed",
        "text": "Item just as described, Sent Quickly!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Dental Source",
    "tags": [],
    "price": 11.98
  },
  {
    "id": "prod_toothbrushes_141",
    "parent_asin": "B07VKQSY66",
    "category": "Toothbrushes",
    "title": "Bamboo Toothbrushes Pack of 4 | eco-Friendly & Biodegradable | Non-Plastic BPA Free Soft Natural Bristles For Gingivitis And Sensitive teeth | Recyclable Eco Toothbrush Men & Women | By laboos",
    "description": "",
    "rating": 4.4,
    "review_count": 200,
    "features": [
      "🌎INTENSIVE AND SOFT BRISTLES: With 38 PBS super soft bristles, these natural bamboo toothbrushes allow for thorough and enjoyable cleaning.",
      "🌎THICK AND COMFORTABLE HANDLE : A thicker handle than normal bamboo toothbrush for your more comfortable brushing.",
      "🌎4-PACK WITH 2 ELEGANT COLORS : Two colors designed specifically for couples and lovers, more natural and elegant every day.",
      "🌎PROFESSIONAL BAMBOO TOOTHBRUSH BRAND: laboos make a variety of environmentally friendly toothbrushes, please go to our laboos store, there must be a toothbrush that meets your needs.",
      "✅ CREATED FOR YOUR 100% SATISFACTION"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "No plastic",
        "text": "Nice texture in hand unlike other wood or bamboo brushes.  Also no plastic packaging.  A big plus!",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Soft and pretty",
        "text": "Soft and light and very esthetically pleasing.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Some bristles do not stay stay aligned",
        "text": "After only a few brushing, some bristles became unaligned and started poking my gums.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Perfectly advertised",
        "text": "Great perfectly advertised",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Bad",
        "text": "Bad bad bad ! The brush was falling apart after my second brushing.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "laboos",
    "tags": [],
    "price": 7.95
  },
  {
    "id": "prod_toothbrushes_102",
    "parent_asin": "B09V1757S5",
    "category": "Toothbrushes",
    "title": "BEBEN Sonic Electric Toothbrush for Adults, IPX7 Toothbrush Electric with Long Battery Toothbrush Life for 60 Days, Rechargeable Electronic Toothbrush Set with 5 Tooth Brush Heads-White",
    "description": "",
    "rating": 4.2,
    "review_count": 47,
    "features": [
      "High Frequency For Deeper Cleaning---From 31,000 to 43,000 sonic vibrations per minute, effectively remove plaque and reduce gums bleeding. Deep cleaning between teeth. The cleaning effect is far more remarkable than manual toothbrush",
      "5 Cleaning Modes and Smart Memory Function---5 high performance brushing modes for different tooth and gum conditions: Clean, White, Fresh, Soft and Strong. Equipped with intelligent memory function. When you use it again, it will automatically select the mode you used last time",
      "Efficient Type C Charging and 60 days Battery Life---Charged once, works for 60 days. The powerful and durable battery life means you don't have to charge it frequently. Advanced USB C charging port is compatible with most USB power adapter, make your travel more convenient",
      "2 Minutes Timer for Scientific Brushing Habit---Follow scientific dental advice with built in 2 minutes smart timer. The toothbrush pauses every 30 seconds to remind you to move, precisely control your brushing time",
      "IPX7 Waterproof with 5 Replacing Brush---IPX7 waterproof level, no fear of washing with water. Handy to use and easy to clean. 5 spare brush heads are included in the package, no need to pay extra for replacement brush heads"
    ],
    "reviews": [
      {
        "rating": 2.0,
        "title": "good quality,yet cannot use",
        "text": "very nicely built.usb charge cord not crazy about. tried using it,  has a vibration which I find very unpleasant. vibrates teeth so much even on low setting goes to the nerve. if you have sensitive teeth you will not like it. battery powered use everyday with no issues .tired of purchasing batteries so thought I would give this a try.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Excellent toothbrush",
        "text": "Nice toothbrush.  Gers your teeth clean.  Very pleased.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "BEBEN",
    "tags": [],
    "price": 9.99
  },
  {
    "id": "prod_toothbrushes_074",
    "parent_asin": "B09MSZQJV8",
    "category": "Toothbrushes",
    "title": "Kids U-Shaped Toothbrush, Food Grade Soft Silicone Brush Head, U-Type Toothbrush Whole Mouth with Handle for Kids, 360°Oral Teeth Cleaning Design for Toddlers and Children, Heart Shape 2-6 Ages",
    "description": "Kids U-Shaped Toothbrush, Food Grade Soft Silicone Brush Head, U-Type Toothbrush Whole Mouth Toothbrush with Handle for Kids, 360°Oral Teeth Cleaning Design for Toddlers and Children",
    "rating": 3.5,
    "review_count": 22,
    "features": [
      "COMFORT AND SAFETY: The easy-grip handle provides comfort and security, making it easier for toddlers to hold their own toothbrushes. Two lovely colors increase your child's interest in brushing and have fun while brushing.",
      "INNOVATIVE U-SHAPED DESIGN: Ergonomic U-shaped brush head that fits the shape and mechanics of children's tooth structure. Specifically designed for children's delicate gums and sensitive teeth.",
      "360° FULL CLEANING: The 360° full cleaning brush head, soft nipple-grade silicone, provides a comfortable brushing feel and cleans your teeth properly without twisting your wrist. Effective deep cleaning without damaging gums and protecting children's enamel.",
      "CUTE DESIGN: This cute U-shaped manual kids toothbrush is designed to make brushing for kids (2-6 years old) more fun and easy. Let your child try it once and he or she will love this toothbrush.",
      "PACKAGE INCLUDES: pink toothbrush*1, blue toothbrush*1, saliva towel*1. After receiving the product, if you have any questions or concerns, please contact us so we can help."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "great deal",
        "text": "Really cannot pick because of the price. Item as described and came with a very simple bib. These work as awesome teethers for my twins but in order to make it work for toothbrushing independence, you do need a cooperative toddler who's willing to bite down and keep the teeth between the brushes. If your kids are willing to bite down and brush with these, they work great for encouraging toddlers to maintain healthy dental hygiene. I think it's already awesome for the price and works great as a teether.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "SOELYIAS",
    "tags": [],
    "price": 6.99
  },
  {
    "id": "prod_toothbrushes_028",
    "parent_asin": "B09ZHP88CD",
    "category": "Toothbrushes",
    "title": "Travel Toothbrush Cup, Multifunction Capsule Shape Wash Gargle Cup Portable Business Trips Travel Toothpaste Case Toothbrush Holder Organizer Box",
    "description": "Material:\nMade of high-quality food-grade ABS\nWhy we choose it?\n- The transparent cup ensures contents clearly visible and easy to access. - Excellent cold weather flexibility. - Ultraviolet stability-20 years service life as exposed membrane guaranteed. - Light, easy to spread into place. - Completely homogeneously bonded seams with no seam edge or flap. - Excellent tensile, tear and elongation mechanical properties to ensure a long service life.\nApplication Occasions: Home, Outdoor, Travel, camping, Office, School, etc.\nSpecification:\nSize: 2.9\"(Diameter)×8.27\"(Height). The diameter of the attachment ring is 2.95 inches. Capacity: 350ml each cup Weight:130g\nPackage Include:\n1 x Travel Toothbrush Case",
    "rating": 4.3,
    "review_count": 3,
    "features": [
      "Best Material - Made of high-quality food-grade ABS material, good performances at high temperature. The transparent cup ensures contents clearly visible and easy to access.",
      "Separable into Two - It is connected by an attachment ring and can be separated as two cups, each of them can hold 350ml water, well sealed.",
      "Multifunctional - The cup is 8.27\" height x 2.95'' diameter , can be used for toothbrush, toothpaste, towel or cosmetics storage at daily or traveling, suitable for travel for two.",
      "Durable - It's sturdy and won't easily break after falling to the ground. And it's so lightweight that you can use the them as gargle cup or water cup.",
      "Portable - This travel mug looks like capsule which is cute. Compact size makes it easy to travel with and doesn't take up storage room when on a bathroom counter."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Easy care. Holds full sized brush and toothpaste.",
        "text": "I take this everywhere. We travel a lot. So, it gets a lot of wear and tear and a little bit dirty. It’s so easy to clean, I just throw it in the dishwasher. Also love the fact that her holes a full sized toothbrush and toothpaste. Highly recommend.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "FANTASTIC",
        "text": "THE SIZE AND COLOR ARE GRAT,,THEY HOLD ELECTRI TOOTH BRUSH TOOTH PAST AND MORE ITS AN ANWESOME ITEM",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great for travel",
        "text": "I bought two of these for our trip to Italy. Stayed closed in our luggage and fit perfectly on the bathroom counter upon arrival. I was able to place a full size tube of toothpaste and full-size toothbrush.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "JOMIHONEY",
    "tags": [],
    "price": 12.99
  },
  {
    "id": "prod_toothbrushes_121",
    "parent_asin": "B07D6HRLJY",
    "category": "Toothbrushes",
    "title": "Reach Toothbrush Cover, 4 Count",
    "description": "Tooth brush covers, fit any toothbrush and have unique ventilation holes",
    "rating": 4.5,
    "review_count": 504,
    "features": [
      "Made from quality materials",
      "Take your hygiene to the next level",
      "Classic products you can count on"
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "Adequate",
        "text": "Had a really hard time finding a cover that would fit even a standard plastic and an Oral B toothbrush. These do the trick, but barely.",
        "verified": true,
        "helpful_votes": 3
      },
      {
        "rating": 5.0,
        "title": "I think it is overpriced",
        "text": "They are great to tell whose toothbrush iswhose",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Perfect",
        "text": "My favorite toothbrush cap.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Not a single one would stay closed",
        "text": "Every single one fell off the toothbrush; none would stay closed.  I can't even return them, because they got lost NOT doing their job.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Fit all size toothbrushes",
        "text": "I love these toothbrush covers. They fit any size toothbrush not just your standard size.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Reach",
    "tags": [],
    "price": 5.99
  },
  {
    "id": "prod_toothbrushes_127",
    "parent_asin": "B07SLTPSYG",
    "category": "Toothbrushes",
    "title": "grabease Double-Sided Toothbrush for Ages 6 Months to 4 Years, Soft Bristles & Choke Protection Shield, BPA-Free, 1 Pack, Yellow",
    "description": "",
    "rating": 4.4,
    "review_count": 23,
    "features": [
      "INDEPENDENT TOOTHBRUSHING: Introducing our game-changing toothbrush designed for independent toothbrushing in babies, toddlers, and preschool kids aged 6 months to 4 years! With its two-sided design, this toothbrush encourages a positive approach to oral hygiene. The pack includes one double-sided toothbrush that's perfect for little hands, and a silicone finger brush for gentle gum massage. This toddler toothbrush is ideal for a child's first toothbrush, making dental care fun and easy.",
      "DOUBLE-SIDED TOOTHBRUSH: Our toothbrush is designed to give your child a dazzling smile in no time! The innovative, tapered bristles on both sides of this brush offer maximum contact with teeth - perfect for easily-distracted little ones. Plus, a bonus finger toothbrush is included, ideal for infants, and kids experiencing sensory or sensitivity issues. Ensure your child's dental care starts off strong with our versatile brush set.",
      "SOFT BRISTLES & CHOKE PROTECTION: Our patented design ensures a safe, mess-free tooth cleaning experience for both toddlers and parents. With a built-in choke barrier, the Brush prevents over-insertion and gagging. The soft, flexible bristles are gentle on tender gums and new baby teeth. This versatile toothbrush is a must-have for your baby's first dental care kit - perfect for toddlers, first-time brushers, and those transitioning from finger toothbrushes.",
      "EXPERT APPROVED: Specially designed for infants and toddlers, our patented toothbrush has the seal of approval from top pediatric dentists. With endorsements from the American Academy of Pediatric Dentistry, you can trust that our product is perfect for your child's needs. Remember to replace every 3-4 months for optimal oral hygiene. Shop with confidence, as our brushes ensure a safe, effective start to your baby's dental journey. Order spares or stock up now!",
      "CERTIFIED SAFE: Meticulously lab-tested to meet the most stringent USA safety standards for your baby's wellbeing. Our toothbrushes are 100% BPA, lead, and phthalate-free, ensuring your child's safety as they learn proper oral hygiene. Guide your child with our double-sided toothbrush designed specifically for their needs - from their first tooth to confident self-brushing as a toddler. Create healthy habits under your loving supervision with Grabease."
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "Not a primary toothbrush",
        "text": "It’s hard-to-impossible to clean the front of my 18 month olds teeth with this. It’s too big. I can use a different brush for that, and then give this to him to “play with” for a few minutes. He makes gagging sounds but it is safe, of course; it’s just much bigger than other baby brushes. I’d save for older toddlers and even then it might be hard for fronts of teeth.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 4.0,
        "title": "Cheaply made",
        "text": "Liked it but bristles got kind of funky quickly..",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great",
        "text": "Great baby’s first toothbrush",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "So far so good.",
        "text": "baby likes this, but i feel that it's a little bit on the shorter side. It does get the job done: cleaning teeth!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "like, but its not love",
        "text": "we've been using this for about a few weeks and it looks like we've had it for a year- its frayed pretty bad :(<br />**update- we trashed it and bought the cheaper ones. its not worth the price if its only going to last 2 weeks.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "grabease",
    "tags": [],
    "price": 10.99
  },
  {
    "id": "prod_toothbrushes_039",
    "parent_asin": "B09BTP1MN3",
    "category": "Toothbrushes",
    "title": "Oral-B Sensitive Clean Electric Toothbrush Head with Clean & Care Technology, Extra Soft Bristles for Gentle Plaque Removal, Pack of 12, Suitable for Mailbox, White",
    "description": "As one of Oral-B’s premium replacement toothbrush heads, the Sensitive Clean features ultrathin bristles that are gentle on gums, combined with regular bristles that are tough on plaque. Sensitive Clean removes up to 100% more plaque and reduces gum inflammation by 100% compared to a manual toothbrush. The unique combination of end rounded and ultrathin bristles make Sensitive Clean ideal for everyone with a sensitive mouth and everyone who is looking for just a great gentle clean. Compatible with all Oral-B handles except Pulsonic & iO.",
    "rating": 4.7,
    "review_count": 2523,
    "features": [
      "Easy delivery: 12 counts of Oral-B Sensitive Clean toothbrush head in a mailbox compatible and non-printed recyclable packaging",
      "With Clean Maximiser technology, green bristles turn yellow when it is time to replace your brush head",
      "Up to 100 Percent more plaque removal and healthier gums vs. a regular manual toothbrush",
      "Oral-B’s best for whole mouth cleaning (excluding Oral-B iO)",
      "Dentists recommend to change brush head every 3 months for the best clean"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "If you have sensitive gums, buy this OEM Oral-B Toothbrush Head vs Chinese After-Market",
        "text": "My wife has sensitive gums.  These OEM Oral-B toothbrush heads are much softer but still do the job vs supposedly equivalent \"sensitive\" Chinese After-Market heads.  While the Chinese after-market toothbrush heads are much cheaper, they contributed to my wife's $2,000. gum surgery.  I swapped back to OEM Oral-B brush heads and all is now good for her.  Live and learn I guess or, better yet, you get what you pay for.  Buy these OEM Oral-B toothbrush heads with confidence.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Oral-B",
    "tags": [],
    "price": 36.1
  },
  {
    "id": "prod_toothbrushes_153",
    "parent_asin": "B09R9YGH2R",
    "category": "Toothbrushes",
    "title": "Replacement Toothbrush Heads Compatible with Philips Sonicare One Toothbrush, for HY1100 Miami Coral BH1022/01 Brush Head (Miami Coral)",
    "description": "",
    "rating": 4.4,
    "review_count": 823,
    "features": [
      "【Sanitary Packed】: Each replacement head equipped with dust cover then sealed into plastic bag and together packed in paper box. Three layers of protection avoid dust pollution during packing and transportation. Also, dust cover is perfect for travel, keeping your head free from germs & stains.",
      "【\"w\" Shape Bristle】: Shape of bristle is designed in \"W\" shape thus the head can fit to your teeth well. A great shape for efficiently brush and removing more plaque and stains.",
      "【Teeth Protection】: 95%-98% top of bristle rounded before packaging. Just considering protecting your teeth when brushing in high vibration. The teeth enamel would get worn if bristle was not rounded.",
      "【Easy to Install】: Easily snaps on for convenient replacement,Directly dial out and insert, and you can use it.",
      "【Specially Designed】:This head is specially designed for compatible with Philips one by sonicare toothbrush, model HY1100 HY1200 BH1022, Better matching and more thorough cleaning. It was made with the best quality material. High density, soft and end-rounded bristle with can perfectly protect the teeth."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "they’re good for being knock off",
        "text": "they’re definitely not as good as the real philips one heads, but they still get the job done",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Buy",
        "text": "Great price. Quality product.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Great fit",
        "text": "Good quality, great fit, and more fir my $$. It's an A+ in my book",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "So far so good.",
        "text": "Rated 4 stars because although they fit, you have to look close to get the brush on the unit right.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great value for the money",
        "text": "Don't like that the head is bigger, but that's no reason not to buy them.  Great value for the money.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Mullburry",
    "tags": [],
    "price": 9.86
  },
  {
    "id": "prod_toothbrushes_095",
    "parent_asin": "B01ERVW2SU",
    "category": "Toothbrushes",
    "title": "Oral-B Stages Power Kids Disney Frozen Battery Toothbrush with Timer App",
    "description": "Product Description\nThe Oral B Stages Power Battery toothbrush is designed especially for children. With fun, colourful designs and soft bristles, the toothbrush is a fun way for kids to learn. Assorted models dispatched.\nDirections\nDentists recommend replacing your toothbrush every 3 months, or when bristles are faded and worn, for a better clean Safety Warning Periodically check the cord for damage.\nDentists recommend replacing your toothbrush every 3 months, or when bristles are faded and worn, for a better clean Safety Warning Periodically check the cord for damage.\nIf the cord is damaged, take the charging unit to an Oral-B Braun Service Centre. A damaged or non-functioning unit must no longer be used. Not intended for use by children under age of 3 years.\nIf the cord is damaged, take the charging unit to an Oral-B Braun Service Centre. A damaged or non-functioning unit must no longer be used. Not intended for use by children under age of 3 years.\nThis appliance is not intended for use by children or persons with reduced physical, sensory or mental capabilities, unless they are supervised by a person responsible for their safety. In general. we recommend that you keep the appliance out of the reach of children.\nThis appliance is not intended for use by children or persons with reduced physical, sensory or mental capabilities, unless they are supervised by a person responsible for their safety. In general. we recommend that you keep the appliance out of the reach of children.\nChildren should be supervised to ensure they do not play with the appliance. If the product is dropped, the brush head should be replaced before the next use, even if no damage is visible.\nChildren should be supervised to ensure they do not play with the appliance. If the product is dropped, the brush head should be replaced before the next use, even if no damage is visible.\nDo not place or store the charger where it can fall or be pulled into a tub or sink.\nDo not place or store the charger where it can fall or be pulled into a tub or sink.\nDo not place the charger in water or other liquid. Do not reach for a charger that has fallen into water. Unplug immediately.\nDo not place the charger in water or other liquid. Do not reach for a charger that has fallen into water. Unplug immediately.\nDo not modify or repair the product.\nDo not modify or repair the product.\nDo not disassemble the product except when disposing of the battery. When taking out the battery for disposal, use caution not to short the positive (+) and negative (-) terminals. Do not insert any object into any opening of the appliance / charging unit.\nDo not disassemble the product except when disposing of the battery. When taking out the battery for disposal, use caution not to short the positive (+) and negative (-) terminals. Do not insert any object into any opening of the appliance / charging unit.\nUse this product only for its intended use as described. Do not use attachments which are not recommended by the manufacturer. If you are undergoing treatment for any oral care condition, consult your dental professional prior to use.\nUse this product only for its intended use as described. Do not use attachments which are not recommended by the manufacturer. If you are undergoing treatment for any oral care condition, consult your dental professional prior to use.",
    "rating": 4.5,
    "review_count": 4770,
    "features": [
      "Designed to help children brush teeth longer and better - appropriate for children aged 3 years +",
      "The rotating brush head has a raised center row to clean chewing surfaces where cavities tend to form",
      "Ergonomic handle designed for children’s small hands",
      "Power battery toothbrush",
      "Assorted models",
      "Oral-B Toothbrush"
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Edit: Good for my 2 year old",
        "text": "I realize it says it's a kids toothbrush but it's huge! It's bigger than a regular sized brush for adults. I intended this for my 2 year old for Christmas. It's my fault for not looking at details. I've been searching for an Olaf one and this was on sale. I have not tried it but will update when we do...<br /><br />Update: I gave this to my daughter early because she saw Olaf. It does fit in her mouth and the on/off buttons are easy for her to push. It's her favorite color, purple. She actually brushes her teeth. Well the toothbrush does the work! I don't see a timer on it. So far, the battery is doing fine. My biggest concern is replacing the head. It's already looking like I should replace.",
        "verified": true,
        "helpful_votes": 1
      }
    ],
    "store": "Oral-B",
    "tags": [],
    "price": 11.87
  },
  {
    "id": "prod_toothbrushes_165",
    "parent_asin": "B07KDY9Z5R",
    "category": "Toothbrushes",
    "title": "Oral-B Pro-Health Cross Action Advanced Toothbrush, Soft - 8 pack",
    "description": "Oral-B Pro-Health All-In-One toothbrush has been clinically proven to remove more plaque than a regular manual toothbrush with its CrissCross bristles, which are angled at 16 Degree to attack plaque from the right angle. Toothbrush improves oral health in 2 weeks by reducing gingivitis in a short term clinical trial Two Flexing Sides! One Superior Clean vs. a regular manual brush Gentle on gums. Individual flexing sides Oral-B Pro-Health Advanced Toothbrush has flexing sides that adjust to the unique curves and contours of your teeth, including gum line, for a superior clean vs. an ordinary manual brush Because of its flexibility, it is gentle on gums too. Material: Nylon Bristle Type: Soft Bristle Material: Nylon Package Quantity: 6",
    "rating": 4.5,
    "review_count": 480,
    "features": [
      "6 PACK - Soft Bristle Toothbrushes",
      "Pro-Health Advanced Manual Toothbrush",
      "Toothbrush improves oral health in 2 weeks by reducing gingivitis in a short term clinical trial",
      "Two Flexing Sides! One Superior Clean vs. a regular manual brush Gentle on gums.",
      "Individual flexing sides"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "Leave teeth very clean and bright",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 4.0,
        "title": "LP",
        "text": "good toothbrush for teeth",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "getting hard to find these",
        "text": "it's getting hard to find these brushes WITHOUT the stupid rubber parts on the sides, so when i find them, i buy a few packs.  these are better than the last ones i had - there's a rough texture on the back of the brush head (raised less than 1mm) that feels nice against the inside of my cheek while brushing - probably also good to clean your tongue.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Wonderful toothbrushes.",
        "text": "Works great and does not flex, very sturdy.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "I like the feel of this toothbrush- BUT....",
        "text": "Within maybe a week to 10 days, it already looks worn out and may not be cleaning as well. I may try a 2nd brush but if it's not any better, these are going back to the big box store that starts with a C that I bought them at.<br /><br />Not sure if the medium would be better or not. I may call Oral B and/or I may try another brand and/or return them.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Oral-B",
    "tags": [],
    "price": 15.99
  },
  {
    "id": "prod_toothbrushes_070",
    "parent_asin": "B0919C7V2M",
    "category": "Toothbrushes",
    "title": "Kids Toothbrush Replacement Heads for Oral-B, Extra-Soft Bristles, Fits for Oral-B Braun Electric and Battery Brushes, Except Vitality Sonic, CrossActino Power, Sonic Complete, Pulsonics, EB-10A",
    "description": "",
    "rating": 4.5,
    "review_count": 1575,
    "features": [
      "Premium Quality and Safe Guarantee - Our Electric Toothbrush heads have passed certification, and brush heads come with sealed container for hygienic storage, effectively protect your toothbrush head from outside pollution, it is a best gift for women, man, or yourself.",
      "Extra-Soft Bristles - The extra-soft bristles, so your child can get a thorough clean as they learn proper oral care habits. Ideal for ages 3+, the design is perfect for a smaller mouth, putting a powerful yet gentle clean in their growing hands.",
      "All Round Clean - Round brush head is inspired by dental professional tools for a tooth-by-tooth clean, with specially engineered bristles for optimal tooth coverage",
      "Kids replacement brush heads has special, smaller bristles which provide gentle, extra-soft brushing and make it ideal for the smaller teeth and mouth-size of children. Recommended for children from 3 years onwards.",
      "Features- 1. Cleans teeth and massages gently 2. Inter-dental tips : Penetrate hard-to-reach areas 3. Effectively removes plaque without irritating 4. Indicator bristles : Fade halfway to signal when to replace your brush head."
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "Check the size",
        "text": "Disappointed, I read it wrong and thought these were official oral b replacement heads. It’s smaller than the original one on my sons toothbrush and just doesn’t feel durable. I guess time will tell.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 3.0,
        "title": "Bristles are harder than advertised.",
        "text": "The description states that it has 'Extra-Soft Bristles' which is why I purchased it.<br />I've found this is not the case.<br />They are not the hardest bristles, but they're not as soft as advertised.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 1.0,
        "title": "Were they kidding?",
        "text": "Not soft at all.<br />Has a piece that sticks out of the middle.<br />Totally inappropriate for children!<br />To be used with an Oral-B toothbrush that is so harsh?<br />I contacted the seller before I bought but never got a reply.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Good value",
        "text": "Good deal compared to buying name brand but they do feel like cheap plastic and they’re not the softest. Worth it though to save some money if you want to change them out as often as you should. The oral b brand replacements are too expensive IMO.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Good",
        "text": "Son likes the different color. Fits his oral b toothbrush well. Perfect for little ones teeth. Thank you",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "ANBOO",
    "tags": [],
    "price": 18.99
  },
  {
    "id": "prod_toothbrushes_125",
    "parent_asin": "B08ZS9PY6D",
    "category": "Toothbrushes",
    "title": "SARMOCARE Toothbrush Case, Portable Toothbrush Holder with Cleaning Function, 99.9% Cleaning Effect, Fits All Types&Sizes Toothbrushes, for Home and Travel (B200-2)",
    "description": "",
    "rating": 4.4,
    "review_count": 785,
    "features": [
      "▲ HIGH CLEANING RATE - SARMOCARE professional uvtoothbrush holder can effectively able to eliminate up to 99.9% of invisible harmful substances from toothbrush, help us staying away from oral disease and having a better oral health. Fit for both electric toothbrushes and manual toothbrushes (Adults/Kids).",
      "▲ SUITABLE FOR ALL TOOTHBRUSHES - Suitable for all types of toothbrushes, including electric or manual toothbrushes for adult, kids. The perfect toothbrushes companion, but only one toothbrush slot for personal use, for the family version, please into our store and find B100 model.",
      "▲ ONE BUTTON OPERATION - One button to control the power and function, working time is 6 mins for one time, it will automatically stops when uncover the lid or work is done. Built-in rechargeable battery that lasts up to 30 days after full charged.",
      "▲ NO DRILLING INSTALLATION - Wipe the smooth wall surface with wet cloth and make it dry thoroughly, then stick the two hooks included package on the wall and wait 24 hours before you hang the toothbrush holder on the hooks. Easy to install without damaging the wall.",
      "▲ SATISFYING CUSTOMER SERVICE - Buy without any risk. No matter whatever the problem arises about the wall toothbrush holder you purchased from us, or you need any help, please feel free to contact-us, we will provide you a satisfactory solution or return your money back."
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "DOES NOTHING",
        "text": "Doeznt do anything .. zip! Nothing  better off putting toothbrush in the dishwasher.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Great!",
        "text": "I really like this item. It's not to big nor is it to small. I use it everyday after I brush my teeth to sanitize the toothbrush.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "It has improved my gum health ...",
        "text": "I really love this toothbrush sanitizer. I installed it inside my medicine cabinet.  I feel that my gum health has improved since I’ve been using it. I even took it with me when I traveled.  It comes with a cord for recharging and I haven’t found any problems with it at all. I’m very happy with this purchase.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Really nice toothbrush sanitizer",
        "text": "Really nice toothbrush sanitizer. Easy to use, seems to work good, i hope its killing the germs. No wya to tell, just put the brush inside and hit the button and hope",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Very good!",
        "text": "Very good product!  Works!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "SARMOCARE",
    "tags": [],
    "price": 19.99
  },
  {
    "id": "prod_toothbrushes_041",
    "parent_asin": "B0B57KSHFB",
    "category": "Toothbrushes",
    "title": "GuruNanda Mentadent Manual Toothbrush for Adults & Kids - Extra Cleaning with Soft Bristles for White Teeth Family Pack of 4",
    "description": "Mentadent 4-pack Whitening Toothbrush is perfect for all-around oral cleaning. This toothbrush has soft bristles for sensitive teeth and gum. Its spiral bristles help hard-to-reach areas to remove food, stains, and plaque while polishing and whitening your teeth in every clean. Our Ergo Dex handles are designed for a comfortable grip and control while using. It is recommended to change your toothbrush every 3 months or as needed for good oral hygiene.",
    "rating": 4.4,
    "review_count": 170,
    "features": [
      "MENTADENT SOFT TOOTHBRUSH FOR ALL-ROUND CLEANING: Our ultra soft, alternated bristles are ideal for those looking for all-around, deep cleaning and whitening of teeth without damaging the enamel for a brighter and healthier smile!",
      "ENJOY FRESHER BREATH: Our soft bristles aid in gently removing bacteria, food, debris, and fungi and result in better oral health and fresher breath.",
      "ALTERNATED BRISTLES: Unique design includes spiral and polishing cup bristles that better access hard-to-reach areas and help in deep cleaning, stain removal, and whitening the teeth.",
      "COMFORTABLE GRIP: Our Ergo Dexa handles are specially designed for a better and fuller grip that provides both comfort and control while brushing.",
      "PACKAGE INCLUDED: Comes with 4 toothbrushes in a variety of fun and classic colors, a family pack perfect for adults and kids. Our BPA and Latex Free toothbrushes are dentist recommended!"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Soft!",
        "text": "Perfect toothbrush to use after oil pulling!",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Best toothbrush evef",
        "text": "This is the best toothbrush I've ever had. Nice big head that cleans many surfaces at once. Very soft. So many newer toothbrushes have tiny heads, and I wasn't getting my teeth clean with them, including with an electric toothbrush. My teeth are much cleaner and whiter after less than a month using it. I see some plaque disappearing as well.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "This toothbrush is soft and firm",
        "text": "Please give it a try you won’t regret it. Especially is you have sensitive gums. ❤️ it.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "GuruNanda",
    "tags": [],
    "price": 5.99
  },
  {
    "id": "prod_toothbrushes_157",
    "parent_asin": "B08YRRFJD8",
    "category": "Toothbrushes",
    "title": "Kids Ultrasonic Electric Toothbrush, U Shaped Rechargeable Automatic Toothbrushes with Replacement Brush 6 Cleaning Mode Smart Timer 360° Sonic Dental Care for Ages 2-7 Child (Blue)",
    "description": "",
    "rating": 4.1,
    "review_count": 83,
    "features": [
      "U-shaped Brush Head: Ninety percent of children aged 2-7 years refuse to brush their teeth. Our upgraded version of the electric toothbrush is designed with a astronaut pattern & U shaped brush head to stimulate children's interest in brushing teeth and develop kids healthy brushing habits. The package comes with a replacement toothbrush, and the u-brush is gentle on the gums and enamel.",
      "6 Automatic Cleaning Modes: Kids electric toothbrushes with up to 5000-20000Hz sonic vibration per minute for comprehensive cleaning of teeth. Can choose from the strong mode for powerful teeth brushing, Comfortable mode, among others. All the different modes are timed to make brushing for kids easy.",
      "IPX7 Waterproof: Toddler electric toothbrush has IPX7 waterproof sealing design, the entire toothbrush can be rinsed with water, it also can be used in the shower. The toothbrush head is removable and replaceable. You can crop as needed.",
      "Rechargeable: Kids toothbrushes equipped with rechargeable battery, USB charging to support brushing for 7-10 days with just 2 hours charging; It is portable and rechargeable, fitting for home or travel use.",
      "45s Smart Timer Control: the 45-second timer control function can educate children to brush their teeth at the recommended time, which can complete tooth cleaning more scientifically. If you have any problems about toothbrush, please contact us by email."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Toddler loves this.",
        "text": "We use this to help brushing teeth during the daytime a breeze, as our 3 year old can do it himself. Then at night, do his teeth ourselves. It's come in very handy!",
        "verified": true,
        "helpful_votes": 1
      }
    ],
    "store": "KRX",
    "tags": [],
    "price": 29.99
  },
  {
    "id": "prod_toothbrushes_191",
    "parent_asin": "B0B25PXBGG",
    "category": "Toothbrushes",
    "title": "Brush Buddies Hot Wheels Toothbrush for Kids, Kids Toothbrushes, Toothbrush Pack, Soft Bristle Toothbrushes for Kids, Toddler Toothbrush Ages 2-4, 6PK",
    "description": "It’s never too early to introduce a healthy oral care routine— start with Brush Buddies Hot Wheels Toothbrushes! Each pack includes 6 soft bristle toothbrushes with a variety of colors and designs for a fun addition to your little one’s mornings and evenings. Each children’s toothbrush features a small, rounded brush head and textured ergonomic handle for easy grip. The bristles are gentle enough to effectively clean while protecting your child’s sensitive gums and enamel.",
    "rating": 4.6,
    "review_count": 4127,
    "features": [
      "[What's Included] The Brush Buddies Hot Wheels Manual Toothbrush Pack includes 6 multi-colored Hot Wheels kid's toothbrushes.",
      "[Ultra-Gentle] Each soft bristle toothbrush features a rounded brush head for effective, gentle cleaning while protecting your child's delicate gums and enamel.",
      "[Great for Toddlers] Brush Buddies Hot Wheels Toothbrushes are a great introduction to oral care for your toddlers and young children! The small head size and ergonomic handles are ideal for little ones as they learn to brush their teeth.",
      "[Make Brushing Fun] With bright colors and unique car designs, the children's toothbrushes are sure to make every morning a fun and exciting routine.",
      "[Rotate Regularly] Although dentists recommend a new toothbrush every 90 days, it's important to swap your child's toothbrush after they get sick, too!"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "No good",
        "text": "I ordered this for my son, and he loved it so much! He had fun brushing his teeth and did such a good job.<br />For like 2 weeks.<br />The battery is not waterproofed, so it is all getting wet every time you brush and rinse. So now it doesn't work. I thought it was just a dead battery, but nope. It all got wet and is ruined.<br />I'm super disappointed. You would think something like a toothbrush would be better sealed to prevent such a thing from happening. And of course, it died right after the return deadline.<br />Save yourself the money and drama of explaining to a toddler why he can't use his Blippi brush anymore.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "good value",
        "text": "for my grandson he loved them",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Works as needed.",
        "text": "You get what you pay for. These kids toothbrushes aren’t expensive and what you receive is good value for the money. Yes, some of the toothbrushes get loosened fibers over time, but we don’t keep them long enough to reach that point. The more aggressive of a brusher you are, the quicker you need to replace them. I find that they don’t last 3 months with good consistent brushing, as the quality declines with usage. Overall I’m happy with these for my son, just remember to switch them out within three months. The design is a great bonus for kids that enjoy HotWheels!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "good purchase",
        "text": "good purchase but if you have a toddler who likes to chew on the bristles then you’ll realize the bristles can come out.. so just watch out",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Good cheap toddler toothbrushes.",
        "text": "My toddler destroys and flattens bristles. These are cheap enough that It doesn’t break the bank when she needs a new one every few weeks. Bristles also don’t fall out. Will order again.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Brush Buddies",
    "tags": [],
    "price": 6.66
  },
  {
    "id": "prod_toothbrushes_085",
    "parent_asin": "B074N76ZY9",
    "category": "Toothbrushes",
    "title": "Neutripure Bambu Toothbrush: Charcoal Infused bristles with Bamboo Wood Handle",
    "description": "BAMBOO CHARCOAL BRISTLES - High Quality Bamboo Toothbrush in 100% Recycled Biodegradable Packaging. Compostable and biodegradable packaging and handle. Set of 2.",
    "rating": 4.2,
    "review_count": 101,
    "features": [
      "BAMBOO CHARCOAL INFUSED BRISTLES",
      "THICK AND UNIQUE BAMBOO HANDLE",
      "COMPOSTABLE -BIODEGRADABLE"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "nice toothbrush with soft bristles, comes in a two back and each is numbered",
        "verified": true,
        "helpful_votes": 3
      },
      {
        "rating": 5.0,
        "title": "Very durable toothbrush",
        "text": "Very durable toothbrush",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Will buy again.",
        "text": "Using for laundry - spot cleaning.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Three Stars",
        "text": "The handle is kinda weird to hold onto.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "the Artists' (Tooth) Brush",
        "text": "these tooth brushes are so pretty. the heads are dwarfed by the handles, but the heads are the perfect size for my mouth and the handles are the perfect size for my hands, so no complaints. been using one for the last two days, with charcoal toothpaste and tooth powder. the black bristles make it a bit harder to see when the brush is totally cleaned after brushing, but not so much that it's a problem.<br /><br />the bristles are great and leave my mouth feeling squeaky clean, but I wish the heads were replaceable because the carved handles are amazing. extremely comfortable, too. I'll definitely start a collection as the bristles die, then (after sawing off the heads) sand them down and use them for something decorative. they're far too pretty to toss in the garbage.<br /><br />ever since discovering bamboo fabrics a couple of years ago I've been on a bamboo kick for any and everything possible. it's long been one of my favorite plants (and the first thing I planted here at my home), and that it's sustainable/environmentally friendly has made it my go-to. hadn't even considered that there might be toothbrushes made of bamboo, but the minute I saw them I grabbed them. HIGHly recommended. bamboo is the wave of the future!",
        "verified": false,
        "helpful_votes": 2
      }
    ],
    "store": "Neutripure",
    "tags": [],
    "price": 4.5
  },
  {
    "id": "prod_toothbrushes_182",
    "parent_asin": "B09S41DRX4",
    "category": "Toothbrushes",
    "title": "Oral B OB-Shinycln-12pk 12 Pack - Shiny Clean Soft 35",
    "description": "Keep your mouth clean and fresh with the Oral-B shiny clean manual toothbrushes. Ergonomically shaped for better handling these tooth brushes help reach even the hardest areas of your mouth. The z-shaped patterned bristles help remove debris and germs from your teeth and mouth. Soft bristles are gentle on your teeth and gums and provide comfort and control when brushing. A built in tongue cleaner helps finish cleaning your whole mouth for a clean finish. When done use the provided toothbrush hygiene cap cover to keep it sanitized and ready to use next time. featuresblue, green, red and purple included Soft 35 bristles that are gentle on your teeth and gumsz-shaped bristles designed to reach in between teeth contoured ergonomic handle for easy us age built in tongue cleaner for total cleanlinesstootbrush hygiene cap cover",
    "rating": 4.0,
    "review_count": 26,
    "features": [
      "Soft 35 bristles that are gentle on your teeth and gums",
      "Z-shaped bristles designed to reach in between teeth",
      "Contoured ergonomic handle for easy usage",
      "Built in tongue cleaner for total cleanliness",
      "Toothbrush hygiene cap cover"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Toothbrush",
        "text": "These Oral B toothbrushes were more for travel.  Way to light for everyday use.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 2.0,
        "title": "Two Stars",
        "text": "Too small.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "feels more like the toothbrushes our dentist hands out than we can buy localy",
        "text": "the head is allot softer and feels allot better in the mouth than the oral-b toothbrushes walmart sells for $.97 each those feel like a horse toothbrush these feel more like the toothbrushes our dentist gives out.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Good but for how long",
        "text": "So I use these for trips and then throw them out.  For the cost it's great but never use them long term.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Oral-B",
    "tags": [],
    "price": 20.41
  }
]