[
  {
    "id": "prod_wireless_headphones_044",
    "parent_asin": "B0B37WTM91",
    "category": "Wireless Headphones",
    "title": "Skullcandy Jib True Wireless Earbud with Microphone / 22 Hour Battery Life / Use with iPhone and Android / Best for Gym, and Gaming / Bluetooth Earbud Headphones - Black/Orange",
    "description": "Experience total freedom on a budget with Jib True. The newest true wireless earbud from Skullcandy is easy to connect and easy to enjoy. Call, track change, and volume controls are all within close reach through one main button. 22 hours of audio on a single charge means you spend less time recharging and more time enjoying your music. Jib True earbuds are adventure-ready, too. An IPX4 rating means Jib True is sweat- and dust-resistant. You don’t need to worry about damage if a little rain kicks up during your urban or outdoor adventure. Dual microphones make your calls more clear and if you feel like keeping one ear open, you can use either bud ‘solo’ without missing a beat.",
    "rating": 4.3,
    "review_count": 5412,
    "features": [
      "Supreme Sound - Powered by 6mm drivers the Jib features dynamic audio with gnarly bass and a wide sound range. The earbuds also feature bluetooth 5.0 for a strong signal making sure you can listen to your music or take phone calls interruption free.",
      "22 Hours of Play - With a 55mAh battery in the earbud and 500 mAh in the charging case you'll get a whopping 22 hours of charge total, 6 in the earbuds and 16 in the case. Use the included charging case for on the go charging as well as safe storage for your earbuds.",
      "Dual Microphones - keeping you sounding extra clear while on calls or talking to your best friend Siri. Dual mics also means you can have 1 ear open and 1 earbud in while on calls to keep aware of your surroundings.",
      "Small, Medium, Large Ears - Included in the Jib is 3 different eargel tips to make sure you have comfy noise isolating fit. The earbuds are super lightweight and water/dust resistant perfect for the active person!",
      "Buy With Confidence - 1 year manufacturer's warranty included with the Jib, be sure to wear your earbuds with full confidence."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Tis Loud! Has great bass & long lasting battery!",
        "text": "Alot of headphones lack good bass and sometimes cuts out, but not this set, these earbuds have great bass without over doing it.<br /><br />Not a bad price to boot, and they're Skullcandy, nough said",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 4.0,
        "title": "Was expecting more from these",
        "text": "I love Skull Candy. But honestly I was expecting more and a better sound. They actually hurt my ears so they were a no go for me. Gave them to a niece.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "I love Skullcandy Products!",
        "text": "Must BUY NOW!!💪👍",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Good sound",
        "text": "They sound great. But they don't stay in the ear very well. I would buy this brand again. Maybe not this  Style",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Amazing for the price... Great range, sound good.",
        "text": "Battery latest me my whole work day.<br /><br />Sound is good enough, bluetooth range is impressive, better then my Samsung buds.<br /><br />Easy setup.<br /><br />So far, very happy. Some people say I sound like im in an empy room, but some times it doesnt happen?<br /><br />I dont know if its true noise canceling, but the buds are tight enough you dont get outside noise.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Skullcandy",
    "tags": [],
    "price": 28.79,
    "position": 1,
    "page": 1
  },
  {
    "id": "prod_wireless_headphones_122",
    "parent_asin": "B01HD152UG",
    "category": "Wireless Headphones",
    "title": "Hermitshell Case fits Logitech Wireless Headset H800 Headphone",
    "description": "Hermitshell Case fits Logitech Wireless Headset H800 Headphone",
    "rating": 3.7,
    "review_count": 48,
    "features": [
      "Hermitshell Hard Travel Storage Carrying Case Bag",
      "Protect your favorite device from bumps dents and scratches",
      "Made to fit Logitech Wireless Headset H800 Headphone",
      "Material:EVA ,Color: Black",
      "For sale is case only (device and accessories are sold separately)"
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "Three Stars",
        "text": "Too bulky to traven with.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Very good storage option for the H800 Headphone.",
        "text": "Very good storage option for the H800 Headphone.  Keeps the headset from becoming damages during transport.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great",
        "text": "Great fit",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Hermitshell",
    "tags": [
      "Sponsored"
    ],
    "price": 16.99,
    "position": 2,
    "page": 1
  },
  {
    "id": "prod_wireless_headphones_075",
    "parent_asin": "B099HXQ26M",
    "category": "Wireless Headphones",
    "title": "ULAK Compatible with Airpods Pro Case, Designed Protective Cover Soft TPU Transparent Shockproof Case Accessories with Keychain for Airpods Pro 1st Generation 2019 [Front Led Visible], PinkGlitter",
    "description": "",
    "rating": 4.2,
    "review_count": 5026,
    "features": [
      "Clear case is designed compatible with AirPods Pro (2019 Release), NOT fit the other Version; easy access to your AirPods Pro and the pairing button, with effortless insertion and removal of the protective case. The front LED indicator is visible while wire and wireless charging",
      "Crystal Clear & Lightweight - clear case is made of Eco-friendly anti-yellow high quality TPU, transparnet appearance shows off the original beauty of your elegant Airpod Pro",
      "Supreme Drop Protection- Made with Soft TPU, AirPods Pro Cases highly protect your AirPods case from bumps, drops, scratches and dust without adding additional bulk",
      "Carabiner/Keychain Attached - includes a portable high quality durable keyring,you can easily hang it on a backpack, keychain, belt of trousers, etc., in case of missing it and is being very convenient to use.",
      "The separate design of the top and bottom case ensures easy installation of the air Pods Pro case.Warm Notes - Includes 1 x Case compatiblw with AirPod Pro (2019) , 1 x Carabiner keyring (DOES NOT INCLUDE AIRPODS)"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Excelente",
        "text": "Excelente",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Good",
        "text": "The only reason I didn’t do all 5 starts is because it fits kinda weird. But fully protects. Doesn’t flip off. Was easy to put on",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Case",
        "text": "Not so good. Top comes off all the timeeee",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Overall happy",
        "text": "Overall happy with my purchase - I do wish the top was connected to the bottom that way it can’t fall off and get lost but for the price, it’ll do.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Okay Product",
        "text": "Okay Product",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "ULAK",
    "tags": [
      "Best Seller"
    ],
    "price": 9.49,
    "position": 3,
    "page": 1
  },
  {
    "id": "prod_wireless_headphones_117",
    "parent_asin": "B09GRW9KJW",
    "category": "Wireless Headphones",
    "title": "Konnek Stein Wireless Earbuds, Bluetooth Ear Buds in-Ear Headband Headphones, 6 Hrs Playtime V5.0 Wireless Headset Sport Earbuds w/Mic for Gym Running Compatible with iPhone Samsung Android, Black",
    "description": "Bluetooth Version 5.0 Wireless Range 8m Battery Type 110mAh with protect circuit Charge Voltage 5V DC microUSB Music Play Time Up to 6 hours Charging Time 2-3 hours speaker Φ13，32Ω，3mW SPL 103±3dB 0.1CM/1KHz micphone Omni-directional ，-39±3dB Total length of line 61.8cm±2cm weight 14.5g",
    "rating": 4.2,
    "review_count": 29,
    "features": [
      "Advanced Bluetooth V5.0 Connectivity: Wireless bluetooth earbuds, performs faster transmission speeds and more stable connections with iOS iphone and Android smart phones, tablets, laptops, MP3 players.",
      "High-Quality Music: This ear buds wireless bluetooth earbuds featuring upgraded acoustic components, it delivers balanced bass and clear treble for a rich, high-fidelity sound experience. You can have a better music experience with earphones.",
      "Sports Design Concept: Featherlight and fit perfectly in your ears without putting pressure on your neck. It can improve your wearing comfort when exercising. Perfect for gym, workout and running etc. You don't have to worry about losing these bluetooth headphones.",
      "6-Hour Playtime: Earbuds wireless bluetooth keep your music hassle-free by wirelessly linking your enabled device and streaming from up to 30 feet away. With up to 6 hours playtime of mind-blowing sound that’ll leave you with good vibes all day long.",
      "Built-in Microphone: This earbud & in-ear headphones is built in with high quality Microphone, and it is much convenient for you to answer calling for hands-free, no need to hold the phone in hand. You would feel its brilliants for your work and daily tasks."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Exact type of ear buds I need.",
        "text": "These ear buds are hard to find anymore.  I love the ability to pull one bud out and leave it dangle vs the newer ear buds that you have to pocket if you take out.  I wish they had gel pieces that enter your ears as I have small ears so they get a little sore after several hours of wearing.  But I will take it as I can get the ease of use I want from them.  Volume, sound and use of buttons are all fantastic.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Konnek Stein",
    "tags": [],
    "price": 10.5,
    "position": 4,
    "page": 1
  },
  {
    "id": "prod_wireless_headphones_146",
    "parent_asin": "B09ZXKQXLY",
    "category": "Wireless Headphones",
    "title": "Cute Case for Airpods Pro , 3D Silicone Dinosaur Shark Dog Animal Cartoon Protective Charging Cover Skin Keychain Design for Kids Teens Girls Boys (Cat Paw Case)",
    "description": "Specification:\nCute 3D Cartoon design, Make You Airpods Charging case looks pretty and fashionable.  Protect your Airpods charging case from damage scratches, shocks, accidental drops and collision.\nPackage Content:\n1-Pack Silicone Case for Airpods Pro\nWarranty:\nOne Year Warranty - We Value Your Satisfaction . Any questions you have,please don't hesitate to contact us. We will get you back within 24 hours.",
    "rating": 4.0,
    "review_count": 35,
    "features": [
      "Compatible with: Airpods Pro ( Charging case are not lncluded )",
      "Material:Made of high quality silicone which is safe and protective",
      "Protect your Airpods charging case from damage scratches, shocks, accidental drops and collision",
      "Cute 3D Cartoon design,Make You Airpods Charging case looks adorable and fashionable",
      "Easy access to the charging port,mini size,save space and convenient to carry"
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "cheap",
        "text": "absolutely ADORABLE, i love it, but i always have to dig through my bag to find the part that attaches to the lid of the airpod case. it falls off SO easy! i might just glue or tape it. otherwise, get it!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "JCSMARTEC",
    "tags": [
      "Sponsored"
    ],
    "price": 7.99,
    "position": 5,
    "page": 1
  },
  {
    "id": "prod_wireless_headphones_051",
    "parent_asin": "B087RMRLNK",
    "category": "Wireless Headphones",
    "title": "Audio Transmitter Receiver TV Computer Speaker Car Adapter 3.5mm Bluetooth 5.0 2-in-1 for Home Sound System/TV/PC/Tablet Headphone General (Black) (Large)",
    "description": "Switch mode:\n(1) RX: Receive mode, indicator: blue LED  (2) TX: Transmit mode, indicator light: red LED\nRX mode:\nPairing name: KN321, find KN321 in the Bluetooth settings of the phone to pair. The blue light flashes twice a second during the pairing process, and the blue light flashes once every three seconds after the pairing is successful.\nhow to use:\n(1) Plug one end of the audio cable into the audio input of the speaker and the other end into the audio of the KN321.  (2)confirm that it is in RX mode (blue light flash). Find the pairing name in the Bluetooth settings of the phone: KN321 click to pair.\nTX mode:\nTX mode will automatically search for other Bluetooth receiving devices (such as Bluetooth headset, Bluetooth speaker, Bluetooth receiver, etc.), The red light flashes twice a second during the pairing process, and the red light flashes once every three seconds after the pairing is successful.\nHow to use:\n(1)Plug one end of the audio cable into the audio output of the devices and the other end into the audio of the KN321.  (2)Confirm that it is in TX mode (red light flash). The KN321 will automatically search for Bluetooth headset or Bluetooth speaker pairing.",
    "rating": 3.7,
    "review_count": 359,
    "features": [
      "★[BLUETOOTH TRANSMITTER AND RECEIVER 2IN1] Receiver mode: wirelessly streams audio from your Bluetooth-enabled phone, tablet, or computer to your wired stereo, speakers, or headphones (Only support to be paired with one Bluetooth receiver). Transmitter mode: wirelessly streams audio from your non-Bluetooth TV, home stereo system, or CD player to your Bluetooth headphones or speakers. Switch between transmitter and receiver modes with the simple flick of a switch.",
      "★[NO DRIVER REQUIRED PLUG READY TO USE] No need to download driver, plug and play TV computer or Bluetooth speaker headset.",
      "★[PORTABLE AUDIO-STREAMING POWER] Bluetooth Adapter has got powerful wireless audio streaming capabilities. It features Bluetooth 5.0 chip to ensure high fidelity transmission of Bluetooth audio signal for music streaming to those speakers or home stereo systems that doesn’t have the capability.Slip it into your backpack or laptop bag and take it on-the-go without the slightest effort.",
      "★[WIDE APPLICATION] With the included 3.5mm cable and 3.5mm to 2RCA cable, this Receiver Transmitter adapter can widely be used on your computer, laptop, home stereo system, headphone, smartphone, Mp3 player, CD player, Cars with AUX-in and 3.5mm connector/ Computer Speakers/ Odinary Speakers/ Subwoofers/ Radios/ Multimedia Speakers/ Power Amplifiers/ Echo Walls, etc.",
      "★[QUALITY ASSURANCE AND SERVICE] Provides a 60-day return and 12-month replacement warranty, as well as lifetime accessible technical support. Please contact us if you have any questions. Reply to your message within 12 hours."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great quality device if you're on a budget",
        "text": "[[VIDEOID:e49e95641bb1dc426258e889516d11e0]] Over great product for the price. I can't complain. If you've got the money and would like to go for a more \"high end\" product there are plenty of options available. However, this one appeals greater to the general public. Most reviews say the same thing: It cuts out if too far away and it has a short battery life. Also if it is being used while charging you'll heard a little buzzing noise. You get what you pay for. It does its job and I can't complain  for the price.",
        "verified": true,
        "helpful_votes": 16
      },
      {
        "rating": 4.0,
        "title": "For A/V wireless solution, it is workable but not perfect.",
        "text": "First, my purpose is to stream audio to wired QC headphones from my AV receiver, as a replacement for my broken analog FM TV sound transmitter/phones.  For THIS purpose... I bought a pair of these BT devices, and it works, but the sync between audio and video is - versus analog - perceptible.  The streaming generation is less sensitive to this, but AV-philes find it annoying.<br /><br />It is a problem in all BT, compressed audio, technologies - to some degree. Compressed audio requires buffering, buffering introduces some minimum delay, and the delay can be worse depending upon the nature of the audio.<br />For many programs (sports, etc) sync isn't a problem, but in close-up talky-talky scenes the audio lag is annoying vs. the FM phones, which have imperceptible lag.  For NON-SYNCed applications - this is a non-issue.<br />I wish Roku had a AV sync setting (+/- ms).  This is what BT 5.0 does - it delays the video based on the estimated audio lag. *But that doesn't help here because these devices do NOT control the video stream*.<br /><br />Otherwise, audio quality of BT vs FM is equivalent. My FM phones were very good (AR, $150) and audio was excellent, so the BT pair has good sound in this application.  I have not noted any static others reported, except for a slight hum when the RX is not connected.  Generally, the BT audio is equivalent to any other BT audio connection (ie., streaming iPhone to car stereo, etc.).<br />8/18/2020 Revision:  After a power outage, I noticed a VERY bad hum.  Removed RX side's power, no change.  Removed TX sides power (from USB outlet on cable box), NO HUM.  I tried several other USB outlets, each had some hum though with different qualities.  Finally, I got out a good high amp USB hub & used it to power the TX side - no hum at all.  SO... the transmitting side is VERY sensitive to ripple in its USB power circuitry.<br /><br />One VERY annoying thing - my devices both power off after 4hrs (6hrs?)  regardless of input, even though both TX/RX devices are permanently wired to USB power. It ought to power down only if on battery or unconnected for some time (firmware update perhaps?).  Other than this obvious design choice, I have had no connection issues - power on TX, then RX, connects reliably in ~10s.  Once connected stays reliably connected UNTIL it powers down.<br /><br />So the good:  Cheap solution to use superior wired headphones.  Small & USB powered, so hides away easily on both TX and RX sides.  Cheaper & more versatile than quality FM TV transmitter/phone combos.<br /><br />And the bad:  Audio LAGS behind video noticeably, 50-150ms.  Also, I haven't tried with multiple BT sources - but there is no UI, no way to select a specific source - I suspect this would be a problem for some.<br /><br />Overall:  For the price, I can't complain and wouldn't spend 5x for good FM TV audio phones.",
        "verified": true,
        "helpful_votes": 10
      },
      {
        "rating": 5.0,
        "title": "Compatible With All Devices",
        "text": "Amazing product! I like the easy connectivity and sound quality is top of the line. I wish had known about this product before. It is compatible with all of my devices. Even my older television! Five stars all the way!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Nope. Didn't work with TV..",
        "text": "I bought this to try to move the sound FROM my Panasonic, non-bluetooth television TO my bluetooth headphones or a bluetooth speaker. Tried both, neither worked - was a complete waste of time. Now, who's going to refund me for the printer ink to print a label to return it?",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Works like a charm",
        "text": "Fantastic. Works right out of the box. I set it up with an aux to an older stereo and it connected right away. I'm probably going to buy another one for the office.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "JRSHOME",
    "tags": [
      "Sponsored"
    ],
    "price": 13.99,
    "position": 6,
    "page": 1
  },
  {
    "id": "prod_wireless_headphones_175",
    "parent_asin": "B07QLPDP4S",
    "category": "Wireless Headphones",
    "title": "6 Packs(12 Pieces) in-Ear Monitor Replacement Memory Foam Tips 3mm Earplugs Earbud Cover for Balanced Armatured Headphone T-100(Medium, Yellow)",
    "description": "Inner diameter: 3mm Outer diameter:12.5mmSize: Medium QTY: 6 pairs\nNO EAR FATIGUE.\nThese foam earphone tips are softer than silicone tip material, Great elasticity and recovery make the tips perfectly fit your ear canal, very comfortable.\nBETTER COMFORT\nSlow-rebound material, uniquely breath-activated earmuffs activated by body temperature, gives you a new experience without irritation or fatigue.\nPREMIUM SOUND.\nSoft foam earbud tips provide a perfect seal in the ear canal and pure audio with enhanced bass while eliminate the outside noise.\nMORE ISOLATION\nWith the ear canal properly sealed by the earbud tips, you don't need to increase volume to enjoy music in a noisy environment.\nLITTLE USING TIPS\nBefore wearing earbuds, squeeze the sponge tips with your hands, so they will automatically inflate and perfectly fit your ear canal after wearing. That will create better sound insulation. The memory foam is about 11mm high, the largest diameter is about 12mm, and the inner diameter of the catheter is about 3mm.Made of high-quality, environmentally friendly and non-toxic materials, it has the advantages of softer, slower rebound and more durable. Memory foam is characterized by a slow rebound effect, which can change its own shape with external pressure. From the perspective of earplugs, the ear canal varies from person to person, and the memory foam will change their shape according to the individual's ear canal, making them fit the ear canal best, thus achieving more than ordinary eartips cover good wearing comfort, better noise reduction effect, bring better listening experience. Applicable to the following earplugs: SE series:  SE110/SE112/SE115/SE210/SE215/SE310/SE315/SE420/SE425/SE530/SE535/SE846 E3C/E4C/E5C/E3G/E4G/E500/i3C/i4C/ SC series: SCL3/SCL4/SCL5/",
    "rating": 3.7,
    "review_count": 113,
    "features": [
      "6 Pairs of replacement tips fit on 3mm cavity tube diameter for balanced armatured in-ear monitor.Please measure the outer diameter of your earplug cavity tube before purchasing, and refer to the picture to obtain the appropriate model.",
      "The only earbud tips that adopt separate packaging; each pair is individually packed in its own little baggie; convenient for storage.",
      "Not like other cheap earphone tips, these are high quality memory foam ear bud tips which would not fall apart or disintegrate.",
      "Soft foam earbud tips provide a perfect seal in the ear canal and pure audio with enhanced bass while eliminate the outside noise.",
      "Before wearing, you may need to squeeze the ear tips and put them in your ear and they expand to fit. These are pretty stretchy and stay in place."
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Not a quality product",
        "text": "I needed these to fit my Sony earbuds which are always smaller than normal earbuds. I've used Comply in the past and loved them but they're expensive. Should have bought them anyway. These are small plastic tubes inserted into blue memory foam. The tubes don't stretch to wrap around the tip of the earbud the way quality products do and the tubes are apparently not glued to the memory foam as they separate when you're trying to install them.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Hold really well",
        "text": "Really like these foam tips. They hold extremely well in my ears whether I'm hitting hitting the punching bag, jogging or cutting grass.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "The quanity you get for the price + the quality is excellent",
        "text": "I like the comfort, quality, and price of these replacement earbuds.  The foam holds up well to use, they never fall off, and they do block out sound around you but not so much you can't hear that someone spoke to you.  The price and quantity is the best on Amazon",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "Not so great",
        "text": "I bought these as an inexpensive replacement for my ear buds. They took quite a bit of twisting and pushing to get into my ear without feeling like they would fall out. With that, after just a couple days, the outer section broke away from the inner so they no longer fit on the ear bud. I do not recommend purchasing.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Perfect replacement size",
        "text": "Very comfortable, noise isolating, fits my older Phillips SHR 9850 earbuds like new. Like the color because you can tell when they are dirty & need to be replaced.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Simoutal",
    "tags": [],
    "price": 14.88,
    "position": 7,
    "page": 1
  },
  {
    "id": "prod_wireless_headphones_100",
    "parent_asin": "B07D824XHY",
    "category": "Wireless Headphones",
    "title": "Geekria Headband Cover Compatible with Sony MDR1A, MDR-1ADAC, MDR-1ABT, MDR-1AM2, MDR1R, MDR1RNC, MDR1RBT Headphones/Headband Protector/Easy DIY Installation No Tool Needed",
    "description": "",
    "rating": 4.2,
    "review_count": 495,
    "features": [
      "No tool needed. Fits over the original headband and zip up in place. Don't need to remove the original headband.",
      "Can be used to cover your wear out headband or protect it from scratch.",
      "This product is compatible with Sony MDR1A, MDR-1ADAC, MDR1ADAC/S, MDR1ADAC/B, MDR-1ABT, MDR-1AM2, MDR-1AM2-B, MDR-1AM2-S, MDR1RNC, MDR1R, MDR1RBT, MDR-1RMK2, MDR-1RNCMK2 and other same size headbands",
      "Product Dimensions: 9.6 x 2.9 inches (24.5 x 7.5 cm)",
      "Package Contents: Headphone headband x 1"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Not quite a perfect fit, but works well",
        "text": "Purchased for a 6-yr-old Sony MDR-ZX750BN. A tight fit to get the zipper closed, yet there is a bit of extra on the side that connects with my head. The cover is about a centimeter short of full coverage. That said, it is comfortable; and that is what is important. This should last at least another 6 years, making the little bit I paid well worth it.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Fits perfectly on ATH-M50. Nice stretchy neoprene means they fit a lot more headphones than what's listed.",
        "text": "My Audio-Technica ATH-M50 is still by far my favorite wired headphone, but I haven't been using them because of the cheap black vinyl on the M50 headband that is famous for peeling off and leaving flakes all over your head. This band fit perfectly. See attached pics.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Perfect for me",
        "text": "I have an expensive pair of V-Moda headphones that I couldn't bear replacing even if the headband piece was coming apart. This worked perfectly for my needs! No more headband peeling or foam in my hair!",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "This headband cover was just what I needed!",
        "text": "The Geekria headband cover was purchased to replace the Sony piece that was deteriorating after a couple of years of usage.  This replacement headband cover is very comfortable. It was a little bit of a challenge to install (it goes directly over the old headband) but once on, it works great. I would buy it again.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "GEEKRIA",
    "tags": [],
    "price": 10.99,
    "position": 8,
    "page": 1
  },
  {
    "id": "prod_wireless_headphones_025",
    "parent_asin": "B00B7UOILY",
    "category": "Wireless Headphones",
    "title": "iFrogz Animatones Volume Limiting Headphones for Kids - Green",
    "description": "The Animatones headphones feature playful child friendly styling and volume limiting speakers. Kids will love the fun look, sturdy, and lightweight construction. Parents can feel safe knowing the built-in volume governor will not play media over 85 decibels. Connects with a 3.5mm jack.",
    "rating": 3.4,
    "review_count": 272,
    "features": [
      "Lightweight and comfortable",
      "Volume limiter to protect young ears",
      "Driver Unit: 30 mm neodymium / Impedance: 16 ohms",
      "Sensitivity: 85 dB +/- 3 dB at 1 kHz / Frequency Response: 20 Hz to 20 kHz",
      "Cord Length: 1.2 m"
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "cute but not functional for small ears",
        "text": "Really cute but still too big for my 6 year old son :(",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "I originally bought these for my son but I love them myself",
        "text": "I originally bought these for my son but I love them myself. I may get another pair for me. I've always had trouble with earbuds and now I know it was because they were too big for me ears. These fit comfortably. They also fit my son. So great for that too.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "Perfect size for my 4 year old",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "Kid sound monitoring safety headphones love them",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Great for those headphones that are on the school supply list!",
        "text": "The only complaints we have with these are that the headband feels kind of flimsy and doesn't seem to adjust and also the ear foam finds its way off after awhile. However, with that being said, I would also like to note that the size is perfect (for my 5 year old daughter), the sound is pretty dang good for kids headphones and the design is cute.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "iFrogz",
    "tags": [],
    "price": 14.99,
    "position": 9,
    "page": 1
  },
  {
    "id": "prod_wireless_headphones_179",
    "parent_asin": "B01N322FR3",
    "category": "Wireless Headphones",
    "title": "Mi in-Ear Headphones Basic (Silver)",
    "description": "Mi In-Ear Headphones Basic (Silver)",
    "rating": 4.3,
    "review_count": 4575,
    "features": [
      "Mi In-Ear Headphones Basic (Silver)"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Excelente sonido",
        "text": "Excelente",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Xiaomi",
    "tags": [],
    "price": 14.99,
    "position": 10,
    "page": 1
  },
  {
    "id": "prod_wireless_headphones_040",
    "parent_asin": "B0838YFW8Z",
    "category": "Wireless Headphones",
    "title": "Newseego Compatible with AirPods 1 & 2 Case, Keychain+Anti-Lost Strap+Ear Hooks+Watch Band Holder,Protective Bling Crystal Glitter Luxury Shining Diamond Rhinestone Gift Scratch/Drop Proof-Blue",
    "description": "",
    "rating": 4.4,
    "review_count": 1346,
    "features": [
      "【Compatibility】 ：Airpods case compatible with for AirPods 1 & 2 generation; fully supports wireless charging without interference",
      "【What You Get】: 1x Airpods 1&2 case 1x AirPods Keychain 1x Magnet Anti-lost Strap 1x Ear Hooks 1x Watch Band Hold",
      "【Luxury Design】: The shiny diamonds are firmly embeded in the surface of the case and makes your Airpods 1 & 2 case unique and stylish. luxury rhinestone,elegant,sparkle under sunshine,perfect decorative case to match your dress,watch bands or bags.Make your bling bling everywhere!",
      "【Full Protection】: Not easily deformed hard shape designed, No need to work hard to install, Easy put-in and take-out, Full Protection Anti-Scratch, Anti-Slip: Flexible, shock-resistant elastomers provide the perfect balance and protection from scratches and impacts.",
      "【Best Gift】: Great look rhinestone case, unique design, With a glowing and eye-catching lookmake your airpods different. Perfect as a chrismas,valentine’s day,mother’s day,birthday,thanks giving day gift for women, girls, kids, teens."
    ],
    "reviews": [
      {
        "rating": 2.0,
        "title": "Read before purchase",
        "text": "Can’t get it off the iPod case. Even with product support I feel like $$ AirPod lid will snap off because of this case. Also no hole in back to allow access to AirPod button. Even more reason not to buy and put on iPods. If I ever get it off ill update the outcome. For now, I’ll try to deal with it.",
        "verified": true,
        "helpful_votes": 10
      },
      {
        "rating": 5.0,
        "title": "Sparkly",
        "text": "Love my sparkly ear bud holder!!! It’s really nice crystal, brilliant.",
        "verified": true,
        "helpful_votes": 7
      },
      {
        "rating": 5.0,
        "title": "So sparkly!",
        "text": "My daughter and I both love blue sparkles and this fit perfectly on her AirPods 2 case.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "I love it!",
        "text": "The color is true to the photo! I really love mine.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "So pretty",
        "text": "Gave as a gift. Was loved!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Newseego",
    "tags": [],
    "price": 13.88,
    "position": 11,
    "page": 2
  },
  {
    "id": "prod_wireless_headphones_114",
    "parent_asin": "B072V1M85N",
    "category": "Wireless Headphones",
    "title": "elago Silicone Case with Keychain Compatible with Apple AirPods Case 1 & 2, Front LED Visible, Supports Wireless Charging, Protective Silicone [Dark Grey]",
    "description": "",
    "rating": 4.6,
    "review_count": 12481,
    "features": [
      "AT ELAGO ALL CASES ARE DESIGNED JUST FOR YOU with a simple and functional design in mind. These cases support BOTH WIRED AND WIRELESS charging for AirPods 2 & 1. We want to make your life SIMPLE AND HASSLE FREE so we added a CARABINER TO KEEP IT HANGING CLOSE!",
      "THE PROBLEM WITH MOST CASES ARE that they don’t fit correctly and don’t protect from drops well. ELAGO CASES ARE MADE WITH premium silicone and a special coating applied inside the cap to PREVENT IT FROM FALLING OFF to give you the BEST DROP PROTECTION!",
      "THE CASE ALWAYS STAYS on with the hinge design - NEVER HAVE TO WORRY about losing the cap or it falling off. Since the case was MADE SPECIFICALLY FOR AIRPODS, FULL ACCESS TO ALL FEATURES and functions are a given!",
      "PERFECT GIFT FOR any AirPods user! Great for BIRTHDAY PRESENTS for loved ones and gifts during the holiday season – ESPECIALLY CHRISTMAS FOR STOCKING STUFFERS!",
      "elago is a DESIGN COMPANY FIRST AND FOREMOST. Our motto is SIMPLE SOPHISTICATION because we create products that are USEFUL AND AWESOME! WE ALWAYS CREATE products that WE OURSELVES USE, so we know YOU WILL LOVE IT!"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "Its good quality, perfect fir",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Very Impressed",
        "text": "After having this case for over a month, it has held up great. I really like the silcone. It has made it so much easier to keep up with the case. The keyring isn't the best carabiner I have used but it is satisfactory.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "as pictured",
        "text": "Fits snugly just like in the photo. I like that it makes them more visible so it's harder to lose and has that spot for a loop. It's nothing crazy but for $5or6 it was a good buy.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Excellent",
        "text": "This is a stylish case and I'm very happy with the quality and style.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Don’t use the clip!",
        "text": "I’ve almost lost my airpods several times because the clip isn’t very sturdy, if you’re buying just for the case, I suggest this but don’t count on clipping it to something and having it stay! You will loose your airpods. Cute and durable case though. Worth the money for the case.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "elago",
    "tags": [],
    "price": 9.99,
    "position": 12,
    "page": 2
  },
  {
    "id": "prod_wireless_headphones_168",
    "parent_asin": "B09NR2DCJR",
    "category": "Wireless Headphones",
    "title": "Aiiko 3D Butterfly Airpod Case with Keychain Clear Glitter Airpod Gen 2 Case for Women Girl Soft TPU Shockproof Protective Compatible Apple AirPods 1st 2nd Generation Charging Case",
    "description": "",
    "rating": 4.3,
    "review_count": 77,
    "features": [
      "【Compatibility】：This bling air pod case is designed for apple airpod case 2nd generation and airpod case 1st generation. The case for airpods is 2 pieces design that allows your apple AirPods charger case a flexible opening.",
      "【Aurora 3D Butterfly Design】: The attractive transparent butterfly on the front surface of the airpod cover will refract the color like the aurora under the light, making your earpods case more eye-catching. The matching silver butterfly keychain complements the airpod case girly. Choose this aesthetic air podswireless case as a gift for women, girls, friends, daughter, and wife, they will love it very much.",
      "【Convenient Charging】: Our airpod case for women supports wireless and wired charging. Easy to use, no need to remove the kawaii airpod case while your airpod case cover is charging.The flat design at the bottom of the case allows you to place your headphones at multiple angles. Front LED visible.",
      "【Pratical & Stylish】: This airpod case butterfly is made of soft skin-friendly clear TPU material which can protect your airpod case from damage when dropped and not scratched by other items, at the same time the inside of the case won't scratch your airpods too when you install and remove the cover. Protect inside and out to keep your charging case looking new after long-term use. We added bling sparkle to the transparent material to make the airpod carrying case sparkly.",
      "【What You Get】: 1x case for airpods gen 2&1 , 1 x Cute Butterfly Keychain (AirPods & AirPods Charger Case NOT included.). If you have any problems with your order, please contact AIIKO on your Amazon order page, then click \"Contact Seller\" we will solve your problem promptly."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "It’s cute",
        "text": "The only down side to this is the lid is t connected and the case pops off at times",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Aiiko",
    "tags": [],
    "price": 9.99,
    "position": 13,
    "page": 2
  },
  {
    "id": "prod_wireless_headphones_058",
    "parent_asin": "B07V5X6ND9",
    "category": "Wireless Headphones",
    "title": "Dekoni Audio Mercury Bulletz Moldable Memory Foam Isolation Earphone Tips, Black, 4.9mm (Single Pair - Large)",
    "description": "",
    "rating": 4.0,
    "review_count": 19,
    "features": [
      "Enjoy your earbuds even more with comfortable, noise isolating eartips from Dekoni Audio.",
      "Always the best fit with memory foam technology that conforms to the shape of your ear for a comfortable, solid seal",
      "Cleans easily with only soap and warm water",
      "Available in three different sizes including 9mm, 11mm, and 13mm as well as a sample pack that includes one pair of each size"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Comfort and Ease of Use",
        "text": "These may be the perfect tips for IEMs. I like these way more than the silicone tips. They are easy to put in and don't bother my ears. I haven't had them long so I can't speak to their durability yet. I'll come back to this review later if I have any issues.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Big improvement over OEM.",
        "text": "I purchased these memory foam tips to use in place of the OEM tips on my KS Z10 Pro IEMs. The seal is drastically better as these cut out almost all external sound and let you focus purely on your music. Excellent purchase.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "I still can't get them out if my ear",
        "text": "Stuck..... stuck......STUCK",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Great",
        "text": "Sound take a hit as earbuds itself is very thick and gives the souns a warm signature",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Perfect fit",
        "text": "Dekoni makes a great product.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Dekoni Audio",
    "tags": [],
    "price": 8.99,
    "position": 14,
    "page": 2
  },
  {
    "id": "prod_wireless_headphones_151",
    "parent_asin": "B0BZHYH5TM",
    "category": "Wireless Headphones",
    "title": "Rechargeable CD Player Portable,Compact Anti-Skip Shockproof Portable CD Player with Earphone,Walkman CD Player with Stereo Speakers&LCD Display for Car/Home/Travel (AUX Output)",
    "description": "",
    "rating": 4.2,
    "review_count": 388,
    "features": [
      "❤【CAR CD PLAYER WITH STEREO SPEAKERS】This portable CD player built-in HIFI stereo speakers, can play without earphone,help reduce ear fatigue. This small CD player can set A-B repeat which can play an audio clip over and over again.This function is great for you when learning a new language or knowledge,it is the best choice for music enthusiasts, language learners and expectant mothers.",
      "📀【Bluetooth Transmitter with HIFI Speaker】 With built-in HIFI Bluetooth speaker, Ultra-long Range Bluetooth connectivity area. Built-in Bluetooth Transmitter, you can connect with your Bluetooth devices, such as car, Bluetooth speaker or headphone via Bluetooth.You can enjoy high-quality wireless audio via Bluetooth.",
      "🎼【RECHARGEABLE PORTABLE CD PLAYER】This portable compact disc player built-in 1200mAh battery,no need to use batteries or always plug the charging cable into the cd player when playing music.You can charge the cd player with the included USB cable.It is small and light to carry anywhere.Useful in home,travel,car,office.",
      "❤️【ANTI-SKIP/SHOCK PROTECTION】This small portable Walkman CD player is designed with Anti-skip/shock Protection, no more worry about skip issue even while exercising or driving on bumpy roads. Which provides a stable audio experience during sports, fitness, travel, walking and driving and enjoy your favorite music anytime and anywhere.",
      "🎼【WIDE COMPATIBILITY CD PLAYER】This portable CD player supports most CD formats, such as CD formats including CD, CD-R, CD-RW, MP3 and MWA. 5 Play Modes: Play in order, Repeat a track, programming play, A-B Repeat, Play in random order.It also can connect to the car and speaker by AUX cable. (NOTE: only works with a 3.5mm AUX port).",
      "🎁【PERFECT GIFT】This CD player portable with headphone is simple to use,easy to be carried.It is the perfect mothers day gifts for friends, family and children. It can be used as any type of gift of fathers day or mothers day,such as fathers day gifts from daughter, gift for father, gifts for women,best gifts for kids,birthday gifts for old people,We provide Free returns for 30 days, 1 Year Warranty(6 months extended warranty service).if have any problem, please don't hesitate to contact us."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Just What I Wanted",
        "text": "I wanted to replace my old clunker of a boom box.  I needed a small CD player with_ a speaker so I wouldn't have to wear ear buds.  That's what I found here. At first, I wondered about the sound, but considering how small it is, the sound is fine.  I'm glad to have easier access to my CD collection.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Great Bluetooth CD player",
        "text": "I have a few CDs that I have kept despite mostly using streaming services.  Music not available online.  This device allows me to hear them again.<br />Connected very easy to my Bluetooth tailgate speaker.<br /><br />Don't plan on using the built in speaker as I have several better speakers that I can connect to with cable or Bluetooth.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 3.0,
        "title": "Sound Quality not the best on its own speakers",
        "text": "I found using the Aux cable along with my Bluetooth headphones the sound quality is much better.<br />The headphones that came with unit wasn't that good.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Very Good Portable CD Player With Plenty of Options",
        "text": "With the onset of Pandora, satellite radio and many other such options, I found I wasn’t playing my CDs anymore.  In fact, I couldn’t find my CD player!  And the high-end system in my truck doesn’t even have a CD option.  So when I saw this I figured I give it a try.  I like that it’s portable and plays without skipping even when bumped, running with it, or the dog knocking it off of the table.  It can be used with my several different sets of earphones.  It also plugs into my truck stereo without a problem.<br /><br />I also wanted it to play through its own speaker while in my crafts room.  This is where the 5th star gets removed.  When turning it up nearly all the way the speaker starts to buzz on certain notes.  It isn’t loud at all on its own either so using it without auxiliary speakers is not good if more than about 8 feet from it.  However, I am playing my CDs which I have not heard in years, and that makes me very happy.",
        "verified": false,
        "helpful_votes": 4
      },
      {
        "rating": 5.0,
        "title": "Fun and good",
        "text": "My 13 yo son is on the vintage wave, so he has been using this and the cassette one. He is happy!<br />Very portable, small size.<br />The sound is ok.<br />Has been using it non stop and still working good.<br />Would be a fun gift for someone who likes old school (on a fun way, not like a collector)<br />We like it.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "ZUNKOM",
    "tags": [],
    "price": 52.89,
    "position": 15,
    "page": 2
  },
  {
    "id": "prod_wireless_headphones_188",
    "parent_asin": "B08L92YJST",
    "category": "Wireless Headphones",
    "title": "Headphone Radio,Portable FM Radio Headphones with LCD Display Noise Reduction Ear Muffs,FM Receiver Headphones,Wireless Headset with Radio for Walking,Jogging,Daily Works",
    "description": "Description:Clear listening: the DSP software digital processing integrated module is used as the radio core, with high amplifier, local oscillator, mixing and frequency discrimination circuits, digital filtering design, built-in dual 16bit digital-to-analog converters, high-performance selective, Strong anti-interference ability and low audio distortion output characteristics.Ergonomic design: oval-shaped earmuffs are comfortable to wear and can fully cove the ears to effectively isolate external noise. Detachable earmuff design, the earmuff material is made of PU leather material, which is easy to replace.Special campus channel: With memory function, it can memorize the frequency points and saved frequency points before shutting down (or changing the battery).LCD display: LCD liquid crystal display is clearer and more intuitive than pointer display, which is convenient to quickly adjust to the required channel.Reception FM radio: supports FM (No AM) transistor radio with an automatic search and store feature which can make up to 11 preset stations for you to cycle through your favorites.Specification:Model: HRD-308SMaterial: ABS+PU leather Color: white, black, blue, orangeFM receiving range: 50-108MHZSensitivity: ≤18dBFrequency Response: 20Hz-18KHzWorking voltage: 3V Battery: 2*AA batteries(not included)Size: 115mm x 88mm x 120mm/4.53\" x 3.46\" x 4.72\" (Approx.)Package:1 pc x Headphone1 pc x User manualNote:1. Due to the light and screen difference, the item's color may be slightly different from the pictures.2. Please allow 1-2 cm differences due to manual measurement.",
    "rating": 3.8,
    "review_count": 63,
    "features": [
      "External antenna design: it enhances the receiving sensitivity of the product and increases the sensitivity of about 2-3DB compared with wireless earphones; reduces the noise-limiting sensitivity of earphones, so that the earphone receiving sound quality is clearer, and students can listen to the exams clearly.",
      "Clear listening: the DSP software digital processing integrated module is used as the radio core, with high amplifier, local oscillator, mixing and frequency discrimination circuits, digital filtering design, built-in dual 16bit digital-to-analog converters, high-performance selective, Strong anti-interference ability and low audio distortion output characteristics.",
      "Ergonomic design: oval-shaped earmuffs are comfortable to wear and can fully cove the ears to effectively isolate external noise. Detachable earmuff design, the earmuff material is made of PU leather material, which is easy to replace.",
      "Speaker and LCD display: adopts 40MM large-diameter drive unit, high-magnetic neodymium iron boron magnetic material structure, professional anti-noise, beautiful and clear sound quality, high sensitivity, and the stereophonic design of the product line shows an excellent bass effect.LCD liquid crystal display is clearer and more intuitive than pointer display, which is convenient to quickly adjust to the required channel.",
      "Reception FM radio: supports FM (No AM) transistor radio with an automatic search and store feature which can make up to 11 preset stations for you to cycle through your favorites. With memory function, it can memorize the frequency points and saved frequency points before shutting down (or changing the battery)."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great",
        "text": "Product great",
        "verified": true,
        "helpful_votes": 1
      }
    ],
    "store": "CALIDAKA",
    "tags": [],
    "price": 13.29,
    "position": 16,
    "page": 2
  },
  {
    "id": "prod_wireless_headphones_154",
    "parent_asin": "B08RD7N9RL",
    "category": "Wireless Headphones",
    "title": "Seltureone Silicone Case Cover for AirPods Max, Anti-Scratch No Yellowing Accessories for AirPods Max, Precise Fit, Scratch-Resistant, Lightweight and Stylish (Green)",
    "description": "",
    "rating": 4.3,
    "review_count": 274,
    "features": [
      "【Tightly Fit】Precise cutting AirPods Max covers, perfectly match with AirPods Max, does not affect the headphone functions, convenient to use and charge",
      "【Excellent Scratch-resistant Protection】AirPods Max cover surface treated with special process, Anti-Scratch, Anti-slip and Anti-dirt, easy to clean and maintain",
      "【Lightweight Silicone Material】These AirPods Max covers are made of high-quality silicone material, soft and comfortable, fit the AirPods Max curves, provide good touch and protection. Adding virtually no discernible weight",
      "【Easy To Use】Easy to install and remove AirPods Max cover, no need for any tools or skills. Light weight, does not increase volume, easy to carry and store",
      "【Fashionable】Multiple colors available AirPods Max covers, make your headphones more fashionable and personalized"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Fit perfect",
        "text": "Face some reason I was expecting these to be a different material than they were but I’m actually glad with the material that they are and how they fit perfectly on my AirPods.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Yellow",
        "text": "They turned yellow almost immediately",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "Yellowing?",
        "text": "I’ve had these for less than a month and really love them. Easy to put on and stay put. Today I noticed that one of covers is starting to yellow. I don’t typically keep my headphones anywhere except on my head or in the case, so i have not gotten them dirty to cause this. Anyone else?",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Must Buy",
        "text": "Excellent product. Highly recommend to protect a very expensive headphones. Quick delivery.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Would freely recommend",
        "text": "Item works as described. It’s very slim, barely adds to the bulk of the AirPods Max. I would recommend this product to anyone looking for a bespoke way to protect their investment.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Seltureone",
    "tags": [],
    "price": 8.99,
    "position": 17,
    "page": 2
  },
  {
    "id": "prod_wireless_headphones_153",
    "parent_asin": "B08XZDWSK4",
    "category": "Wireless Headphones",
    "title": "Oqplog for Airpod Pro 2019/Pro 2 Gen 2022 Case - Taki Biscuit, Food Cute 3D Cartoon Funny Kawaii for Airpods Pro Soft Silicone Cover Fashion Cool Fun Air Pods Pro Cases for Girls Women Boys Girly Teen",
    "description": "",
    "rating": 4.5,
    "review_count": 582,
    "features": [
      "【Creatively Designed Appearance】 Designed specifically for the first and second generations of AirPods Pro 2019/Pro 2nd generation Case 2022, it looks very unique and fashionable. The funny and fancy cartoon shape makes AirPods Pro unique, like a beautiful pretty decoration.",
      "【High-quality Silicone】 High-quality silicone material, good elasticity, not afraid of pulling, squeezing does not deform, and the soft material will not cause scratches on the surface of the charging box.",
      "【Protect the AirPods Pro Charging Case】 The AirPods Pro 2019/Pro 2nd generation Case 2022 charging case is smooth and small in appearance, easy to slip from the hand, this protective cover can protect the AirPods Pro from accidental drops and hard objects scratching, without worrying about AirPods Pro damage.",
      "【Accurate Hole Position】 The charging hole position at the bottom is very accurate, and it will not affect the wired charging at all. It can charge AirPods Pro without removing the protective case.",
      "【Gifts】 On the occasion of important holidays, the beautifully designed and colorful AirPods Pro protective shell is a good gift for family, friends and children. This will receive welcome and praise."
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Don’t buy this, unless you want to be disappointed.",
        "text": "I don’t recommend this AirPod Pro case at all. The top part is separate and doesn’t fit well (it comes off too easily). And you can see in the photos, the overall quality is really sloppy. There’s excess rubber on the edge of the bottom piece , the boba circles are off-center, it’s just a mess.",
        "verified": true,
        "helpful_votes": 3
      },
      {
        "rating": 3.0,
        "title": "Average",
        "text": "The case looks like the picture but at the same time it doesn’t. The color is off but it’s not too serious. The case isn’t a light brown it’s more of a pink salmon color. The boba dots are more oval than round and the straw looks like an end of an eraser on a pencil haha. The case is super cute just wish it was a bit closer to the picture.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 4.0,
        "title": "Love the detail",
        "text": "Beautiful and detailed, but leaves area exposed and is 2 pieces",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Oqplog",
    "tags": [],
    "price": 10.99,
    "position": 18,
    "page": 2
  },
  {
    "id": "prod_wireless_headphones_120",
    "parent_asin": "B074CGSRSZ",
    "category": "Wireless Headphones",
    "title": "Replacement Ear Pads for SteelSeries Siberia V2 Headphones - Black",
    "description": "Ear pads cushion compatible with SteelSeries Siberia V2 Headphones,Cushions align with mounting posts inside the headphone earcups, snap easily into place.  Headphones sponge sets, in general, I recommend replace ear cups every three to six months. Lot of people are not used deliberately to clean ear pads, however product will contact with the secretions of face, secretions paste in headphone earmuffs, a long time it will breed a lot of bacteria, is likely to cause skin allergies, cross-infection and other diseases seriously affect health  Remark  The most important point in installation: remove the original adhesive COMPLETELY.Please search and look through the instrunction video on Youtube if you are not familiar with installation. These are new replacement parts, 100% brand new and high quality, almost same as original.  Product is OEM, NOT made by Headphone's Corp, does not bear any trademarks that owned by original headphones Corp and the seller is NOT affiliated with the headphone original Corp.  All images is real picture, All Images Copyright, All Rights Reserved",
    "rating": 4.7,
    "review_count": 43,
    "features": [
      "Replacement Soft Protein leather ear cushions pads designed for: SteelSeries Siberia V2 Headphones",
      "Memory foam earpads, Replace lost, damaged or worn out ear cushions for your headphones",
      "This Earpads comes with Protein Leather for Extra Comfort and upgraded Memory Foam for Noise Blocking Enhancement.",
      "Refurbish your headphones with this high quality earpad is not just about improving the comfort and sound quality, it’s also about keeping healthy. worn out earpads can be a breeding ground for nasty bacteria as a result of accumulating years of sweat.",
      "The most important point in installation: remove the original adhesive COMPLETELY.Please search and look through the instrunction video on Youtube if you are not familiar with installation."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Must Buy",
        "text": "Headphones are still good, so why not try this out.  it works.  It's a little effort to get the older ones out, but its worth it.  Take your time.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "super nice",
        "text": "son perfectos y no le envidean nada a los originales",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "HIQUE",
    "tags": [],
    "price": 11.98,
    "position": 19,
    "page": 2
  },
  {
    "id": "prod_wireless_headphones_088",
    "parent_asin": "B0B3X5M3RY",
    "category": "Wireless Headphones",
    "title": "Impeto RCA to 3.5mm Cable 10ft/3m, 6N OCC Aux to RCA Headphone Male to Male Jack Adapter Cotton Braided 1/8 to RCA Audio Y Cord Subwoofer Cable",
    "description": "",
    "rating": 4.5,
    "review_count": 48,
    "features": [
      "6N OCC Coaxial RCA Cables: Designed with high-purity (99%) 6N OCC Single Crystal Copper and Double-layer shielding, IMP-2203 coaxial RCA cables can seamlessly transfer high-quality audio signals, which brings you naturally clear and stereo sound. 24K gold-plated connector and solid reinforced copper shell ensure superior durability under heavy usage and multiple plugging and unplugging.",
      "Premium Materials for Subwoofer Cable: The IMP-2203 RCA cables are made of classic cotton net braided, which is effective to avoid signal interference and puts through an 15000+ ultra-durable bend test to achieve a longer lifespan. Combined Wear-resistant and stylish.",
      "High Quality Aux Cord: With the 75 ohm constant impedance, this aux cable arrives the standard of high-quality signal transmission in the digital era. Listening to nature, it feels like being on the spot to enjoy excellent details tuning and clear expression of musicians' emotional performance.",
      "Wide Compatibility 3.5mm RCA Cables: IMP-2203 3.5mm to 2-Male RCA Audio Cord is compatible with iPhone, iPod, iPad, MP3, CD players, laptops, tablets and any other digital device with a 3.5mm audio jack, and also home audio systems, like amplifier or receiver with RCA jacks.",
      "About Impeto: Back in 1986, Impeto was born in Italy. We are always striving to reach the next level and critical for every single details.Impeto offering a broad range of time-tested high-end audio and video cable connectors accessories direct to the retail. We have a comprehensive factory management system and production flow in China. Dark Samurai Series IMP-2203 10ft is made in Chinese factory."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Nice cable",
        "text": "[[VIDEOID:725069475b81a16aafcd79d1f9e27361]] Nice cable.  The cord feels easy to adjust but sturdy and like it will be pretty durable I think.<br /><br />Overall it seems nice.  Looks like a standard rca cable connecter.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Durable",
        "text": "This is compatible with IMP-2203 3.5MM TO 2-male RCA adapter and it is compatible with iPhone, iPad, ipad,, MP3 players, cd players, laptops, tablets, and any digital device with a 3.5mm audio jack. The connector is plated on 24k gold to ensure it doesn't oxidize and to ensure that it is reliable. This allows yoy to eliminate signal loss and optimize your signal transfer and give you higher quality audio.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "works great",
        "text": "convenient and a good value",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Very well made.",
        "text": "I ordered the Impeto RCA Cable to replace stock cables that were included with my turntable. These are extremely durable and look high quality. The sound seems crisper and they are a nice touch to my audio setup without breaking the bank. I am pleasantly surprised and would highly recommend if you are in the market for some RCA cables. I am definitely going to order more when I add to my stereo.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Over-the-top quality",
        "text": "We are using these to connect a cheap record player to better speakers. To be honest, this cable feels like overkill for what we need. Such a solid premium feel! The braided cable is substantial. The connectors are copper, high quality, and fit snugly. If you don't mind the price, these are very nice cables.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Impeto",
    "tags": [],
    "price": 53.99,
    "position": 20,
    "page": 2
  },
  {
    "id": "prod_wireless_headphones_103",
    "parent_asin": "B07S1582YY",
    "category": "Wireless Headphones",
    "title": "Jabra Move Style Edition, Black – Wireless Bluetooth Headphones with Superior Sounds Quality, Long Battery Life, Ultra-Light and Comfortable Wireless Headphones, 3.5 mm Jack Connector Included",
    "description": "Jabra Move Style Edition is designed for music on the move. These wireless headphones feature the crisp digital sound of Jabra’s signature (Digital Signal Processing) DSP that gives your music, movies and calls true depth and real clarity. The clean, simple, Scandinavian design encompasses a powerhouse of sound and functionality that’s as durable as it is stylish. You can take control of your music and calls directly from these wireless Bluetooth headphones with conveniently placed buttons that allow you to keep your phone in your pocket. Keep the music going all day long. Jabra Move Style Edition has an ultra-light, adjustable headband that stays comfortable, even used over an extended period of time. With up to 14 hours of battery life on a single charge and up to 12 days of standby, these cordless headphones are designed to keep up with your busy day. Plus, a 3.5mm jack connector is included in case you run out of battery or want to listen on an airplane. Jabra Move Style Edition keeps you comfortably taking calls and listening to your music, no matter where you are.",
    "rating": 4.3,
    "review_count": 3434,
    "features": [
      "Wireless headphones – Jabra move style edition provides unparalleled wireless sound quality. The crisp digital sound of Jabra’s signature (Digital Signal Processing) DSP gives your music, movies and calls true depth and real clarity wherever you are.",
      "Multi-functional Bluetooth headphones – Take control of your music and calls directly from the headphones. Conveniently placed buttons mean you can control your calls and music at the touch of a button and enjoy the true freedom of wireless technology.",
      "All day comfort – An ultra-light, adjustable headband means you can wear the move style edition all day long. So you can comfortably chat and listen to music for hours.",
      "Durable design – The clean, simple, Scandinavian design of move style edition encompasses a powerhouse of sound and functionality that’s as durable as it is stylish. These cordless headphones are designed to inspire and built to last.",
      "Up to 14 hours of use – The Move Style Edition is designed to keep up with your busy day. Enjoy up to 14 hours of battery life on a single charge and up to 12 days of standby. If you run out of battery, simply attach the 3.5 millimeter cable (included standard)."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Good value for the price",
        "text": "First I like sound! I'm an audiophile at heart but in my life now I'm an audiophile on a BUDGET! These are my first bluetooth speakers. More on that in a minute.<br /><br />I was looking for on ear bluetooth speakers with a budget of about $50 to $60 and was set on waiting for a sale on the JBL EB45T but then saw these recommended on the wirecutter website (a pretty good review site in my opinion)<br /><br />There is nothing wrong with these, but nothing really right about them either. They have a nice neutral sound that you can listen to for a long time. For movies and youtube on my computer, they are great. But there is nothing in the sound that is going to wow you either. Trust me if there was something actually wrong with the sound, I'd be telling you. You can listen to these for a long time without ear fatigue. If you are looking for lots of rumble for movies, these probably aren't the right phones for you. But if your movie listening requirements are more modest then these work well for that. For casual background music, podcasts, audiobooks, they will work really well for that.<br /><br />Isolation is not great. I think the plastic is thin so a certain amount of noise gets in. I wanted to be able to hear a little bit of background noise, things going on in the house, but these push my limit for how much I want to hear. Even though they were open-back my Sennheiser HD-229 did a better job with isolation because of the design of the pad.<br /><br />Comfort isn't bad and for my ears, the ear cup size is just about right size. I wish the earpieces swiveled a bit more but for my head, they swivel just enough. . They have a left and right and the cups swivel so little that if you have them on the wrong way you will notice.<br /><br />Bluetooth... These are a pain in the backside on Win 7. When I want to use them I have to go and delete the previous pairing, pair them again and then go to the control panel and set these to be used for output. For movies on the computer, they get out of sync. I even set my movie player (Pot Player which I highly recommend) to use the Bluetooth headphones and they still get out of sync with the audio. I don't know if it's the player, the USB Bluetooth adapter, Windows 7 or some combination of them together.<br /><br />I like that they can be used with a wire as well as with bluetooth. The controls are a little small, as mentioned by others but I don't have trouble working them.<br /><br />I also tried the JBL EB45T Bluetooth headphones, which cost almost twice as much, at Target and these sound better overall. The JBL might have had better highs, a little punchier bass but these are more cohesive across the frequency range with nothing tweaked to make them sound 'better'.<br /><br />Summary: I don't have any other Bluetooth headphones to compare these to but I think most people would be very satisfied with these at this price point for general use. If however, you are looking for audiophile on a budget, it's not here.",
        "verified": true,
        "helpful_votes": 159
      },
      {
        "rating": 3.0,
        "title": "The sound quality is fantastic and the battery life is excellent",
        "text": "I've been very impressed by many things in the month that I've had this.  The sound quality is fantastic and the battery life is excellent.  I've owned these for a month and the leather cover over the ear cushion is splitting exposing the foam.  Not sure if this is a fluke or what kind of flaw this is.  I've just been using them at my desk and walking around town, medium use for about 5 weeks, when I noticed it was splitting.",
        "verified": true,
        "helpful_votes": 4
      },
      {
        "rating": 3.0,
        "title": "Good sound effects",
        "text": "Good sound effects, but Bluetooth connection is not very reliable, the sound is intermittent, you have to turn it off and repair it with other devices like laptop, iPhone, egg.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "These headphones are incredible.",
        "text": "Fantastic value. Amazing sound, light and comfortable. I never write reviews but I was so pleased with this product that I did.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "Meh... just OK.  Not worth $100",
        "text": "Read some good reviews and picked it up on sale during prime sale.  To me, these are just OK.  I'm not overly impressed.  For $100 they are not worth it, less than $60, just OK.  I have a pair of motorola solo wireless and those are much better as it pertains to battery life, sound, and durability.  These seem like they are going to break very easily.  They feel extremely cheap.  The sound is not bad but nothing overly impressive.  Battery life is meh, it's giving low battery warnings at 50% levels based on what is reported to my iPhone, Plays that warning message about every 5 minutes or so... stupid.  When I turn it on it takes a bit for it to function with my iPhone 7, Motorola solo pretty much instantly ready.  On a positive note, I've used them with phone calls and no one complains... my Motorola solo there are a few times where people had issues hearing me.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Jabra",
    "tags": [],
    "price": 149.95,
    "position": 21,
    "page": 3
  },
  {
    "id": "prod_wireless_headphones_069",
    "parent_asin": "B09Z6JD942",
    "category": "Wireless Headphones",
    "title": "Cat Paw Series AirPods Pro Case with Ring Chain, 3D Silicone Cartoon Fashion Design for AirPods Pro Case Cover (2019)",
    "description": "",
    "rating": 4.5,
    "review_count": 68,
    "features": [
      "Compatible: Specially designed for Airpods Pro (2019 released model)",
      "Cute design: Funny Cat Paw Cartoon Style, Compatible with AirPods Pro and transforms it into something unique and adorable.",
      "Material: AirPods Pro Charging Case protective cover is made of high-quality soft silicone material and model pressing process, made into a unique pattern and shape.",
      "Protection: The case is made of flexible, impact-resistant silicone material that provides all-round protects your AirPods Case against bumps, drops and scratches.",
      "Package: 1*AirPods Pro case, 1*Ring Chain"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great fun case for Airpods Pro but Amazon shipping cropped the ball again!",
        "text": "Nice protective case but not sure why they can't make it one piece like the 2nd gen Airpod cases.  I've seen lots of reviews for others that says top will not stay on because of two piece design.<br />Now I purchased two, which I usually do with an item like this.  One for backup since these kinds of items tend to wear fast.  Both were shipped on different dates and the first one was delivered to wrong address.  Amazon shipping has really gone downhills.  They need to address this issue...Fast!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Super cute!",
        "text": "This is supercute, fits my Airpods and looks sturdy.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "NANRIDAO",
    "tags": [],
    "price": 6.98,
    "position": 22,
    "page": 3
  },
  {
    "id": "prod_wireless_headphones_101",
    "parent_asin": "B0B9RXVXT6",
    "category": "Wireless Headphones",
    "title": "Beats Fit Pro Case Cover, AIRSPO Soft Silicone Case for Beats Fit Pro 2021 Shockproof Beats Fit Pro Earbuds Case Cover with Keychain （Earth）",
    "description": "",
    "rating": 4.0,
    "review_count": 445,
    "features": [
      "【Compatibility】This Shock-Absorbing protective case is specially designed for Beats Fit Pro charging case (2021) (Notice: The Beats Fit Pro is not included)",
      "【High Quality Material】The Beats Fit Pro case cover made of soft durable elastic silicone material, complete protection against scratches, bumps, anti-shock and anti-slip, the surface is treated with special oil spray for anti-fingerprint and dustproof",
      "Durable Carabiner】Each silicone beats fit pro protective case is equipped with a metal carabiner clip, you can easily hang it on a backpack, keychain, belt of trousers, etc., in case of missing it and is being very convenient to use",
      "【Easy Installation】Come with highly sticky doulble-sided adhesive design avoid losing your beats fit pro earbuds when you out the door,support wireless charging and charging with charging cable no need to remove the case cover to charge your beats fit pro",
      "【4 in 1 Package】One Silicone Case, One Carabiner, One Steel Ring, Two Spare Gel Pad. (beats fit pro & charging case not included) 30-Day money-back for any reason. If there are problems, Contact us anytime"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Awesome case",
        "text": "I love this case for my Beats Fit Pros.  The regular case is way too slippery, especially with dry hands.  This has a nice rubbery grip, plus the carabiner.",
        "verified": true,
        "helpful_votes": 3
      },
      {
        "rating": 5.0,
        "title": "Great quality",
        "text": "[[VIDEOID:ad92bf895df61c4b1443a717fa59a9c7]] Great product but I ended up choosing the hard case instead bc I read it protects more. I also read some reviews that it does not fit, but mine fit just perfect.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Fits my headphones",
        "text": "I was worried this wouldn’t fit my headphones correctly but it does. I bought it so I could hang these in my backpack and find them easy.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Very Nice",
        "text": "Purchase for son to prop his beats",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "AIRSPO",
    "tags": [],
    "price": 10.99,
    "position": 23,
    "page": 3
  },
  {
    "id": "prod_wireless_headphones_164",
    "parent_asin": "B07RYNFR2B",
    "category": "Wireless Headphones",
    "title": "AirPods Case, Full Protective Silicone AirPods Accessories Cover Compatible with Apple AirPods 1&2 Wireless and Wired Charging Case(Front LED Visible),Matcha",
    "description": "",
    "rating": 4.7,
    "review_count": 24347,
    "features": [
      "100% SATISFACTION GUARANTEE:We promise to bring the best quality AirPods case to our customer,If you are not satisfied with our products,you can get returns and money back within 12 months.",
      "HIGH PREMIUM SILICONE:SATLITOG AirPods case is made of food grade silicone material, which is different from other ordinary silicone case. Even if it is used for a long time, it is still comfortable and does not age.",
      "360°FULL PROTECTIVE:SATLITOG AirPods case use the latest one-piece molding process and micro-matte technology on the surface, leaving no fingerprints,anti-fall and 100% dust-proof,which can be washed quickly.",
      "PERFECT FOR YOUR AIRPODS:The newly upgraded fitting technology, without gaps, and the bottom dust plug design, which is a wonderful design that is more convenient for your life,whether you are traveling or in sports.",
      "WHAT DO YOU GET:A cost-effective luxury package,you will get:1xAirPods case 1x Carabiner(NOT INCLUDE AIRPODS)"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great case",
        "text": "Just got it but it’s great!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Perfect AirPod Case",
        "text": "Case is just as described and shipping was super fast.  Case is sturdy with easy access to the charger port.  Color was exactly as pictured.  Get yourself one today.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Sturdy, better than others",
        "text": "Great color, sturdy, better quality than the last couple I’ve ordered. The others were more flimsy, this one is solid, but still flexible enough to fit my Airpods.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Perfect Fit for AirPods 2!!!",
        "text": "Perfect fit for AirPods 2. It comes with a carabiner to book it with your keys and even shows the light on the front. Definitely worth the money.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great material with nice clip",
        "text": "Really like the feel of the material and fit perfectly for my AirPods.  The hook with lock is extra that’s an upgrade from my old case.  Going to buy another color case matching for my different outfits :)",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "SATLITOG",
    "tags": [],
    "price": 10.99,
    "position": 24,
    "page": 3
  },
  {
    "id": "prod_wireless_headphones_085",
    "parent_asin": "B09BJKQTZS",
    "category": "Wireless Headphones",
    "title": "NIUTRENDZ Cute Cow Print Case for Airpods Pro Case Cover TPU Hard Case Protective Skin with Keychain Compatible with Apple AirPods Pro (Robin’s Egg Blue)",
    "description": "",
    "rating": 4.7,
    "review_count": 2412,
    "features": [
      "【COMPATIBILITY】This cow print case precisely designed for Apple AirPods Pro (2019 Release).",
      "【PROTECTION】Impact-resistant TPU hard shell design provides 360° full protection for your AirPods Pro against drops, scratches and bumps.",
      "【EASY CHARGING】Support wired and wireless charging. No need to remove the Airpods Pro case to charge your Airpods Pro wireless! LED light is visible during the charging.",
      "【CARABINER INCLUDED】Added a metal carabiner, easy to carry and convenient to attach the Airpods Pro to handbag or backpack.",
      "【WHAT YOU GET】1 x AirPods Pro cover, 1 x Metal Carabiner, 2 x Adhesive Tape. (AirPods Pro & AirPods Pro Charging Case NOT included.)"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "So cute exactly like pictured!",
        "text": "Great quality, perfect for keys or purse the clip is nice quality and the print is vibrant and cute! Love this case!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Amazing",
        "text": "soo cute. it is also so sturdy",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "NIUTRENDZ",
    "tags": [
      "Sponsored"
    ],
    "price": 10.99,
    "position": 25,
    "page": 3
  }
]