[
  {
    "id": "prod_running_shoes_192",
    "parent_asin": "B0B27YH5MH",
    "category": "Running Shoes",
    "title": "adidas Men's Mana Bounce 2 M Aramis Running Shoe",
    "description": "Designed to surround your foot in long-lasting comfort, these running shoes let you push for the extra mile with a closed mesh upper and cushioned midsole.",
    "rating": 4.3,
    "review_count": 149,
    "features": [
      "100% Synthetic",
      "Imported",
      "Rubber sole",
      "Lightweight running shoe featuring breathable upper, printed overlays, and plush cushioning",
      "Breathable closed-mesh upper",
      "Padded tongue and collar, soft fabric lining",
      "Responsive and cushioning Boost midsole",
      "Durable rubber outsole"
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "fits small; go a half size up",
        "text": "fits more snug than expected; not my fave.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Comfortable",
        "text": "Husband says they are comfortable and fit well. Black on black look like shoes that would be perfect for wait staff.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "Nice shoes very light and comfortable",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Excellent overall shoe for running",
        "text": "This is my 2nd pair of Adidas mana bounce sneakers. Excellent overall shoe for running, walking, and gym activities that is lightweight and breathable.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Comfortable, sturdy and a great value.",
        "text": "First things First.  I received this as a review item in exchange for an unbiased review. I have an 11 M foot (US) and while I wasn't overly crazy about the color, I realized they matched a lot of my race wear.  So I decided to give them a try.  The first run was a little tough but that's always the case (If you're new to running, trust me, don't run your first race without adequately breaking in your shoes). After about 15 miles I started to really like them.<br /><br />So, you see the colors.  I personally always buy the clip on laces which I did butI've probably got well over 60 miles on them now and while I'm pretty loyal to another brand (which is also costs substantially more) I will definitely be picking up another pair.<br /><br />If you are a heel striker (work on your form before you suffer the consequences of it) these have ample cusioning in the back - but take a friendly word of advice, instead of getting into bad form.  These are great shoes to improve your form with and once you have it, the extra padding in the back is not impediment.  They are very light and fit well once worn in.  I'm not trilled about the simultaneously yet cool look they have but so is life.  You don't buy running shoes to look cool unless you're a poster you buy them for performance and these deliver.<br /><br />Again I'm speaking to new runners and people that aren't that familiar with the sport. You don't want to have one pair you wear every day. They'll develop a wear pattern and it's not good. Instead buy at least two, ideally a few and alternate so that this happens at a much slower pace. From my experience, three pairs of shoes worn on alternating days will last much longer than one pair bought three times.  And this is important b/c unless you're working on bearfoot running (which seems to still be a raging philosophical battle in the podiatric communities) you'll want support, comfort and stability. As a digression, I've tried barefoot running and it fundamentally changed the way I ran, until I stepped on a piece of glass and my right foot had yet to harden.<br /><br />Again at the risk of lecturing remember that injuries are one of the biggest enemies to progress. You could easily run through broken glass on these and probably right over some smaller nails (I'm not advising it, just pointing it out).  Styling aside I love these and will be picking up another pair or two in the near future.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "adidas",
    "tags": [],
    "price": 77.68
  },
  {
    "id": "prod_running_shoes_174",
    "parent_asin": "B096LLNTR4",
    "category": "Running Shoes",
    "title": "Saucony Women's Switchback 2 Trail Running Shoe",
    "description": "Dialed to grip and rip trails fast. For trail runners looking to get to their destination fast, The lightweight Switchback 2 is a race-ready machine that delivers more of what you need—long-distance cushioning placed into a nimble, grippy, and dialed-in package.",
    "rating": 4.2,
    "review_count": 150,
    "features": [
      "Synthetic-and-mesh",
      "Rubber sole",
      "Toothy lugs made of PWRTRAC tacky rubber for grip",
      "New pwrrun+ cushioning is 5% lighter for more protection and flexibility",
      "New sock-like construction featuring a side-set boa lacing system"
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Love the idea, needs some redesign",
        "text": "I really want to like this shoe more. I do actually use them a lot but it took nearly half a year to really break them in, and they’re still fairly difficult to slip into, as the opening is not very flexible. The shoe itself is tight enough where the laces don’t even really need to be there, and the toe box is fairly narrow which isn’t very good for running and hiking. My pinky toe often feels wedged by this one part of the design and frequently causes pain. I really REALLY like the idea of this shoe though and it’s still wearable for moderate hikes under 2 hours, I just wish they put more work and testing. It’s probably better for people with thinner, narrower feet. My feet are medium wide and the top part is kind of high.",
        "verified": true,
        "helpful_votes": 4
      },
      {
        "rating": 3.0,
        "title": "Fits just right",
        "text": "I like the way the shoes fit; however, they are more attractive in the picture than on my feet, at least to me.  They are a little pricey too, but all in all, I would recommend them.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Saucony",
    "tags": [],
    "price": 61.34
  },
  {
    "id": "prod_running_shoes_031",
    "parent_asin": "B07L9QD2LL",
    "category": "Running Shoes",
    "title": "AUGSUN 110 Pieces 1/2 Inch Stainless Steel Track and Cross Country Spikes with Spike Wrench, Replacement Spikes for Sprint Sports Short Running Shoes",
    "description": "",
    "rating": 4.5,
    "review_count": 190,
    "features": [
      "【QUALITY MATERIAL】: Made of quality stainless steel, which is very sturdy, rust-resist and anti-corrode. Pyramid needle design, not damage track. Very practical items for both men and women.",
      "【PACKAGE INCLUDES】: Package includes 110 pieces spikes with 1pcs spike wrench, convenient for you to replace your shoe spikes. There are enough quantity for your daily use.",
      "【SIZE】: 1.27cm (1/2 inch) in length, tapered and needle-shaped, which increases friction between the sole and the ground and prevents skidding.",
      "【EASY TO USE & REPLACE SPIKES】: The package includes a spike wrench. It is very easy for you to screw the track spikes into the shoes, convenient to replace the spikes. Ideal for athletic tracks, field and cross country surfaces.",
      "【PROVIDE GREAT DRIP FOR SPORTSMAN】: The spike pins can increase the friction between the shoe sole and ground, resist skid and improve your running balance of traction, flexibility and speed for track sprints, long jump, running."
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "I Left This At The Drop Off In Herrick, IL Which is the Gas Station",
        "text": "Too Small. I Left This At The Drop Off In Herrick The Gas Station Yesterday, With Patrick",
        "verified": true,
        "helpful_votes": 1
      }
    ],
    "store": "AUGSUN",
    "tags": [],
    "price": 10.99
  },
  {
    "id": "prod_running_shoes_059",
    "parent_asin": "B08CHWZRCD",
    "category": "Running Shoes",
    "title": "Brooks Womens Glycerin 18 Running Shoe",
    "description": "A bit like running in the clouds. Thanks to the increased elasticity of the upper and the super-soft cushioning throughout the length, these men's running shoes are the ultimate comfort. Super soft cushioning. The revised ratio between midsole and outer sole allows you to increase LOFT DNA to achieve even more extreme softness at the sole of the foot, without losing reactivity or endurance. An OrthoLiteTM insole ensures an extraordinary wearing comfort.",
    "rating": 4.7,
    "review_count": 6787,
    "features": [
      "Imported",
      "Rubber sole",
      "THIS WOMEN'S SHOE IS FOR: The Glycerin 18 is perfect for runners who think there's no such thing as too much cushioning. The upper enhances comfort by perfectly balancing stretch and structure.",
      "SUPPORT AND CUSHION: Provides neutral support while offering the maximum amount of cushioning. Ideal for road running, cross training, the gym or wherever you might want to take them! Predecessor: Glycerin 17.",
      "SUPER-SOFT CUSHIONING: Increased DNA LOFT super-soft cushioning allows for even more extreme softness, without losing responsiveness or durability, while the OrthoLite sockliner provides premium step-in comfort.",
      "PLUSH FIT: The plush feel of an internal stretch bootie surrounds your foot and moves and expands with your stride. The engineered mesh upper enhances the fit.",
      "SMOOTH TRANSITIONS: The plush transition zone makes every move from heel to toe feel incredibly soft and smooth."
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Defective manufacturing",
        "text": "I’m this was my second pair of these shoes within 6 months but this pair is very u comfortable on the left shoe and I can’t do walks in them.  Very disappointed in it... it’s like the left shoe has a defect I it.  Unfortunately I saved the shoe for over a month before I wore it and too late to return.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great support",
        "text": "These are very comfortable and supportive. I started wearing Brooks when I got planter fasciitis. I haven’t had issues in a long time. I tried another model, but I went back to these.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "My Shoe!",
        "text": "These are the only shoes I have been wearing on a daily basis for over 10 years, Brooks Glycerin. My feet have seen many years of 12 hour shifts and are in sad shape. I have a dress pair, a pair I wear indoors, and several pairs for outdoors and yard work.  I can wear a man's 8 1/2 D or a Women's 9 1/2 wide and they fit perfectly.  If you need a cushioned shoe with good support these are the ones to buy.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Don't Buy!!",
        "text": "The shoes are NOT worth 130.00 or 50.00 inserts last less than one month shoes themselves no arch support. In the end caused my feet problems.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Comfortable Shoe",
        "text": "Comfortable shoe however shoes is not black it is a very dark grey with some black trimming.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Brooks",
    "tags": [],
    "price": 160.39
  },
  {
    "id": "prod_running_shoes_116",
    "parent_asin": "B07VSW6GQB",
    "category": "Running Shoes",
    "title": "New Balance Men's 510 V5 Trail Running Shoe",
    "description": "Are you looking for a lightweight, durable and supportive pair of trail running shoes? Then your search ends with the New Balance 510v5. Durability on the outside meets responsive comfort inside for a lightweight running shoe that's as ready as you are for a trail run or whatever else your day has in store. Built with a rugged construction, these New Balance trail shoes offer relentless durability that is suitable for various runs both on- and off-road. The lugged outsole on these comfortable running shoes features AT TREAD technology which provides enhanced traction on the trail or the road, while the lightweight injection-molded EVA foam midsole includes both ABZORB technology for impact absorption and an NB Soft + Supportive Insert for memory comfort that lasts. For added protection, the reinforced Toe Protect tip helps protect your toes from rocks, roots and debris so you can go off-road with confidence.",
    "rating": 4.4,
    "review_count": 6173,
    "features": [
      "50% Synthetic, 50% Textile",
      "Imported",
      "Rubber sole",
      "Cushioned Running Shoes: ABZORB midsole technology in this runner absorbs impact through a combination of cushioning and compression resistance, and the rubber outsole provides strength and durability",
      "Built-In Off-Road Technology: Toe Protect technology helps protect feet from rocks, roots and debris, while AT Tread on the outsole provides versatile traction during both on- and off-road activities",
      "Plush, Cushioned Running Shoes: These runners feature lightweight injection-molded EVA foam midsoles to provide lightweight cushioning and an NB Soft + Supportive Insert for memory comfort that lasts",
      "Built to Last: With an all-over durable construction and an aggressive lugged outsole, these trail running shoes are designed to stand up to all of your outdoor activities",
      "Athletic Aesthetic: With synthetic and mesh uppers that deliver breathability and a top-quality fit, these running shoes also boast a stylish look to fit in with your active lifestyle"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Very good quality and comfort",
        "text": "This is my 2nd pair. Great quality and comfort. Nice looking too. True to size. Both pairs have lasted me a long time. Highly recommend.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "New Balance shoes fit me the best of all the major brands.",
        "text": "I keep reordering New Balance shoes as previous pairs wear out.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "good inexpensive trail shoes",
        "text": "these shoes have an aggressive tread, and for the price are going to be fine. The medium width is actually fairly wide, and my feet have plenty of room.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "New Balance Men's 510 V5 Trail Running Shoe",
        "text": "I love New Balance Trail Running Shoes. Have purchased several pairs and they have lasted me for years. Very comfortable and durable kicks.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "GREAT BUY",
        "text": "As good a shoe as some of the more expensive brands that I purchased in the past.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "New Balance",
    "tags": [],
    "price": 54.95
  },
  {
    "id": "prod_running_shoes_088",
    "parent_asin": "B09D3N4PRM",
    "category": "Running Shoes",
    "title": "RUNMAXX Running Shoes for Men Walking Shoes Non Slip Fashion Sneakers Gym Tennis Sport Athletic Shoes",
    "description": "",
    "rating": 4.3,
    "review_count": 188,
    "features": [
      "Rubber sole",
      "Fashion Low-top Sneakers:RUNMAXX is dedicated to design shoes which combine fashion and sport. Run on your own way.",
      "Breathable Mesh:RUNMAXX Mens walking sneakers apply breathable woven mesh, which not only keep the shoes lightweight and fashionable, but also ensures the comfort of the product. You won't feel a thing even wearing these sneakers for a whole day.",
      "Non-Slip Sole :The Blade Sneakers is made of hollow carved technology ,Providing full support and comfort for your feet Which Allows The Shoes To Bend Strongly While Doing Sports",
      "Traditional lace-up closure for an adjustable wear: Breathable lining inside,Soft cushioned insoles make you feel good after one day's running , jogging, walking or standing",
      "OCCASIONS:Perfect choice for many occasion: Running, training, gym, casual walking, workout, traveling, hiking, camping, climbing, outdoor activities and daily wear."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great pair of shoes",
        "text": "Love the color and comfort of these gym shoes! Fits great too!!!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "You get what you pay for",
        "text": "Cons.<br />First of all these shoes ARE NOT slip resistant, second after about a month of use the back heal is already wearing down.<br /><br />Pros.<br />They are inexpensive, they provide very good impact  resistance on your feet",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Not really for running",
        "text": "Not really for running maybe walking but not running",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Very comfortable",
        "text": "Definitely a bright color. My son loves them and said they were the most comfortable shoes he's had on his feet. The ladies at the dentist office kept complimenting how great the looked. He's happy/I'm happy!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "Wear very fast",
        "text": "Wear very  fast",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "RUNMAXX",
    "tags": [],
    "price": 22.99
  },
  {
    "id": "prod_running_shoes_159",
    "parent_asin": "B08RY1V5KP",
    "category": "Running Shoes",
    "title": "ASICS Kid's JOLT 3 Grade School Running Shoe",
    "description": "Inspired by our GT running series, the JOLT 3 GRADE SCHOOL shoe is a multi-functional style that’s engineered for everyday use. Featuring a comfortable fit in the forefoot, this shoe is complemented with stitched down overlays to improve support in the upper. Mesh underlays help deliver better airflow to keep feet cool, while the stitched toe and solid rubber outsole increases durability to last longer.",
    "rating": 4.7,
    "review_count": 845,
    "features": [
      "Made in the USA or Imported",
      "Faux Leather sole",
      "Mesh Upper: Provides excellent comfort and breathability",
      "Synthetic leather overlays:",
      "Stitched toe and solid rubber outsole: Improves durability",
      "Stitched toe and solid rubber outsole"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "More durable than most",
        "text": "My son destroys his shoes and it is so hard to find something that doesn’t get a hole the first week. I’m sure not all 10 year old boys are as rough but this style has held up well and we are now on our 3rd pair.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Good product.",
        "text": "Grandson loved them.  Price was very good.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Good quality, look nice",
        "text": "I bought these for my 8 year old (heading into 3rd grade). They fit great and look greats he’s very happy. Time will tell how well they hold up!<br /><br />We have bought ASICS for him before and they hold better than some. We usually wait until there are holes in them before buying new ones, the last ones lasted a good 6 months!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great shoes",
        "text": "Well made, great looking, comfortable shoes.  Kiddo wears them to school and they are working out nicely for her during PE, recess, and after school sports.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "ASICS",
    "tags": [],
    "price": 29.95
  },
  {
    "id": "prod_running_shoes_074",
    "parent_asin": "B09CLLKT28",
    "category": "Running Shoes",
    "title": "ASICS Men's Gel-Kayano 28 Running Shoes",
    "description": "",
    "rating": 4.6,
    "review_count": 3859,
    "features": [
      "Made in the USA or Imported",
      "Rubber sole",
      "Engineered mesh upper improves breathability:",
      "OrthoLite X-55 sockliner: Improves comfort",
      "AHAR Plus Outsole: Strategically positioned in critical areas of the outsole, this exceptionally durable compound is 50% more durable than standard ASICS High Abrasion Rubber.",
      "Trusstic System technology: Reduces the weight of the sole unit while retaining the structural integrity of the shoe.",
      "Redesigned external heel counter helps keep the foot stable and provide a more comfortable stride:"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Total best!",
        "text": "That this is my fourth in a row kayano 28 oughta tell ya something!!!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Asics has changed",
        "text": "I have been wearing Asics Gel Kayano running shoes  for many years.  This is the first time I have had a complaint.  They are no sized correctly.  Every time I wear them my back hurts.  When I put them up against the pair I am replacing the new ones are not the same size.  I missed the return period because I kept thinking they would be okay.  As it is I have 2 pair of shoes that I spent over $200 on and cannot wear them.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great for wide and flat feet",
        "text": "Got these for my son who has a wide/flat foot. He said these are so comfortable. He’s on his feet for most of the day and said his back pain has decreased since wearing these too.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Comfy",
        "text": "I like the additional loops that help keep the tongue from sliding over my narrow feet. Excellent cushion.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "GREAT FIT",
        "text": "Just what I was looking for",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "ASICS",
    "tags": [],
    "price": 150.0
  },
  {
    "id": "prod_running_shoes_033",
    "parent_asin": "B005CZ2Q0A",
    "category": "Running Shoes",
    "title": "Sof Sole -Womens Cleat,running Shoes,cleats track and field equip -Ment, Silver, 3 8-Inch US",
    "description": "",
    "rating": 4.2,
    "review_count": 90,
    "features": [
      "100% Leather",
      "Rubber sole"
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "Three Stars",
        "text": "ok",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "works great",
        "text": "Needed this for a track meet. Worked great.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Works perfectly",
        "text": "Son uses for cross country and track! He loves them.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Fits and works well. WIll buy again.",
        "text": "Great product",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "They still worked great though!",
        "text": "I bought this for my brother for cross country. These however are track spikes and not cross country spikes. They still worked great though!",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Sof Sole",
    "tags": [],
    "price": 6.99
  },
  {
    "id": "prod_running_shoes_156",
    "parent_asin": "B086Z3QXTS",
    "category": "Running Shoes",
    "title": "ASICS Men's Dynablast Running Shoes",
    "description": "The DYNABLAST shoe is recommended for runners who want a responsive underfoot experience during their run. This running shoe comfortably wraps around the foot like a gentle hug. This design features a lightweight and breathable upper to keep feet cool without forgoing support. Additionally, the shoe's upper is made with recycled materials, while the sockliner is produced with a solution dyeing process that reduces carbon emissions and water usage. Equipped with FLYTEFOAM Blast cushioning in the midsole to generate soft landings, this material is also complemented with underfoot cutouts in the outsole to provide runners with a more responsive toe-off.",
    "rating": 4.6,
    "review_count": 991,
    "features": [
      "Synthetic-and-mesh",
      "Rubber sole",
      "FLYTEFOAM BLAST: Lightweight, midsole foam with energetic and highly responsive cushioning and bounce for an efficient ride.",
      "Knit upper:",
      "Solid Rubber Outsole: Provides enhanced durability and traction.",
      "Underfoot cutouts provide excellent bounce:",
      "EVA Sockliner: Removable sockliner that provides cushioning performance."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Very lightweight and comfortable",
        "text": "Like color and comfort",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Dyna and Nova both a Blast.",
        "text": "I had put 700 miles on my Novablast this year and wanted to tell you they held up great even through many runs in snow and rain. I found the Nova well cushioned,nice tongue, wide toe box, firm mid,, but  unstable on camber and turns and a touch heavy.. The dyna I recently purchased feel lighter, good heel cushion, thinner tongue and nice toe drop. I really like both models of ASIC.  Perfect for me at 36 miles a week.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Love the color",
        "text": "While too soft for me to use as a running shoe I do love the snazzy color and I get a lot of compliments on the looks.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "ASICS",
    "tags": [],
    "price": 99.9
  },
  {
    "id": "prod_running_shoes_176",
    "parent_asin": "B08KYG467H",
    "category": "Running Shoes",
    "title": "DREAM PAIRS Boys Girls Athletic Sports Sneakers Tennis Running Shoes",
    "description": "",
    "rating": 4.3,
    "review_count": 2253,
    "features": [
      "Rubber sole",
      "Soft upper for a modern look and maximum durability.",
      "Elastic laces with hook-and-loop strap for easy adjustability.",
      "Padded tongue and collar provides comfort against foot.",
      "Breathable fabric lining for a great in-shoe feel.",
      "Lightweight outsole delivers a natural feel for all-day play."
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "Don't quite fit... 3 is too small & 13 is too big.",
        "text": "I ordered Size 3 for my daughter who just grew out of 2s. They are tight, heavy and smaller than another 3 we have.<br /><br />I ordered size 13 for my son who just outgrew size 12. They are very large and larger than other 13s we have.<br /><br />Both kids said they are too heavy and stiff. They seem like good quality shoes but I can understand the kids' opinion. We are returning both and will try the running shoes with the mesh instead.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Takes A Beating",
        "text": "Purchased these sneakers for our seven year old son. He is very rough on his shoes and I am very surprised how well these sneakers are holding up. He says they are very comfortable and choices to wear them every day.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "daughter loves these",
        "text": "We like these because they are cute, fit well and are mostly waterproof. They are a little bulky but daughter doesn't seem to mind. So far have held up for most of the year (kids run through their shoes pretty quickly usually).",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Cute but not amazing quality.",
        "text": "These sneakers are fine since little guys grow out of their shoes fairly quickly.  He's had better quality shoes, but still these are pretty nice and are holding up reasonably well.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "No thanks",
        "text": "The velcro strap came apart after a month. Would not buy again",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "DREAM PAIRS",
    "tags": [],
    "price": 30.99
  },
  {
    "id": "prod_running_shoes_024",
    "parent_asin": "B0BVLHSWFQ",
    "category": "Running Shoes",
    "title": "VOCOOL 100 PCS 1/4inch Stainless Steel Track and Cross Country Spikes with Spike Wrench, Pyramid Replacement Track Spikes for Sprint Sports Short Running Shoes, Black/Silver",
    "description": "",
    "rating": 4.6,
    "review_count": 192,
    "features": [
      "【What You Get】: Package includes 100 pieces black spikes with 1pcs spike wrench, convenient for you to replace your shoe spikes. There are enough quantity for your daily use.",
      "【Quality Material】: These spikes are made of quality hard steel, durable and rust-resist and anti-corrode, ensure you to use for a long time.Easy to match with most of the track shoes, improve your running balance of traction, flexibility and speed.",
      "【Easy to Use & Replace Spikes】: The package includes a spike wrench. It is very easy for you to screw the track spikes into the shoes, convenient to replace the spikes. Ideal for athletic tracks, field and cross country surfaces.",
      "【Size】: 6.35 mm (1/4 inch) in length, tapered and needle-shaped, which increases friction between the sole and the ground and prevents skidding,especially suit for track sprints, long jump,running, outdoor sports activities.",
      "【Improve Running】: If you like running, climbing, or you are a sports enthusiast, this track spikes will help you a lot. This pyramid spikes will add the friction between the shoe sole and ground, thus can resist skid and improve your running speed."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "replacement for broken spikes",
        "text": "I play cricket and the spikes under the shoes break frequently. I have bought this brand, i am hoping they would last me for a long time. They screw into the shoes perfectly",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "pyramid spikes",
        "text": "love these but the track does not want pyramid, they want needle spikes. not sure what to do with these now.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "A must have in a coach’s bag",
        "text": "Great value",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Quanity",
        "text": "Nice quantity and great fit dor ny daughter nike cletes.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Bought them again!",
        "text": "We liked the 1st purchase so much that we bought another for the rest of the season.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "VOCOOL",
    "tags": [],
    "price": 7.53
  },
  {
    "id": "prod_running_shoes_063",
    "parent_asin": "B00RK351TA",
    "category": "Running Shoes",
    "title": "Saucony Men's Redeemer ISO Road Running Shoe",
    "description": "High stability road running shoe, accomidates orthotics & overpronation\nSaucony is among the most respected names in running shoes. We offer a wide range of running and walking shoes, each with the Saucony trademark fit, feel and performance. We've spent years studying the biomechanics of top athletes. Our goal? To develop creatively engineered systems that maximize your performance in your specific activity, allowing you to focus on the activity instead of the equipment. From our studies have come many innovative Saucony concepts. Advanced technologies-like Grid, the first sole-based stability and cushioning system--provide an advantage to athletes of all types.",
    "rating": 4.4,
    "review_count": 302,
    "features": [
      "100% Synthetic",
      "Imported",
      "Rubber sole",
      "Width denoters: D (Medium), E, 2E (Wide), 3E (X-Wide),"
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Stability at a reasonable price",
        "text": "My podiatrist said I needed stability shoes. These were the only ones that fit me properly. So far, they are working well for me. They are slightly wider than expected, but only slightly.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "My ankle feel better!",
        "text": "Excellent choice for fallen arches and overpronating ankle.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Great for flat feet",
        "text": "I have an extremely flat arch, these are wonderful for walking or gym days. This was my third pair I've bought.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "great",
        "text": "8th different pair of saucony  shoes. great comfort and quality.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Extreme width",
        "text": "The width is substantially wider than stated. I wear a 2E, which is sometimes too tight, but the 2E in these shoes is far too wide for me, giving the space of a 4E or larger.",
        "verified": false,
        "helpful_votes": 1
      }
    ],
    "store": "Saucony",
    "tags": [],
    "price": 119.95
  },
  {
    "id": "prod_running_shoes_062",
    "parent_asin": "B096CB91P8",
    "category": "Running Shoes",
    "title": "Saucony Women's Kinvara 13 Running Shoe",
    "description": "When it comes to lightweight speed, nothing crushes the competition like the Kinvara. And this just so happens to be our lightest one yet. With more speed contouring and its signature flexible feel, it pushes you forward without holding anything back. These are the shoes you’ll do big things in.",
    "rating": 4.5,
    "review_count": 299,
    "features": [
      "Rubber sole",
      "The Kinvara 13 was literally designed for speed. Its beveled midsole and new midfoot contouring deliver a smoother, faster ride.",
      "Its re-imagined upper is made with a single-layer mesh, giving you a lightweight feeling and even more breathability.",
      "We created the lightest Kinvara ever to help you truly take off. It’s 7.2 ounces of pure speed."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Light, neutral shoe",
        "text": "Saucony neutral running shoes are the only kind of running shoes that I have ever purchased. I had accepted that my feet can only tolerate running if I’m wearing the ugliest, clunkiest shoes. That’s changed with this pair. They are so lightweight and look nothing like my other pairs. I usually have to lace up my shoes differently, but haven’t had to do that with these. They’re so lightweight, but provide all of the support that I need",
        "verified": true,
        "helpful_votes": 5
      },
      {
        "rating": 5.0,
        "title": "Get 1/2 size larger. I wear 8 1/2 purchased 9.",
        "text": "Comfortable and lightweight. Great color.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Lightweight and breathable",
        "text": "Pros:<br />-Overall these shoes are pretty lightweight and breathable. Good amount of air flow with the mesh siding, however you need to take good care of these as the mesh can rip easier when you catch your foot on a step.<br />-I am a huge fan of saucony and have never had bad results with any of their shoes over the past 20 years. These shoes appear to be more of a basic model that I would expect to last about a year or 1 marathon season.<br />-No issues with blisters or rubbing.<br /><br />Cons:<br />-There isn’t much grip/tread on the bottom of these shoes. For this reason, I don’t expect these to hold up as well as some of the other models of Saucony shoes I’ve had in the past.",
        "verified": false,
        "helpful_votes": 3
      },
      {
        "rating": 5.0,
        "title": "Lightweight, cushioned, and Comfortable…",
        "text": "[[VIDEOID:e8f84c743163d7b17341711cad808847]] These sneakers are true to size and very comfortable.  Nice sneakers for light runs or jogging.  Very breathable for summer too.<br /><br />Trust you found this review honest and helpful:-)",
        "verified": false,
        "helpful_votes": 2
      },
      {
        "rating": 4.0,
        "title": "True Fit",
        "text": "I have been wearing Saucony shoes for a few years now. They're one of the few shoe brands that I can order without trying on first. I can count on their shoes being true fit. This pair is no exception. I have wide feet and it's hard to find shoes that fit period! Let alone being able to order them online. These are running shoes and I am not a runner. I do find them to be less cushiony than I am used to. Maybe it's because they are running shoes. They are still comfortable to wear. I like the black and silver colors.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Saucony",
    "tags": [],
    "price": 69.94
  },
  {
    "id": "prod_running_shoes_097",
    "parent_asin": "B09VB9Z2P4",
    "category": "Running Shoes",
    "title": "M MGRNDL Womens Air Running Shoes Breathable Tennis Fashion Sneakers for Walking Jogging Gym",
    "description": "",
    "rating": 4.1,
    "review_count": 162,
    "features": [
      "Rubber sole",
      "Platform measures approximately 1.00\"",
      "Air Cushion: M MGRNDL women's air running shoes features air cushion design to provide cushioning and support for the feet, protect your knees.",
      "Breathable Mesh: Double-layer knitted fabric upper designs with unique knitted structures make the upper more breathable and comfortable.",
      "Memory Foam Sole: The memory foam insole and the low-density PU outsole offer these sneakers great cushioning.",
      "Occasions: Slip on sneaker suits for daily, walking, running, shopping, traveling, working, driving, jogging, training, playing tennis, casual outdoor, etc.",
      "Easy slip on sneakers: This style of shoelaces is more inclined to decoration, which is suitable for adjusting the tightness of the shoes themselves. Very easy on and off. Medium width. We recommend the wide feet to choose a half size up."
    ],
    "reviews": [
      {
        "rating": 2.0,
        "title": "Cut Foot",
        "text": "At first glance these shoes looked ideal. The uppers are mesh and they tie. The black and white look sporty. But the shoes left a,cut on the top of my left foot. The piece that holds the lace is not padded and it rubbed and cut the top of the foot. The right one was okay. Just not acceptable. I suppose yoi could afgix pads to prevent the rubbing or better yet buy shoes without that problem.",
        "verified": false,
        "helpful_votes": 1
      },
      {
        "rating": 4.0,
        "title": "Great for walking and running, on even or paved surfaces.",
        "text": "[[VIDEOID:c1b550fb45bc70f6146cd85777443b05]] The M MGRNDL sneakers are light, a bit flexible, and the air cushion design provides a cushioned impact. They have a good grip on surfaces, so they provide stability.<br /><br />They do look good and the upper mesh fabric has some breathable properties.<br /><br />They do a good job when walking and running short distances.<br />I would have liked if they mold to the foot better and had softer fabric, but at this price point it might be hard to find.<br /><br />The M MGRNDL might not provide a good experience when running on uneven surfaces. They are not as comfortable as other well known and higher priced (twice as much) running sneakers brands.<br />The air cushion do provide a bit of support and comfort when running on even ground, such as concrete, pavement, grass or sand.<br />They do provide some level of impact resistant and support on the feet.",
        "verified": false,
        "helpful_votes": 1
      }
    ],
    "store": "M MGRNDL",
    "tags": [],
    "price": 19.99
  },
  {
    "id": "prod_running_shoes_196",
    "parent_asin": "B0BKWFQW9S",
    "category": "Running Shoes",
    "title": "Avia Avi Factor Slip On Girls' Sneakers - Lightweight Tennis, Athletic, Running Shoes for Girls - Toddler, Little Kid, and Big Kid Sizes 11 to 6",
    "description": "",
    "rating": 4.2,
    "review_count": 507,
    "features": [
      "Rubber sole",
      "PERFORMANCE SNEAKERS FOR GIRLS - A sturdy, dependable everyday sneaker that provides ultimate durability for active kids. The lightweight, breathable mesh overlays create comfort and ventilation.",
      "SLIP ON, NO TIE LACES ALTERNATIVE CLOSURE - Gore, bungee, or toggle lace closures with no tying makes an easy, fast on and off option for toddlers, preschoolers, and kids of all ages. The perfect camp, sports, everyday, or back to school shoes! Available in sizes toddler 10 to big kid 6.",
      "COMFORTABLE & DURABLE GIRLS ATHLETIC SHOES - The Avia compression molded EVA midsole and removable EVA sock add supportive cushioning for all-day wear.",
      "COOL TODDLER & GIRLS SNEAKERS - In trendy, versatile colors, these running shoes go with everything in their wardrobes - and they stand out in the crowd!",
      "NON-MARKING TPR SOLEPLATE - Kids will leave their mark on people, not on the ground or gym floor! The thick but light weight rubber sole holds up to everyday wear and play."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great little athletic shoes",
        "text": "My daughter, age 5, wears a size 13(kid) and has a wide foot. These shoes fit nicely. I like that there isn't any velcro. Velcro never holds up well and everything gets stuck to it. These shoes are closer to the shoes that we'll be buying in the near future once my daughter masters tying laces. Highly recommend these shoes.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 3.0,
        "title": "Pretty and comfortable but looked worn very quickly",
        "text": "My granddaughter loved these shoes - she loved the colors and the fit -  but they wore out in a matter of a few weeks.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "True Size Fit",
        "text": "These girl's tennis shoes are so cute! They're also pretty comfortable. The slip-on feature is easy and the shoes stay on. Traction is good. They are true size fit. And they're very affordable.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Pretty",
        "text": "They liked the rainbow sneakers. These sneakers were good. She could run in them without a problem.<br />These shoes are very nice. They were cute for my child. They thought they were comfortable. The fit was fine. They were able to use it for different situations. They were easy to put on and off. The quality seemed fine. They looked good on her. She liked them. The deal was fine. I would recommend them.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Comfortable",
        "text": "Fits as expected, pretty design and colors.  Comfortable,  well made, good brand.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Avia",
    "tags": [],
    "price": 29.98
  },
  {
    "id": "prod_running_shoes_152",
    "parent_asin": "B07WZGQ7CM",
    "category": "Running Shoes",
    "title": "WONESION Mens Breathable Walking Tennis Running Shoes Blade Fashion Sneakers",
    "description": "",
    "rating": 4.2,
    "review_count": 20698,
    "features": [
      "Rubber sole",
      "UPPER---Fashion mesh upper, soft and breathable. Super breathable upper keeps your feet clean and cool.",
      "INSOLES---The interior of the shoe uses a honeycomb insole that adds cushioning and impact resistance to provide a comfortable feeling for your feet.",
      "OUTSOLES---Blade soles, made of TPU rubber, durable and enhanced non-slip design and make you walk and sports freely on all kinds of ground.",
      "OCCASIONS---Perfect choice for many occasion: Running, training, gym, casual walking, workout, traveling, hiking, camping, climbing, outdoor activities and daily wear.",
      "Stylish color scheme gives you a different visual experience, slip-on closure type easy put on & off. Simple style, all-match colors, can be match any clothing."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Waited a year of use before my review",
        "text": "To be honest I only bought these shoes from the way they looked (Camo) and only after watching a few viedeos on them.. the price is great.. the comfort is surprising and easy to wear. I weith right at 300 lbs and they support me just fine.. now know I also own Brooks, NB, Adidas, UA HOVR, etc... shoes as well.. are these as comfortable as they are.. No.. but they sure pack a punch bang for the buck thought.. NOW.. One huge issue.;. and again I wanted to wait and see if the soles \"scuffed up: for traction.. but no.. If there is rain.. and the water on any surface is thin.. like tile, ocncrete, wood or anything besices most asphalt.. this shoe is like your walking on thin ice.. and YOU WILL SKID! Be warned.. Good.. but Dry use ONLY",
        "verified": true,
        "helpful_votes": 14
      },
      {
        "rating": 2.0,
        "title": "Uncomfortable",
        "text": "Order larger since these run real small.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Están dura buen estilo  me gustaron mucho",
        "text": "Gracias me gusta mucho",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Oddly they're a nice shoe",
        "text": "I didn't expect much from these but, they're surprisingly comfortable. They're true to size and the color is pretty neon. The strap around the back is awkward however and I will likely cut it off so it doesn't catch on something when I'm walking. The \"just so so\" text on the shoe makes no sense... Haha it could easily have been left off... But, again... They're different and bright.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Love these shoes",
        "text": "My feet haven't felt this good in years",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "WONESION",
    "tags": [],
    "price": 45.99
  },
  {
    "id": "prod_running_shoes_006",
    "parent_asin": "B08YRNZ94T",
    "category": "Running Shoes",
    "title": "sanheng fire Deformation Parkour Shoes Four Rounds of Running Shoes Roller Skates",
    "description": "Size reference (length is foot length)  36-23 cm  37 -235 cm  38-240 cm  39-245 cm  40-255 cm  41-260 cm  42-265 cm  43-270 cm",
    "rating": 4.2,
    "review_count": 1418,
    "features": [
      "41",
      "Roller bearing capacity: 85KG. Please buy below 85KG",
      "Secure the wheels to avoid the wheels flying out during use.",
      "Lubricants can be added before use to reduce friction and make it easier to slide (you can also use cooking oil)",
      "Please choose the correct size,shoes are too small, please buy shoes with a larger size",
      "Then start your parkour!"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "I'd not buy this to wear as a shoe period",
        "text": "Its so heavy & bulky that you can probably use it as a roller shoe but not a shoe per se. I bought this for my daughter as she insisted for it but this is useless and too pricey for the purpose. There are better products available in the market.",
        "verified": true,
        "helpful_votes": 5
      },
      {
        "rating": 5.0,
        "title": "Love them",
        "text": "I’ve only taken them for a couple of “rides”, but they seem to work like they should. I put oil on the wheels as directed before first time use. Seemed easier to use the second time as the oil had time to dry. Pretty great and looks good too. I did get the wrong size tho, but somehow still fit",
        "verified": true,
        "helpful_votes": 3
      },
      {
        "rating": 4.0,
        "title": "My daughter loves them.",
        "text": "Perhaps my daughter is heavy-footed or something because, when she walks around with these things on, it's so loud. Clank clank clank clank... from the wheels hitting the ground with each step....Reason for the 4 star rating. Other than that, these are great! Seem very sturdy and they operate well. My daughter loves them. She normally wears a size 8.5/9 in women's shoes. The size 42 fits her just fine.",
        "verified": true,
        "helpful_votes": 3
      },
      {
        "rating": 3.0,
        "title": "Difficult for me to use",
        "text": "The shoes were cute! They are heavy and clunky, but they definitely looked good! The wheels are far back on the foot, so balancing is hard with the skates out, which put a lot of stress on my calves. For those worried about buying them and paying return shipping if they don't work: Amazon will cover return shipping. The seller sent me a return address and I paid $20 or so to return it to their Cali location. Amazon refunded it to me as a credit that only works on products sold/shipped by amazon (must be both!). I might be weak in the legs, so it could be different for someone else if you want to try it.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Perfect",
        "text": "Reminds me of street flyers",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "sanheng fire",
    "tags": [],
    "price": 85.0
  },
  {
    "id": "prod_running_shoes_078",
    "parent_asin": "B0BXH6QTDN",
    "category": "Running Shoes",
    "title": "adidas Women's Qt Racer 2.0 Running Shoe",
    "description": "adidas women's QT Racer 2.0 Running Shoe",
    "rating": 4.3,
    "review_count": 9590,
    "features": [
      "100% Other fibers",
      "Imported",
      "Rubber sole",
      "Shaft measures approximately 6-12 inches from arch",
      "Platform measures approximately 0-3 inches",
      "Boot opening measures approximately 0-3 inches around",
      "Everyday shoes with a modern look.",
      "Cloud foam midsole for step-in comfort and superior cushioning",
      "A holistic comfort experience from step-in to stride. Designed for an ultra-soft step with superior cushioning."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Def buy these. 🖤",
        "text": "These are so comfortable and cuuuteee!!!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "Disappointed",
        "text": "I really wanted to like these shoes. It's just completely uncomfortable.  There's no support. It feels cheap on. The side stripes are actually tighter than the rest of the shoe so it felt like my foot was being compressed. I have narrow feet and don't have the problem generally so it was very surprising to me. The heel is definitely higher thN the toe. I could feel that I was standing at an angle. I usually love adidas so I was pretty disappointed.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Good shoe",
        "text": "Well made",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Estan Excelentes me gusto mucho",
        "text": "Los Zapatos se sienten bien por el precio, una excelente compra. actualizaré esta reseña mas adelante.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Best",
        "text": "Best purchase",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "adidas",
    "tags": [],
    "price": 45.5
  },
  {
    "id": "prod_running_shoes_133",
    "parent_asin": "B082186JQY",
    "category": "Running Shoes",
    "title": "ASICS Men's Gel-Cumulus 22 Running Shoes",
    "description": "",
    "rating": 3.9,
    "review_count": 6,
    "features": [
      "Synthetic-and-mesh",
      "Made in USA or Imported",
      "Rubber sole",
      "3D Print Upper - Increases forefoot support and comfort",
      "Rearfoot and Forefoot GEL Technology Cushioning System - Attenuates shock during impact and toe-off phases, and allows movement in multiple planes as the foot transitions through the gait cycle.",
      "FlyteFoam Propel Technology - ASICS energetic foam formulation that provides supreme bounce thanks to a unique elastomer compound.",
      "FlyteFoam Midsole Technology - Our FlyteFoam technology provides exceptional bounce back and responsiveness no matter the distance, utilizing organic super fibers to help reduce packing out that traditionally happens with softer, low density foams.",
      "Guidance Line Midsole Technology - Vertical flex groove decouples the tooling along the line of progression for enhanced gait efficiency."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Good stability",
        "text": "These sneakers fit well. They gave me the support I need. Very comfortable to wear",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Snug and comfortable. True size fit.",
        "text": "I ordered and they fit so well that I ordered two more pair in different colors.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "None",
        "text": "I liked the color combo... plus I already have a pair",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Good looking shoe that feels great",
        "text": "This shoe looks great and it feels even better for running, walking or just to go somewhere.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Just the show I was looking for",
        "text": "Asics is my go-to shoe for exercise and everyday wear, these were no exception and completely fit the bill.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "ASICS",
    "tags": [],
    "price": 119.9
  },
  {
    "id": "prod_running_shoes_132",
    "parent_asin": "B08DNJC18T",
    "category": "Running Shoes",
    "title": "Damyuan Men's Sport Gym Running Shoes Walking Shoes Casual Lace Up Lightweight",
    "description": "",
    "rating": 4.0,
    "review_count": 4300,
    "features": [
      "import",
      "Ethylene Vinyl Acetate sole",
      "Mens running shoes SOLE:Rubber sole is durable and flexible, it can free bending with you for increased comfort",
      "Breathable mesh upper：Lightweight support and breathable that make your foot always keeps dry and cool.",
      "Non-slip: The rubber outsole offers impact cushioning, anti-twist, abrasion-resistant and anti-slip performance",
      "Light and Breathable:The ultra lightweight knitted upper and breathable mesh sport shoes, make feet more healthy, not smelly, not stuffy, very refreshing.",
      "Occacion：suitable for daily, walking, running, indoor, sports, outdoor, travel, exercise, workout, vacation"
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "Not recommended for you name brand sneaker wearers",
        "text": "Extremely light weight(mesh material)....Bought them thinking it wud be where I wudnt hve to tie the laces( but I did)....I wore them out about 3hrs to do some community service with that said... they were actually comfortable.... I wear sz 8 in ladies so a 6.5 is what I selected in this male shoe",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Love love them",
        "text": "They fit like a glove. Two days and my feet is in love.  I can't wait til I go for my run in them. Nicely made as well.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "It's cheap for a reason",
        "text": "Not well constructed, zero support, cheaply made and cannot be used for any athletic activity. It's a for show and I'll be luckly if it  lasts 4 months as it's already wearing out.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Quality and Comfortable Shoe for All Activities",
        "text": "This shoe is very comfortable to walk long distances. If you're on your feet a lot I highly recommend this shoe. It provides good comfort and support. You can use this shoe for any daily activity.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Good indoor shoe",
        "text": "Good indoor shoe but may not last long walking on street or pavement. Shoe does not open up like a lace up shoe.  Shoe looks good on just hope the inner sole holds up and remains comfortable.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Damyuan",
    "tags": [],
    "price": 29.99
  },
  {
    "id": "prod_running_shoes_090",
    "parent_asin": "B075V2N9RV",
    "category": "Running Shoes",
    "title": "Hawkwell Boys Girls Breathable Lightweight Running Shoes(Toddler/Little Kid/Big Kid)",
    "description": "",
    "rating": 4.4,
    "review_count": 2268,
    "features": [
      "Fabric upper",
      "Ethylene Vinyl Acetate sole",
      "Phylon outsole with lightweight",
      "Mesh lining, breathable and comfort.",
      "Design for perfect fit and comfort,soft and speed",
      "Two ways wear,slip on and lace up.",
      "Fitting update: we've updated Camouflage type to normal size, please measure your foot length and choose the correct size according to our size chart."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Coolest shoes for a great price. My son got lots of compliments",
        "text": "Coolest shoes for a great price. My son got lots of compliments. He is 2 and a true size 8, and I ordered a 9 and his toes are at the end. So they fit perfect now but not for long, so order a size up or 2!",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Perfect!",
        "text": "Brought these as summer shoes for my son. The design is exactly the same as the photo; durable and stylish sneaker.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Nice shoes for reasonable price",
        "text": "Cute and ultra light. They look like lace shoes but are actually slip in which is a bonus for a 4 year old. He just loved opening these shoes when they came and put them right on!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "good",
        "text": "like",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "The part that the laces threads through broke",
        "text": "The part that the laces threads through broke, it's like a rubber type of material and once the little holes break the laces can't stay and you can't tie your shoes. Sucks to waste money for something he used for a few weeks",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Hawkwell",
    "tags": [],
    "price": 25.99
  },
  {
    "id": "prod_running_shoes_017",
    "parent_asin": "B00TOM2VUC",
    "category": "Running Shoes",
    "title": "Forget The Glass Slippers This Princess Wears Running Shoes 6\" Vinyl Sticker DecalI90 Runner Running Exercise Cross Fitness Gym Weightlifting Jogger Color Run 5k Car Wall",
    "description": "",
    "rating": 5.0,
    "review_count": 2,
    "features": [],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "Easy to apply. Looks great.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "DesignsThatStick",
    "tags": [],
    "price": 3.99
  },
  {
    "id": "prod_running_shoes_026",
    "parent_asin": "B09TB97VKV",
    "category": "Running Shoes",
    "title": "1/4 Inch Track Spikes, 110pcs Stainless Steel Pyramid Shoe Spikes with Spike Wrench for Track and Cross Country,Replacement Spikes for Sprint Sports Short Running Shoes",
    "description": "",
    "rating": 4.7,
    "review_count": 65,
    "features": [
      "Improve Running Speed and Safety: Running or sports enthusiast, you must not miss this Track Spikes! This pyramid spikes will add the friction between the shoe sole and ground, thus can resist skid and improve your running speed.",
      "Quality Spikes for Track Shoes : Made of quality stainless steel, which is very sturdy, rust-resist and anti-corrode. Pyramid needle design, not damage track. Providing long servicing life.These spikes are suitable for all athletic tracks, and field or cross country surfaces,help you get better grades.",
      "Small Spikes Size : Perfect size 1/4\"extra track spikes, full length is 0.5”(12.8mm), pyramid needle design, spike wrench size 2\"*1.8\". Easy to match with most of the track shoes, bring you superior traction, strength and durability",
      "Widely Usage : The spikes provide optimal grip for track and field or dry terrain in cross-country, ideal for track sprints, long jump, running, outdoor sports activities",
      "Enough Quantity Spikes : Package include 110 pieces pyramid track spikes with 1 pieces spike wrench and 1 pieces transparent storage box, easy to carry and convenient for you to replace your shoe spikes. There are enough quantity for your daily use."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Track star musts!",
        "text": "Go fast or go home! 😁",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "LucaSng",
    "tags": [],
    "price": 11.99
  },
  {
    "id": "prod_running_shoes_121",
    "parent_asin": "B088DZBSR2",
    "category": "Running Shoes",
    "title": "New Balance Kids' 680 V6 Hook and Loop Running Shoe",
    "description": "The New Balance 680 v6 kids' running shoe is a sneaker that blends style and performance to satisfy both kids and adults alike. A modern design ups your little one's cool factor, featuring a no-sew construction for a sleek fit and feel that's snug and secure without being too tight, delivering both a comfortable fit and contemporary style. The streamlined silhouette on these running shoes for kids includes leather and mesh upper material with a stitched-down tip and foxing details for flexible support and lasting durability. These kids' performance shoes also include an ABZORB midsole that absorbs impact through a combination of cushioning and compression resistance, for a cushioned ride that takes kiddos from the classroom to the playground and everywhere in between. These comfortable kids' running shoes are available in a variety of colors that range from neutral to bold and bright, so your child can pick the one that suits their style and boosts their confidence.",
    "rating": 4.4,
    "review_count": 8364,
    "features": [
      "Rubber sole",
      "Power in Simplicity: The New Balance 680v6 running shoe for kids features a minimal leather and open mesh upper, offering flexible support and easy-breezy comfort",
      "Modern Construction for an Outstanding Fit: The leather/mesh upper on these New Balance kids' running shoes features a stitched-down tip and foxing details to provide flexible support and durability",
      "Soft Underfoot Cushioning: The ABZORB midsole absorbs impact through a combination of cushioning and compression resistance, giving these kids' running shoes a comfortable feel that lasts all day",
      "Designed for Support and Durability: These kids' performance shoes feature a strong rubber outsole to offer long-lasting durability, built to stand up to daily use and playground wear-and-tear",
      "Available in a Range of Colors: From neutral tones to bold hues, these cushioned running shoes for kids are available in a range of shades to suit the style and color preferences of your little one"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great for wide feet!",
        "text": "My son has bilateral clubbed feet, and he no longer wears braces but has a wide foot. New balance is the only brand that works for him. This particular model is perfect for him!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "The best for extra wide feet",
        "text": "These shoes are perfect for my special needs child. He has extra wide feet and he has trouble with shoe tying.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Reviews are right about the quality",
        "text": "Wish I read the reviews more carefully. I’m so desperate to find shoes that fits my boys’ wide feet that I just assumed NB would be good because I’ve gotten them in the past. But no the quality is sub par. They are already falling apart and it’s only been 1.5 months. I’ll probably have to buy them new shoes soon which is a shame because it’s not like these are some off brand cheapies. You expect more from a company like NB.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "5 stars",
        "text": "These New Balance shoes are great. The insoles are so comfortable and I know that my little one is getting the protection that she needs for her growing feet. The shoes fit true to size, and they width is great. She has a normal foot, I wouldn't recommend them for a child with wide feet. They are comfortable to wear and look great. This particular style is great for young children due to the velcro. Most kids by the time they get to this style shoe CAN tie their own shoes, but its so much easier and quicker for them just to  be able to do the velcro and go!We love them.",
        "verified": false,
        "helpful_votes": 1
      },
      {
        "rating": 3.0,
        "title": "Maybe I just got a defective pair of shoes...",
        "text": "The insoles don’t fit the shoes, nor were they glued in. So they kept sliding out. Nice looking shoe from a distance but they are falling apart.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "New Balance",
    "tags": [],
    "price": 35.49
  }
]