[
  {
    "id": "prod_gaming_mice_056",
    "parent_asin": "B082V8GC6T",
    "category": "Gaming Mice",
    "title": "TECKNET Bluetooth Wireless Mouse, 3 Modes Bluetooth 5.0 & 3.0 Mouse 2.4G Wireless Portable Optical Mouse with USB Nano Receiver, 2400 DPI for Laptop, MacBook, PC, Windows, Android, OS System (Blue)",
    "description": "",
    "rating": 4.5,
    "review_count": 4311,
    "features": [
      "Enable High-Efficiency Multiple Working Modes: 3 modes Mouse(BT5.0 & BT3.0 + 2.4GHz), this Bluetooth wireless mouse realizes free switches between 2 devices in a mouse only one Switch. Simple & convenient to work from the desktop to the tablet, or laptop to Macbook, ect.",
      "True 3 in 1 Wireless Mouse : Bluetooth mode works with Windows/ Android/ MAC OS system. Easy to pair and connect. but for BT5.0 & BT3.0 System just according to the Bluetooth version of your device, Please check and connect the correct system when using the mouse; 2.4GHz mode works with laptop, desktop or any devices with USB port, simply plug in the USB receiver, plug and play.",
      "3 Adjustable DPI Levels: 1000/1600/2400 to meet different needs, comes with a Nano receiver (stored in the back of the mouse). No need any driver, and you can plug and play the wireless mouse directly, and advanced TeckNet Tru-Wave optical tracking technology ensures precise tracking on any surface.",
      "Comfortable & Durable Design: Ergonomic design with elegant profile, this wireless bluetooth mouse is perfect to fit your hands, providing a comfortable using experience. Tested over 10 million times click lifespan ensure long-term stable use.",
      "Hassle-free Design: Up to 18-months battery life with a battery level indicator. Smart auto-sleep mode saves power (battery life may vary based on user and computing conditions); Compatible with Windows XP/Vista/11/10/8/7 and Mac OS X / Linux / Android (batteries are NOT included)"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "NO GOOD DO NOT BUY",
        "text": "Would not connect for me.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "For the price this is a good product!",
        "text": "A little larger than what I am use too. Automatic turn off. A small button to turn back on. So far so good it works great",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Bluetooth frees up an extra port",
        "text": "Works great with new laptop and saves me a usb port by not having to use a usb connector",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Comfortable to use as my everyday mouse.",
        "text": "I bought this Tecknet dual mode Bluetooth and 2.4 G mouse to replace a similar design 2.4 G only model. Although it works well after the Bluetooth connects, it can sometimes take a minute or so to connect with my Asus C302C Chromebook; other times it connects immediately. I don't really understand why. I think 4-1/2 stars is the right rating for this one. The connection issue is mildly irritating, but not a showstopper. I do recommend this mouse.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Awesome wireless mouse!",
        "text": "Bought this for my son’s new Mack book. Connected easily & works well. Highly recommend.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "TECKNET",
    "tags": [],
    "price": 16.99,
    "position": 1,
    "page": 1
  },
  {
    "id": "prod_gaming_mice_092",
    "parent_asin": "B07R7LMHDL",
    "category": "Gaming Mice",
    "title": "Slim Wireless Mouse, ZCOONE Computer Mouse 2.4G Silent Click Cordless Optical Mice with USB Receiver for Laptop, MacBook, Desktop, PC, Notebook- White and Pink",
    "description": "",
    "rating": 4.3,
    "review_count": 1657,
    "features": [
      "【Noiseless Click】- This wireless computer mouse makes quiet and silent clicks, you can concentrate on working without disturbing others beside you. (USB receiver is stored under the back of mouse)",
      "【Slim and Portable】- This slim wireless mouse features ultra thin size (4.41*2.36*0.98inch), much thinner than ordinary laptop mice. Portable for travel, It can be easily put into your backpack or pocket.",
      "【Streamline & Ergonomic Design】-This wireless ergonomic mouse has a smooth streamline design, which offers your hand comfortable fit. The sturdy anti-slip rubber scroll wheel ensures that your finger will not slip when scrolling.",
      "【Long Lifespan】-It will enter sleep mode after 10 minutes of no-operation. Press any button to wake it up. Note: powered by 1*AA battery(not included) .",
      "【Stable Transmission and Strong Compatibility】- 2.4Ghz wireless transmission allows working distance of up to 32.8ft/10m. This usb wireless mouse is Well compatible with Computer, Laptop, Macbook, Chrome book, PC, Desktop, Tablet,etc."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Small quiet and smooth",
        "text": "My first one I had issues with not working correctly, but a new one was sent out quickly and it works perfect. Thin so great for small hands and the click is silent. Very happy with the mouse.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "GREAT mouse!",
        "text": "I love this mouth!  It works perfectly with my laptop and is super comfortable to use.  Battery life is great, sleep mode is awesome - is super responsive and CUTE!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Slim Wireless Mouse",
        "text": "Love the quietness of this mouse only complaint is it lags sometimes which can be annoying at times.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Just what I wanted",
        "text": "I like to use a ‘mouse’ when I use my computer; this is just what I was looking for, right size and price.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Very nice mouse!",
        "text": "This mouse fits very comfortably in my hand. To get it out of sleep mode, you just click the scrolling button. I got the pink one, and I love how streamlined it looks.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "ZCOONE",
    "tags": [],
    "price": 5.89,
    "position": 2,
    "page": 1
  },
  {
    "id": "prod_gaming_mice_145",
    "parent_asin": "B08GM5ZLRP",
    "category": "Gaming Mice",
    "title": "LED Wireless Mouse, Wireless Mouse for Desktop Computerr,Wireless Mouse for MacBook pro/air/pc/Laptop,,2.4G Portable USB Optical Wireless Computer Mice with USB Receiver and Type C Adapter (Black)",
    "description": "7 Colorful LED breathing light change alternately, soothing light lights up the mouse in dark, adds more fun to the life. Note: It can't be set to one specific color. How to use it? * Charge the mouse for about 2 hours before using it for the first time. 1. Take the dongle out, which is stored at the bottom of the mouse. 2. Insert the dongle into the USB port of your device, and open the mouse switch (at the bottom of the mouse). 3. Allow a few seconds for installing, no action needed, just wait. Then you can use it. Note: If your computer is Type-C port, please insert the USB-C to USB receiver into the Type-c port of the device first, then insert the USB receiver into the USB-C to USB receiver. Turn on the power switch and the mouse will work. Tips: The mouse cursor will move slowly or stop moving when the mouse is low battery. Please charge it on time. The blue light beside the scroll wheel will be on while charging, and then goes off when the mouse is fully charged.",
    "rating": 4.4,
    "review_count": 319,
    "features": [
      "2020 Latest Upgrade LED Design】The upgraded version mouse with the LED lights adds more fun to the boring office life. The bottom of the mouse has a switch, you can switch lights freely. Low-key or sparkle, switch in one second, suitable for any occasion.",
      "【Plug and Play】No need to install any driver, just plug the USB receiver into your laptop will the mouse start to serve. 2.4GHz wireless technology provides powerful and reliable connection, effective up to 10 meters of range. Advanced optical tracking technology with fast click and responsiveness. 3-Level adjustable DPI (800/1200/1600 DPI), freely to satisfy daily work. Equipped with USB-C to USB adapter, let you worry-free use of any device.",
      "Mute Click & Comfortable Hand-feeling】Silent click Mouse with classic design with anti-fingerprint finish offers your hand maximum support and comfort. Silent button reduces 90% noises, which makes it an ideal wireless mouse for office, conference room, cafe, library, bedroom, help you concentrate on your work, study without disturbing others besides you. Ultra-thin, ergonomic design, lightweight and convenient for carrying or traveling.",
      "Rechargeable Optical Mouse】Built-in durable rechargeable battery, it can be easily charged using the included USB cable without replacing the battery. Just 2 hours charging, you can use it about 7-15 days. Standby time is very long, energy-saving features, automatic sleep mode and wake-up mode are installed to save energy. Turn off the mouse LED light when not in use to save power.",
      "Wide Compatibility】Well compatible with Windows XP, Vista, 7, 8, and 10 / Windows Vista / Windows Vista/ Windows ME etc, Fits for desktop, laptop, PC, Macbook and other devices. Please Note: If your laptop just with type-c port, You need connect the supplied USB-C to USB adapter to your laptop and plug the USB receiver in to it."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Works great",
        "text": "That it can be charged.. no batteries",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 3.0,
        "title": "Ok for office work",
        "text": "Only good for office use and nothing else it wares out though",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "N/A",
        "text": "I love the mouse,  it works excellent for my small hands",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Qullqian",
    "tags": [
      "Sponsored"
    ],
    "price": 11.89,
    "position": 3,
    "page": 1
  },
  {
    "id": "prod_gaming_mice_012",
    "parent_asin": "B08JY7HCMH",
    "category": "Gaming Mice",
    "title": "2 Sets of Hyperslides Rounded Curved Edges Mouse Feet, Mouse Skates, Pads for Logitech G Pro, Logitech G102, G203 Gaming Mouse Feet Replacement (0.8mm, Smooth Glide, Pure PTFE) Pro Performance Upgrade",
    "description": "",
    "rating": 4.3,
    "review_count": 81,
    "features": [
      "✔️ [High Quality] Replacement mouse feet that increases your control and accuracy by providing the smoothest and most consistent slide",
      "✔️ [Buttery Smooth] Having a smoother slide helps reduce grip tension which improves accuracy and decreases wrist strain for longer and more enjoyable gaming or work sessions",
      "✔️ [Exclusionary Tech] Our exclusive technology produces rounded edges for a scratch-free slide right out of the package; no break-in period required",
      "✔️ [Meticulous Design] Specially calibrated 0.80 mm thickness: Provides the ideal feet height that eliminates \"bottom-scraping\" & provides longer life-span",
      "✔️ [Longevity] We include 2 sets made of 100% virgin grade PTFE material for the lowest friction and eco-friendly, 3M no-residue adhesive"
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "Misleading brand Name  NOT HyperGlides",
        "text": "OBVIOUSLY trying to confuse the consumer, these are a rip off!!!<br />There thin too",
        "verified": true,
        "helpful_votes": 3
      }
    ],
    "store": "HYPERSLIDES",
    "tags": [],
    "price": 10.99,
    "position": 4,
    "page": 1
  },
  {
    "id": "prod_gaming_mice_023",
    "parent_asin": "B004DEYT6A",
    "category": "Gaming Mice",
    "title": "Logitech M305 Gold Tendrils Wireless Mouse",
    "description": "This wireless mouse features 1000 dpi optical technology for responsive cursor control and 2.4GHz wireless technology for a reliable connection.",
    "rating": 4.3,
    "review_count": 9,
    "features": [],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Nice design",
        "text": "I use this with my netbook to control it across the room. It is smaller than most other mouse. It goes easily in my travel bag. Nice design. I got tired of plain black.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "One of the best everyday mice I've used",
        "text": "I have input devices for drawing on my tablet, and I have a gaming mouse, but the Logitech M305 is an excellent mouse for every day use, so it's the one I use the most.<br /><br />The mouse itself has very basic features,<br />* scroll wheel (mild clicking feedback)with side-click options<br />* battery status light (green when fully charged, red when almost out)<br />* two buttons<br />* an off switch<br />* a nano USB transmitter than stores inside the mouse<br />* uses a single AA battery<br /><br />It does come in jazzy designs, and I liked the yellow/gold one the best. The one thing I might have wanted to change on this mouse is the on/off switch. The best nano-USB mouse I've ever had would automatically turn off when you stored the transmitter inside. With this one, be sure to flip the switch to off as well before you put it in your bag, or it will be down there draining the battery as it moves around.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Logitech",
    "tags": [],
    "price": 99.99,
    "position": 5,
    "page": 1
  },
  {
    "id": "prod_gaming_mice_166",
    "parent_asin": "B09SPBB987",
    "category": "Gaming Mice",
    "title": "LeadsaiL Wireless Mouse for Laptop 2.4G Silent Cordless USB Mouse Slim Wireless Optical Computer Mouse, 3 Buttons, AA Battery Used,1600 DPI for Windows 10/8/7/Mac/Macbook Pro/Air/HP/Dell/Lenovo/Acer",
    "description": "",
    "rating": 4.6,
    "review_count": 970,
    "features": [
      "【Silent Click Noiseless Mouse】Would you like to do your job without missing a sound or disturbing your environment? Choose LeadsaiL quiet mice; you will enjoy the same click feeling with over 90% less click noise.",
      "【High Precision LED Mouse】Would like to take full control of your every aim with perfect tracking? Choose LeadsaiL optical LED wireless mouse. Featuring a 1600 DPI, the laser-grade engine ensures smooth cursor control and precision tracking on virtually any surface.",
      "【Plug and Play Travel Mouse】Plug and go ready along with the Nano Receiver stored in the battery compartment, LeadsaiL USB wireless travel mouse works with Windows, Mac, Chrome OS or Linux-based computers of Notebook, PC, Laptop, Computer, Macbook.",
      "【Portable Slim Mini Mouse】The slim mini mouse adopts shapely, domed design for giving your palm plenty of support and seamlessly fits in your hand, so you can work or play comfortably for long hours.",
      "【Energy Saving Mobile Mouse】LeadsaiL mobile mouse keeps going with months battery life of power on a single AA battery(Not included in the package). Automatic sleep mode and an On/Off switch save power, (Battery life may vary based on use and computing conditions.)"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Reliable Mouse",
        "text": "Solid purchase.  Less $ than the competitors, and this one works perfectly.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Great small mouse",
        "text": "nice",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "works great so far",
        "text": "great so far no clicking",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Perfect Standard Mouse",
        "text": "This LeadsaiL 2.4G Wireless Mouse works great.  My girlfriend dropped her mouse and needed a replacement quickly - this was perfect.  It takes 1 AA battery and connected right to her laptop.  It is a standard wireless laptop mouse - works great!",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Leadsail is my brand",
        "text": "Leadsail is my go to brand for quality computer mice.  This is the fifth one I have gotten and they all work flawlessly.  This one is slightly more compact in design but their trademark always is an ergonomically satisfying fit in the hand.  I am left handed but use my right hand for the mouse.  I have rather large hands and this mouse is perfect to grip and maneuver.  It also is indeed silent which is not really an issue for me.  What I look for is design, function and durability and you get that with all Leadsail products.  Recommend.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "LeadsaiL",
    "tags": [],
    "price": 7.99,
    "position": 6,
    "page": 1
  },
  {
    "id": "prod_gaming_mice_127",
    "parent_asin": "B08M65W3PT",
    "category": "Gaming Mice",
    "title": "seenda Wireless Mouse, Rechargeable Light Up Mouse for Laptop, Small Cordless Mice with Quiet Click LED Rainbow Lights for PC Computer Kids Chromebook Windows Mac,Hot Pink",
    "description": "",
    "rating": 4.6,
    "review_count": 15931,
    "features": [
      "【Light Up Rainbow Mouse】If you are tired of the normal mouse, our wireless rainbow mouse can be a choice for you. It is super cool with 15 different led rainbow lights, and you can easily switch between led colors by pressing the bottom button. It's also a perfect gift for kids, girls,boys, students or left and right hand users",
      "【Universal Compatibility】This wireless mouse works with Computer PC Notebook Laptop tablet with USB port, running on Windows XP, Windows Vista, Windows 7, 8,10,11, Mac OS X 10.4 , Chromebook, PS4, PS5,Xbox and more【Notice: If your laptop only have a Type C port, you will need a USB to Type C adaptor to connect it】",
      "【Type C Recharging & Independent ON/OFF Switch】This seenda wireless mouse uses 650mAh rechargeable battery and a single charge would last for a whole week. While the intelligent auto sleep function and on/off switch help you go further between charges",
      "【Ultra Quiet Click】We know your demands of a quiet mouse, so we have reduced the clicking and scrolling noise to up to 90% while you enjoy the same click feel. Perfect for working at home, library, students dormitory,office or even traveling. Thanks to the great ergonomic design, this mouse fits comfortably in your hand, prevent any possible wrist pain",
      "【Driver-Free &3 Adjustable DPI】Comes with a small USB nano receiver(stored in the back of mouse), just plug it into your computer and you are ready to go. 3 Adjustable DPI levels (800/1200/1600) ,set your own cursor speed"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great mouse!",
        "text": "Finally a mouse that doesn't use a battery. I wasn't paying attention so it just died, but it still works while plugged into your USB. It has a great hand feel, and easy to use. I'm really happy with this.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "nice",
        "text": "n/a",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "They buy good reviews, don't trust them. GARBAGE quality product banking on dishonesty.",
        "text": "The lights don't work well or turn off anymore after a few months when I was using a different mouse due to how often this one needed to be charged. It also CANNOT be used while being charged, so don't count on being able to actually use this often. Horrible purchase, cannot advise against them enough.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Perfect",
        "text": "[[VIDEOID:17a6e9e24e8e6f5bc981e3994746809]] Love this mouse! Feels great in my hand.  Easy to use. Charges really fast. You can barely hear the clicks which is a plus.<br /><br />10/10 would buy again.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Works really well so far",
        "text": "My old mouse broke so I ordered something new that I have never tried. Set up was very easy. Just plug in the little USB port wireless device that is included and the mouse already seemed to be at least partially charged so away I went immediately without issue. It comes with some very nice colors that are changeable with a push button on the bottom. I like the moving multiple colors myself. Very nice unit for the price.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "seenda",
    "tags": [
      "Sponsored"
    ],
    "price": 14.99,
    "position": 7,
    "page": 1
  },
  {
    "id": "prod_gaming_mice_042",
    "parent_asin": "B09RZHD8Q8",
    "category": "Gaming Mice",
    "title": "CC Store LED Wireless Mouse, Bluetooth Mouse &2.4GHz Instant Connection,Rechargeable Ultra Silent Slim,3 DPI 2 Connection Modes with USB-C to USB Adapter for Laptop/MacBook/PC/Tablet/iPad (Black-red)",
    "description": "",
    "rating": 4.4,
    "review_count": 1008,
    "features": [
      "【DUAL MODE】BT5.1+2.4GHz:The bottom of the mouse has a switch,you can control the free switching between the two devices.Advanced optical tracking technology with fast click and responsiveness. 3-Level adjustable DPI (1000/1200/1600 DPI), freely to satisfy daily work. Equipped with USB-C to USB adapter, let you worry-free use of any device.",
      "【Rechargeable Mouse】Built-in durable 500mAh rechargeable battery, no need to replace the battery. It can be easily charged with the included micro USB cable, charging for 2~3 hours, continuous use for about 1 week, and standby time for more than 30 days. It will fall asleep after 10 minutes no-operation to save power and provides long term usage. You can wake it up by clicking any button.",
      "【Mute Click&Durability】 We know your needs for a quiet mouse, so we have adopted a silent button, specially designed for use in quiet places such as offices, meeting rooms, coffee shops, libraries, and bedrooms. At the same time, the ergonomic shape also allows you to reduce wrist pain during long hours of work. This silent mouse has been tested over 5 million keystroke life, ensuring responsive clicks and longer lifespan for daily use.",
      "【No need to install any driver】2.4GHz mode:Plug and Play,just plug the USB receiver into your laptop will the mouse start to serve. 2.4GHz wireless technology provides powerful and reliable connection, effective up to 10 meters of range. Bluetooth mode: Compatible with more than 99.8% Bluetooth devices.This bluetooth mouse is suitable for all laptops with bluetooth function or iPad/iPhone above iOS13.",
      "【Universal Compatibility】Well compatible with Windows XP, Vista, 7, 8,and 10/ Windows Vista etc, Fits for desktop, laptop, PC, Macbook and other devices. （Bluetooth）Compatible with iPad/iPhone(iOS 13 and later version),Windows 8/10,Mac OS 10.10/Android 5.0 or above system."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Works as well as my husbands Aerox gaming mouse",
        "text": "Great little mouse. Surprisingly it works as well as my husband’s $150 gaming mouse 😂",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Love it",
        "text": "It works perfectly with my laptop. The C type adapter is a lifesaver and works perfectly",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Works as advertised",
        "text": "This is a wireless mouse and it works as expected.  Used it for my granddaughter's laptop, and she is very happy with it.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Nice mouse",
        "text": "I really like this mouse. However, I can't keep it because it is a 4.0 BT and my computer has 3.0 BT. the BT works well on my work computer but i bought the mouse for my personal computer. I had to return it. I really wish it would have worked on my personal computer.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Slick and Easy to Install",
        "text": "I really like this wireless mouse. It was super easy to hook up and works really well. I'm just using it for work so can't say how responsive it is for gaming. I like the feel of the mouse too, it's very slick and fits my hand comfortably.",
        "verified": false,
        "helpful_votes": 2
      }
    ],
    "store": "CC",
    "tags": [],
    "price": 12.99,
    "position": 8,
    "page": 1
  },
  {
    "id": "prod_gaming_mice_077",
    "parent_asin": "B0BFF6PFHC",
    "category": "Gaming Mice",
    "title": "seenda Wireless Bluetooth Mouse - Rechargeable Wireless Mouse Multi-Purpose (BT 4.0+USB+Type C 3-Way Connection) PC Mice Compatible with iPad iPhone Mac OS Android Windows - Blue",
    "description": "",
    "rating": 4.5,
    "review_count": 594,
    "features": [
      "TRIPLE CONNECTION MOUSE FOR MULTI-PURPOSE -- A versatile wireless mouse can connect up to 3 computers via Bluetooth 4.0, USB Receiver and Type C Receiver. No lags at all and could switch easily by a single “click” between the different inputs",
      "RECHARGEABLE MOUSE WITH LONG BATTERY LIFE -- This Mouse has a built-in rechargeable battery which means you can use it without running the risk of not have a couple of batteries at hand. Comes with USB and Type C cables for charging",
      "BLUETOOTH MOUSE WITH UNIERSAL COMPATIBILITY -- Universal compatible with Windows(Win 8,Win 10 or above), Mac OS(Mac OS X 10.10 or above), Android (Android 4.3 or above)devices. For iPad/iPhone, please turn on the \"Assistive Touch\" before Bluetooth connection: Setting-Accessibility-Assistive Touch",
      "TRAVEL MOUSE WITH QUIET & RESPONSIVE CLICK -- Compact size of 4.5*2.5*1.3inch, the multi-connection option and rechargeable features make this mouse perfect for travel, you can enjoy a comfortable mouse instead of putting up with your laptop trackpads",
      "18 MONTH MONEY BACK OR REPLACEMENTS -- A 18-Month risk-free warranty comes with this mouse, you will get a free replacement or money back for your order if any issues while using it. Just remember that we stands behind all of our products"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Cheap and useless.",
        "text": "This mouse feels so cheap, it wasn’t even worth giving a review but I wanted to warn others to not get this mouse. It’s so flimsy and made so cheaply, I didn’t waste anymore time with it so I am returning.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Flawless Bluetooth connectivity with Mac",
        "text": "My Logitech M310 (been using them for 10-15 years) could not connect properly with my USB-C/Thunderbolt MacBookPro, using their USB dongle, thru a USB adapter. Scroll wheel would NOT work, and Logitech tech support said they would not update drivers. 'Don't use an adapter.' But they aren't aware that new Macs don't have old-school USB ports? Anyone else have this problem?! Anyway... this Seenda connects directly with Bluetooth, and connects instantly. If it sleeps (after a few hours?) it wakes and re-connects with one click, in less than a second. I charged the battery when I bought it a few weeks ago, and forgot that I might need to charge it again one day. Still going. Downsides: it is much smaller and lighter than I am used to (the M310 is easily twice as thick/tall) so I am getting used to that. Took awhile to find the right DPI/resolution/speed (and the button to change that is in a precarious, easy-to-hit-by-mistake position. Overall a great recommend.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "squeaks when scrolling - not for small hands",
        "text": "Loud clicks, SQUEAKS when scrolling, made for larger hands. You would think since it's pink it wouldn't be designed for a mans hands but here we are. Ultimately, the obnoxious squeaking while scrolling is why I am returning it.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Works great but... The wheel squeaks!",
        "text": "This mouse works great but the wheel squeaks!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "good",
        "text": "It's good okay.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "seenda",
    "tags": [
      "Sponsored"
    ],
    "price": 29.96,
    "position": 9,
    "page": 1
  },
  {
    "id": "prod_gaming_mice_165",
    "parent_asin": "B0C2CSY9FN",
    "category": "Gaming Mice",
    "title": "Wired Pink Keyboard and Mouse Combo, RaceGT 102 Keys Wired Typewriter Keyboard Phone-Groove Design, 2.4G Silent Comfortable Wireless Mouse, Compatible with Computer, Laptop and Desktop",
    "description": "",
    "rating": 4.5,
    "review_count": 325,
    "features": [
      "【 Wired keyboard For Phone -groove design】The wired keyboard is designed with a mobile phone-groove, suitable for placing smart phones, iPads and other devices. You can put it horizontally or vertically according to the size of your device, which is very convenient for you to watch videos, reading document and other entertainment at office or home.",
      "【Multimed Knob Function】Humanized multimedia design, convenient and fast multimedia switching and fast music adjustment. Four buttons to control music in time, convenient and fast.",
      "【Punk Keycaps and Splash-Proof Design】ABS injection molded keycaps, stable structure, non-toxic and odorless. Light matte surface treatment technology, care for your fingertips. The panel is provided with a waterproof conductive film, and the key caps are suspended to facilitate water to flow out from the side.",
      "【Silent wireless mouse and wired keyboard】 The new punk keycaps and mouse buttons are designed to be silent, the keyboard is comfortable and quiet for typing, and the mouse is super silent, creating an excellent office environment for you, allowing you to focus on your work and avoid disturbing others. wireless mouse is powered by 1 AA battery (batteries are not included).",
      "【Universal Compatibility & Great Service】 This mouse and keyboard is compatible with all Windows system versions, Linux, Chrome OS, Mac OS, suitable for desktop, PC, laptop, computer, Chromebook. Professional customer service is on standby for 24 hours and promises to give you a satisfactory solution."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "ASMR fantastic!",
        "text": "[[VIDEOID:5a9baeffb5013de01b566ac34f1da8a5]] Love the way this keyboard sounds as I type.  I also like that the round keys allow a little more room in between keys and that I don’t make as many errors while typing.  The color is great and the design is think and sleek.",
        "verified": false,
        "helpful_votes": 4
      },
      {
        "rating": 5.0,
        "title": "my favorite keyboard",
        "text": "This keyboard is the best! It is comfortable to use, matches my desk setup perfectly, and best of all, the keys AND the mouse are basically totally silent! My 10-month-old is a VERY light sleeper! Everything wakes her up, but not these. A major win for me! Highly recommend. 100% I would buy this again! (batteries are not included. You need one aa battery for the keyboard and also the mouse)",
        "verified": false,
        "helpful_votes": 1
      },
      {
        "rating": 4.0,
        "title": "Wired + Wireless?  Work for you? Good multimedia controls & phone slot",
        "text": "Not a fan of wireless accessories (the batteries typically fail without warning, makers want you to be surprised), I made an exception for this pairing model because the keyboard is wired.<br /><br />PRO<br />-Ubiquitous AA battery for mouse<br />-Economical<br />-Numeric pad<br />-Multimedia buttons: Volume knob, buttons for mute, pause, previous, next<br />-A place to put your phone (nice touch!)<br /><br />CON<br />-Neither is backlit<br />-KB not programmable<br /><br />NEUTRAL<br />-Non-'clack-y' key design,  these are \"quiet\"<br />-Some humans will like pink, not widely available, maybe a good gift<br />-Con (for me) is the wireless mouse",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Fun cordless mouse and keyboard",
        "text": "This is a great little retro cordless keyboard and mouse combo. I ordered it because it has just one dongle that both operate from. That gives me more USB ports available for other things. It works great as long as the keyboard and mouse are close to the laptop or the tower. It lags a bit when it’s in a keyboard drawer. I like the compact and portable nature this setup includes!",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "pink keyboard and wireless mouse",
        "text": "Love the pink color of this retro keyboard and mouse.  Great that the keyboard is spill proof I can have my coffee and not worry about wrecking my keyboard.  Easily plugged right into my all-in-one computer.  Took me a little while to get used to the punk keycaps, and now I love how quiet and comfortable they are to use.  The mouse fits well in my hand, and the wheel rolls back and forth smoothly. Top 5 stars for this one!",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "RaceGT",
    "tags": [],
    "price": 24.99,
    "position": 10,
    "page": 1
  },
  {
    "id": "prod_gaming_mice_065",
    "parent_asin": "B01M00X4TF",
    "category": "Gaming Mice",
    "title": "KOOLmouse [ Optical 2.4G Wireless Mouse [ Cold Llama - Funny ]",
    "description": "Optical 2.4 G wireless Mouse",
    "rating": 3.6,
    "review_count": 20,
    "features": [
      "Wireless curved mouse connects via USB receiver",
      "For all laptop and desktop support USB 2.0",
      "Slim ergonomic mouse is perfect for home and office use",
      "Optical tracking technology mouse works on many different surfaces",
      "Nano Receiver"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "so cute",
        "text": "my granddaughter loved it",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great Battery Life, Comfortable hold for a slim-line mouse, Llama is AWESOME!",
        "text": "I'm not crazy about the aerodynamic mice, but I bought one because of the Llama.  It is VERY slim, but more comfortable than I imagined it would be to hold.  The Llama image is on the mouse solidly, it won't come off, which is ideal.  The mouse was easy to install, took my computer maximum of 1 minute to install the driver and my computer is 7 years old.  The other great thing is it has a 'battery saving' feature that puts the mouse into sleep mode when not in use.  To use it again simply left-click once and your mouse is awake and functioning again.  I use this mouse all day for work and at night for pleasure, haven't replaced the batteries yet!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "KOOLmouse",
    "tags": [],
    "price": 19.98,
    "position": 11,
    "page": 2
  },
  {
    "id": "prod_gaming_mice_135",
    "parent_asin": "B08RXB2MCS",
    "category": "Gaming Mice",
    "title": "2.4G Ergonomic Portable USB Wireless Mouse for PC, Laptop, Computer, Notebook with Nano Receiver ( Dog Paw Print Traces )",
    "description": "",
    "rating": 4.1,
    "review_count": 13,
    "features": [
      "Compatible with laptop, desktop, PC, MacBook and other devices.",
      "The mouse utilizes advanced 2.4GHz wireless technology, which brings out a stable signal as well as longer working distance. Just plug the USB receiver into your computer and you are ready to go. No software additions needed. Easy and convenient. Note: The USB receiver is stored in the battery compartment of the mouse.",
      "Ergonomically designed, efficient and comfortable even over long periods of use. Sleek, compact and lightweight.Low-profile shape fits nicely into your right or left hand.",
      "Requires 2 x AA batteries ( not Included)",
      "Many Patterns available, please visit our store."
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Arrived broken",
        "text": "Liked the design, but that doesn't help me if it's broke.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "KAWAMOUSE",
    "tags": [
      "Best Seller"
    ],
    "price": 19.95,
    "position": 12,
    "page": 2
  },
  {
    "id": "prod_gaming_mice_038",
    "parent_asin": "B08JYBC9MY",
    "category": "Gaming Mice",
    "title": "Vassink Ergonomic Wireless Mouse, Rechargeable Mouse 2.4Hz Vertical Wireless Optical Mice with USB Receiver, 6 Buttons, 800/1200/1600 DPI Blue",
    "description": "",
    "rating": 4.3,
    "review_count": 2164,
    "features": [
      "★【Ergonomic-Wireless Mouse】The design of the vertical wireless ergonomic mouse fits the size and contour of the palm, reducing the pressure on the palm and making your wireless mouse control more comfortable and natural.",
      "★【Efficient and Sensitive-Easy to Use】The ergonomic mouse has 6 convenient buttons design, plug and play; Adjustable 800/1200/1600 DPI mouse movement speed. Optical tracking technology has higher sensitivity than standard optical mouse, usable Smooth and precise tracking on a variety of surfaces.",
      "★【Silent Design-Fashionable Charging】Wireless mouse adopts button-quiet design, low decibel is more suitable for public places such as libraries, dormitories, offices, high-speed rail planes; with built-in lithium battery (500mAh) and USB data cable (150cm) charging device, Make your use more fashionable and convenient",
      "★【Long Life-More Durable】The high-quality optical wireless mouse has been tested for over 5 million mouse clicks. The rechargeable feature makes this wireless mouse more durable.(It is better to use it after receiving the mouse fully charged)",
      "★【Wide Compatibility-Vassink Service】Support Windows 2000/ ME/ XP/ 7/ 8/ 10/ Vista/98, Mac OS, Linux, etc. Suitable for notebooks, PCs, laptops, computers, Macbooks and other equipment. We provide 12 months of worry-free after-sales service. If you encounter any problems with the wireless mouse during use, please feel free to contact us."
    ],
    "reviews": [
      {
        "rating": 2.0,
        "title": "Too small to be ergonomic for large hands",
        "text": "This will be a quick return. This mouse is too small and does not have enough vertical lift to be ergonomic for someone with large hands. I was pleased with how quickly it charged. But after fully charging there is no response at all from the DPI button. And the initial setting is too slow for the mouse to be of real use. If I had kids at home I would pass this along for schoolwork, but it isn't adequate for gaming or long stretches of editing.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Perfect for carpal tunnel",
        "text": "If you have carpal tunnel get this now. No pain at all anymore",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Nice vertical mouse",
        "text": "Took some time to get used to.  Once I let my hand relax and rest on the mouse, and move in a different manner, definitely feeling better overall.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Battery life isn't that great",
        "text": "I use this for work. 5 days a week for about 7 hours a day. I turn it off every night and turn it on every morning. I love everything about this mouse but the battery isn't that great. It died after about 2 weeks full charge",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Returned",
        "text": "This mouse felt very awkward",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Vassink",
    "tags": [],
    "price": 25.99,
    "position": 13,
    "page": 2
  },
  {
    "id": "prod_gaming_mice_066",
    "parent_asin": "B09MY66RJB",
    "category": "Gaming Mice",
    "title": "MOFII Wireless Keyboard and Mouse Combo Silent, Slim Compact 2.4G USB Full Size Wireless Mouse and Keyboard Combo, Cute 110 Keys Keyboard for PC, Notebook, MacBook, Tablet, Laptop, Windows System",
    "description": "",
    "rating": 4.4,
    "review_count": 3274,
    "features": [
      "🔴【The Latest Candy Color Style】The latest color scheme in 2021, sweet and cute mixed colors, bring you visual enjoyment and also have a good mood all day long",
      "🟣【Only One USB Receiver】Can drive the mouse and keyboard at the same time, plug and play, start using it without any software or drivers",
      "🟠【Auto Power Saving】Adopt intelligent power-saving chip, the keyboard mouse set go for months without changing batteries(both keyboard and mouse will auto turn into power-save mode,click any key or button to wake-up)",
      "🟢【Wide Compatibility】MOFII wireless keyboard mouse combo suit for Windows 98 / Me / 2000 / XP / Vista / Win 7 / Win8 / Win10/Vista Mac OS or latest",
      "🔵【Graceful Gift Packaging】Whether this cute mouse and keyboard set used by yourself or as a gift to friends, lovers, children, etc, is a good choice"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Love it",
        "text": "I absolutely love this keyboard. It took me a few months to actually buy it but I’m glad I did.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Plug and Play. That easy for us.",
        "text": "Everything perfect. Thanks!!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Beautiful Key Board Faulty Mouse",
        "text": "I love the keyboard as it's so colorful. However, the mouse has not been working as it should. I have replaced the batteries on it about 3 times since I recieved it. Disappointed.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Nice",
        "text": "Very nice keyboard.<br />Only negative I got is that it arrived dented.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Love it",
        "text": "Super cute!  Great value",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "MOFII",
    "tags": [
      "Sponsored"
    ],
    "price": 39.99,
    "position": 14,
    "page": 2
  },
  {
    "id": "prod_gaming_mice_030",
    "parent_asin": "B09YYZ3GG6",
    "category": "Gaming Mice",
    "title": "Wireless Mouse, 2.4Ghz Wireless Mouse Computer Mouse 1200DPI,6 Buttons with Nano Receiver for Laptop,PC,Chromebook,Computer,Notebook,Office (Grey)",
    "description": "How to connect: Step1:open the battery cover,then install the two AAA battery . Step2:Take out the USB dongle and close the battery cover . Step3:Plug the USB dongle in the USB port . Step4:Place your wireless mouse close to the dongle about 30CM,turn the power switch button to \"ON\", the led light will light up.Your mouse will connect with the dongle automatically and start working . Notice if the mouse doesn't work ,please place the mouse near to the dongle and press the connect button (underneath the mouse)and release ,it wll connect to work . Package details Wireless mouse x1 USB nano receiver x1",
    "rating": 3.9,
    "review_count": 513,
    "features": [
      "System support: Windows,Android/Linux office/Mac OS device.",
      "Wireless Mouse :RF2.4G wireless transmission distance of up to 10m.",
      "Easy operation: USB nano dongle and power switch ,more convenient when plug in USB ,Plug and Play make all the operation more easier than others.",
      "with 800/1200 CPI switch ,press left+mid+right button for switching ,2.4Ghz wireless ,1200cpi optical technology.",
      "Package Contents: 1x Wireless Mouse, 1x Nano Receiver,Powered by two AAA battery (not included)"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Good Basic Mouse",
        "text": "It serves the purpose intended. A good, basic wired replacement mouse.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Mouse in the house.",
        "text": "Works properly as it should, couldn’t beat the price.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "It works great! But not for long!",
        "text": "Came a day early, put two AAA batteries in, put the USB in the laptop, and away we go.<br /><br />It works great.<br /><br />Update:  It didn't work for long. It starts out with the mouse going to sleep all on it's own, and then it gets worst (you wouldn't think it possible, would you). I left the laptop and mouse on while I ran to the store, when I came back it was working VERY intermittent (very jerky) so I opened it thinking maybe my batteries weren't all that good.<br /><br />What did I find? One of the batteries was so hot I couldn't touch it. I'm surprised it didn't catch on fire.<br /><br />I should have known better than to buy some Chinese garbage. Into the trash it went.<br /><br />Don't buy this, it's a waste of good money.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "good buy",
        "text": "works",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "BUEN PRODUCTO",
        "text": "Lo recomiendo",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Guiheng",
    "tags": [],
    "price": 4.99,
    "position": 15,
    "page": 2
  },
  {
    "id": "prod_gaming_mice_151",
    "parent_asin": "B08K84F3QS",
    "category": "Gaming Mice",
    "title": "2Sets Hyperslides Rounded Curved Edges Mouse Feet, Skates, Pads for Logitech G903 Lightspeed, G903 Hero Gaming Mouse Feet Replacement (0.8mm, Smooth Glide, Pure White PTFE) Pro Performance Upgrade",
    "description": "",
    "rating": 4.5,
    "review_count": 88,
    "features": [
      "✔️ [High Quality] Replacement mouse feet that increases your control and accuracy by providing the smoothest and most consistent slide",
      "✔️ [Buttery Smooth] Having a smoother slide helps reduce grip tension which improves accuracy and decreases wrist strain for longer and more enjoyable gaming or work sessions",
      "✔️ [Exclusionary Tech] Our exclusive technology produces rounded edges for a scratch-free slide right out of the package; no break-in period required",
      "✔️ [Meticulous Design] Specially calibrated 0.80 mm thickness: Provides the ideal feet height that eliminates \"bottom-scraping\" & provides longer life-span",
      "✔️ [Longevity] We include 2 sets made of 100% virgin grade PTFE material for the lowest friction and eco-friendly, 3M no-residue adhesive"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Really improve the feel",
        "text": "Before this I have never really considered changing the mouse feet.  The only reason I purchased these was because I need to remove the old ones to solder in a new switch.<br /><br />With the new micro switches installed. https://amzn.to/3ElgafC ( incase you are curious which ones) and the new feet this made a whole new mouse.<br /><br />The feet arrived perfect no bends or wrinkles.  Super easy to install.  Just make sure you clean the area really good with some alcohol.<br /><br />They glide so much better than stock feet.  The feel is simply amazing.  Now whenever I purchase a new mouse I will be upgrading the feet.  If you are on the fence about it I would say go for it.<br /><br />For durability I have had these on for over a month and they have no signs of wear.  They still perform excellent.<br /><br />Thank you for taking the time to read this and I hope that it was helpful in your purchase decision",
        "verified": true,
        "helpful_votes": 2
      }
    ],
    "store": "HYPERSLIDES",
    "tags": [],
    "price": 11.99,
    "position": 16,
    "page": 2
  },
  {
    "id": "prod_gaming_mice_122",
    "parent_asin": "B0789V3R2H",
    "category": "Gaming Mice",
    "title": "HP 15.6\" HD Touch Screen Laptop Bundle , AMD A12-9720P Quad core processor 2.7 GHz, 8GB DDR4, 1TB HDD, DVD, WiFi, Webcam, Windows 10, Gray, Wireless Mouse and Backpack Included.",
    "description": "This stylish Touchscreen laptop in Smoke Gray offers reliable performance and long-lasting battery life so you can easily surf, stream, and stay in touch with what matters most. With the latest AMD Quad-Core A12-9720P processor, AMD Radeon R7 Graphics, 8GB DDR4 Memory, and 1TB Hard Drive, this laptop delivers the reliable performance you need to work and play.",
    "rating": 4.0,
    "review_count": 133,
    "features": [
      "Brand New in box. The product ships with all relevant accessories"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Laptop is not like new it is new the box had never been opened, Thank You So Much",
        "text": "I'm so happy with this purchase the items are exactly as described",
        "verified": true,
        "helpful_votes": 10
      },
      {
        "rating": 1.0,
        "title": "Sucks, Slow, Terrible, Missing pieces.",
        "text": "Extremely slow unless you know how to disable 50 or so features that run off the bat. The mouse came with no bluetooth adapter, and this doesn't have built in bluetooth.<br />Seriously don't buy HP.<br /><br />1 hour of ownership update: It's stopped opening windows. It brings up the login screen, then I get a black screen. The computer no longer works and I've done nothing to it. There are several other reviews referring to this issue.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "so far its a great buy. I like it",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Excelent value laptop",
        "text": "My daughter needed a faster more copact laptop for her graphics software so we gave this one a try.  Very fast, easy setup...nice and easy to chuck the bloatware.  A reasonable price made it an easy choice...so much so that we purchased another.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Definitely returning and buying a different brand",
        "text": "I had high hopes for this laptop... very very very slow. I mean how can a company like HP in this day in age make a laptop this slow. I didn’t expect speeds you would see in a gaming laptop for this price but I at least want to be able to watch a movie or even start the laptop within 10 minutes, and they don’t even allow you to upgrade the RAM or anything from what I can tell... and the battery life is laughable, like a previous comment said, about 1 percent per minute. I would even go as far as to say that it dies faster than that. Purchased this for my sister for her birthday but will definitely return and go with a different laptop.",
        "verified": false,
        "helpful_votes": 1
      }
    ],
    "store": "HP",
    "tags": [],
    "price": 639.99,
    "position": 17,
    "page": 2
  },
  {
    "id": "prod_gaming_mice_134",
    "parent_asin": "B00E7IPN0I",
    "category": "Gaming Mice",
    "title": "Logitech Wireless Mouse M325 (Celebration Black)",
    "description": "SMALL BUT MIGHTY Get work done anywhere with this small portable mouse. The size of M325 makes it great for users with smaller hands-including kids-or limited workspaces. The micro-precise scrolling and tilt wheel provide you the speed and accuracy you need. Easy-to-use and compatible with all of the main OS, it's ready to work in seconds and lasts up to 18 months without changing batteries. COMFORTABLE SHAPE, COMPACT DESIGN Stay productive longer thanks to the comfortable, contoured shape that follows the natural curve of your hand. Compact and wireless, M325 fits easily with your laptop in a bag-making it great for working on the go and homeschooling. It's also designed for both right- and left-handed users, allowing you to switch the left and right click via Logitech Options Software. FAST SCROLLING, PRECISE TRACKING Our micro-precise scrolling and tilt wheel give you the speed and precision you need to breeze through long pages, websites, links, spreadsheets, and images. Customize the tilt action to perform horizontal scroll, forward/backward, and more through Logitech Options. PLUG & PLAY SIMPLICITY Simply plug the USB receiver into your computer or laptop to start working in seconds and get a strong, reliable connection within up to 10 meters (33 feet),Plus, you can easily pair through the same receiver up to six compatible peripherals using Logitech Unifying™ technology. BROAD COMPATIBILITY M325 is compatible with most OS-Windows®, macOS®, Linux®.And is also a certified Works with Chromebook™product. INCREASED PRODUCTIVITY Get more done by combining M325 with your laptop. According to a recent study, laptop users who chose this mouse over a touchpad were 50% more productive and worked 30% faster. QUALITY YOU CAN RELY ON The mouse is built with the same high quality standards that have made Logitech t",
    "rating": 4.7,
    "review_count": 882,
    "features": [
      "Pointing Device Connectivity Technology: Wireless",
      "Wireless Operating Frequency: 2.40 GHz",
      "Movement Detection: Optical",
      "Movement Resolution: 1000 dpi",
      "Number of Total Buttons: 5"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Mouse",
        "text": "Good mouse for my computer",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "works great",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Portable, durable and pretty",
        "text": "I travel for work and needed something light and easy to take with me to various work locations. I had a Microsoft wireless mouse but for some reason it didn't properly scroll in some of the programs I use for work so I replaced it with this one. It works great, it is easy to install, works even when the receiver portion is plugged into a USB splitter, and the design is cheery.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "The Standard",
        "text": "The Logitech M325 is pretty much the standard wireless mouse that so many people have. The color pattern is nice and vibrant, and it's a cheap buy.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "Great colors and my daughter loved it",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Logitech",
    "tags": [],
    "price": 19.99,
    "position": 18,
    "page": 2
  },
  {
    "id": "prod_gaming_mice_089",
    "parent_asin": "B07CML82PG",
    "category": "Gaming Mice",
    "title": "LingAo Slim Silent Wireless Mouse,2 Pack with Nano Receiver,3 Adjustable DPI Levels,Slim Silent Wireless Mouse Silent Click for PC, Laptop, Tablet, Computer, and Mac (Black&White)",
    "description": "Product Descriptions No matter you are an office clerk or a colleague student, a slim and noiseless wireless mouse is absolutely needed. The mute button design of our LingAo wireless mouse keeps you focused on what you are working on without disturbing others. Noiseless Clicks Sometimes you need to work on the computer while others want to have a rest. At that moment, a noiseless wireless mouse would help, providing credible using experience. Slim and Portable Design Compact and portable, the slim wireless mouse can be easily put into your bag or even pocket. Great for business trips or travelling. Supports Plug and Play Supports plug and play, no other driver is needed. Simply plug the Nano receiver into the computer USB connector and wait until it finishes installing. Power-Saving Mode Auto Power Off (APO) for energy saving. LingAo basic mouse will be switched off automatically when the Nano Receiver is disconnected, or the PC is power off. Specifications:  Product Dimensions: 4.5*2.6*1.3in (115*65.5*33mm)  Product Weight: 2.3oz (63g)  Battery Type: 1*AA Battery (not included)  CPI: 1250-1500-1800 Wireless: Yes System Requirements: Windows XP, Windows 7, Windows Vista, Windows 8, Windows 10, Windows 2000, Mac OS.  Plug and Play Operation: Yes Note:  Nano receiver is stored in the back of the mouse.  Battery lifespan may vary with different user habit and battery capacity.  To ensure a better signal transmission, please confirm that there are no obstacles or electromagnetic wave around the mouse. Package Included:  1 x Wireless Mouse 1 x USB Nano Receiver 1 x User Manual",
    "rating": 4.2,
    "review_count": 936,
    "features": [
      "Sensitive and Noiseless: Quiet clicks free your worry about bothering other beside you and keep you focused while working or studying. The optical laser allows for quick response, precise movement and smoother tracking.",
      "Skin-Friendly for Comfort: Streamline design with anti-fingerprint and sweat-resistant finish offers your hand maximum support and comfort. The sturdy anti-slip rubber scroll wheel ensures that your hand will not slip when scrolling.",
      "Portable and Pocket Size: Featuring slim (4.5*2.6*1.3in/115*65*33mm) which is twice thinner than ordinary mice, this portable wireless mouse is perfect for travelling. It can be easily put into your backpack or pocket. (Note: The Nano receiver is stored in the back of the mouse.)",
      "Stable and Anti-Interference: 2.4GHz wireless transmission technology provides a powerful and reliable connection up to 33ft (10m). 3 adjustable CPI levels, 1250-1500-1800, easily change the mouse sensitivity to match your activity.",
      "Energy Saving and warranty: Auto Power Off (APO) for energy saving. LingAo basic mouse will be switched off automatically when the Nano Receiver is disconnected, or the PC is power off. Well compatible with Windows7/8/10/XP, Vista7/8 and Linux etc.Suitable for couples, friends, colleagues, parents, husband and wife. 30 days money-back & 1-year guaranty, any problems, please don't hesitate to get an after-sale service."
    ],
    "reviews": [
      {
        "rating": 2.0,
        "title": "you get what you pay for",
        "text": "these work but feel like crap.  Left and right click are terrible.  Sometimes when I left click, as the piece of plastic is coming back up, it goes under the right side.  Its like someone took a solid sheet of plastic and cut a line down the middle to allow you to press down on the left or right side, its terrible.  Scroll wheel feels fine.  DPI button just cycles through, no way to go up or down, just cycles through 3 modes.  Very uncomfortable.  For the price, you get two and both are exactly like this so I doubt its defective.  I only got these to control my streaming PC so its not a HUGE deal, but if youre getting these for daily use - DONT DO IT.  I can hardly put up with these and I use them for maybe 10 mins a day.  Pay 15$ for one mouse.  I honestly feel like I could crush these with my hand - thats how crappy they feel.  They also go to sleep mode after like 5 mins so I have to constantly click it to wake it up, and it ends up opening apps.  Not worth the 15$",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Noise free and work on system and TV.",
        "text": "Very smooth, you won't hear the click noise anymore.  Pretty product.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "2 Pack Mouse",
        "text": "Item as described. Super easy to install. Thanks.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Perfect",
        "text": "Perfect. Bought 2 for myself and my oldest son who is homeschooling and he hates they mouse's with the cords. Works well, quiet and small enough yo pack and travel with.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Mouse is inconsistent, will not work 50% of time",
        "text": "I bought these for my husband and I because we needed new ones for work. My husband’s mouse will randomly stop working, causing issues with him being productive during the day. It is very frustrating considering all of the 5-star reviews this brand received.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "LingAo",
    "tags": [
      "Sponsored"
    ],
    "price": 15.68,
    "position": 19,
    "page": 2
  },
  {
    "id": "prod_gaming_mice_087",
    "parent_asin": "B0957PJW3X",
    "category": "Gaming Mice",
    "title": "Neises LED Bluetooth Mouse,Bluetooth Mouse for MacBook Pro/MacBook Air/iMac/mac/ipad/ipad pro,Wireless Mouse for Macboook Air/MacBook Pro/PC (Silver)",
    "description": "✅Packing list: Instructions*1, LED rechargeable Bluetooth5.1 + 2.4G dual-mode mouse *1, 2.4g Nano USB receiver *1(hidden in the slot at the bottom of the mouse), USB charging line *1, USB C-type adapter *1\n✅How to connect to a laptop using bluetooth mode:\nTurn on the Bluetooth switch at the bottom of the mouse > open the computer system Settings > open Bluetooth >when the computer bluetooth display is looking for nearby bluetooth devices, find the \"BT5.1 mouse\", click the connection, and then successfully connected, you can use the mouse.\n✅ How to connect to iOS/iPad/Pro/Air/ Mini/ Phone (ios 13/ios 14) via Bluetooth Mouse\nfirst slide the button at the bottom of the mouse to the bluetooth \" \" position. ( bluetooth mode.)\n(1) open tabletSettings >Accessibility > Touch > AssistiveTouch > Click to open （An auxiliary dot will appear on the screen）\n(2) Go back to Settings > Click on the bluetooth > Click to open > BT 5.1 MOUSE > connect and Pair.（PIN:0000)\n🔋How to Charge Wireless Mouse?\n🔋When the pointer of your mouse does not move or cannot be used, or suddenly disconnects continuously in use, you need to charge it for about 3 hours. Please use the USB port of your computer to charge it, or use an adapter with an output of no more than 5v to charge it\n✅ How to use the 2.4G receiver mode:\nOpen the 2.4G receiver mode at the bottom of the mouse, remove the USB receiver at the bottom of the mouse,Plug the USB receiver into your computer's USB port and move the mouse to start working，If your laptop is a Type C port, first plug the Type C adapter into your laptop's Type C port, then plug the mouse's USB receiver into the Type C adapter, and then move the mouse to work\n💡 7-color LED mouse: After the mouse is successfully connected to your computer/laptop/iPad device, the 7-color LED starts to light one by one.",
    "rating": 4.4,
    "review_count": 2317,
    "features": [
      "ERGONOMIC DESIGN： Good surface coating technology given you a skin-like touch feeling. User-friendly design provide all-day comfort for work and entertainment, portable and pocket-sized perfect for travel, Mute design keeps away annoying clicks.",
      "Use the DPI mouse button on the screen: you are free to adjust the mouse sensitivity to match your activity. Provide 3 DPI levels (800-1200-1600). The higher the DPI, the faster the cursor moves on the screen",
      "For all computers and laptops and ios13 / ios14 tablet/pro/Air / Phone / MAC / MacBook / Pro / air windows / chromebook / HP / Dell",
      "💡 7-color LED mouse: After the mouse is successfully connected to your computer/laptop/iPad device, the 7-color LED starts to light one by one.",
      "BUILT-IN BATTERY: Built-in battery,easy to charge by micro usb cable,no more need for extra AAA battery."
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Dies within six months",
        "text": "I had this since November 2021 and by March 2022 it was suddenly jumping around the screen and the refusing to track. It has no damage or water spills or anything like that. Just gone.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Happy with purchase",
        "text": "Ordered this for a college student, and they were very happy with this wireless Bluetooth mouse.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Cute and comfortable to use.",
        "text": "Works right out of the box. Prefer this than to Bluetooth since sometimes it might not pick it up. Had one like that and didn’t like the nuisance of getting to connect. Price is Spot On!!! Love it.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Okay device but no directions",
        "text": "This little mouse is very comfortable but there were no instructions as to his to charge and to connect<br /><br />Looking for instructions before returning",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "so far so good",
        "text": "great price, design, etc. just wish it had more weight because it is ultra lightweight on its<br />own",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Neises",
    "tags": [],
    "price": 11.88,
    "position": 20,
    "page": 2
  },
  {
    "id": "prod_gaming_mice_026",
    "parent_asin": "B07MPQ8H6G",
    "category": "Gaming Mice",
    "title": "LZYDD Mouse Anti-Slip Tape Elastics Refined Side Grips Sweat Resistant Pads / Anti Sweat Paste for Logitech G Pro Wireless Mouse",
    "description": "Anti-Slip tape Elastics Refined Side Grips Sweat resistant pads / anti sweat paste for Logitech G pro wireless mouse",
    "rating": 4.5,
    "review_count": 381,
    "features": [
      "Come with 1 set including 4 parts ( 2 top parts and 2 side parts)",
      "Only Anti-Slip tape included, No mouse included"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Amazing addition to the Logitech G Pro Wireless!",
        "text": "Great quality, precision cut pieces that fit EXACTLY in the shape of the mouse. Whoever designed the CAD for this did a great job on the measurements. Using the grip itself, also crazy how something so small makes a big difference. No more worrying about it slipping off my right thumb which I mentally couldn't handle. It's shame that Logitech didn't design the grip but this will do nicely until they do.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 3.0,
        "title": "They're ok.",
        "text": "I'm only using the side grips. (No issue with the texture of the buttons, so imo, its best to just not use them and keep the mouse as light as possible)<br /><br />Its definitely an improvement over the stock plastic feel, which is too smooth for me. These add some grip, and even a bit of cushion.<br /><br />Guess I was expecting a more grippy feeling. Maybe a more pronounced texture.  There is definitely room for improvement for those of us with sweaty gaming hands.<br /><br />I also wish the edges were tapered off at its edges rather than a hard cut, but that's a minor nitpick and not too important.<br /><br />I will say with these grips, I am having trouble deciding between which mouse to use primarily... G Pro Wireless or Viper Ultimate. This is definitely something that was missing from the G Pro Wireless's design for me.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Love it!",
        "text": "Was expecting more of a Dbrand style sticker, but this is even better. It's super rubbery and grippy. Don't ever plan on missing a shot when you play with this!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "It works for G305",
        "text": "I recently purchased Logitech G305, But it felt slippery. Though this product was intended for GPW, it worked well for the G305.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "LZYDD",
    "tags": [],
    "price": 7.99,
    "position": 21,
    "page": 3
  },
  {
    "id": "prod_gaming_mice_132",
    "parent_asin": "B01MYVTVX6",
    "category": "Gaming Mice",
    "title": "KOOLmouse [ Optical 2.4G Wireless Mouse [ Kiss Zebra Fur Silver Glitter Sparkling Pink ]",
    "description": "Optical 2.4 G wireless Mouse",
    "rating": 3.0,
    "review_count": 14,
    "features": [
      "Wireless curved mouse connects via USB receiver",
      "For all laptop and desktop support USB 2.0",
      "Slim ergonomic mouse is perfect for home and office use",
      "Optical tracking technology mouse works on many different surfaces",
      "Nano Receiver"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Garbage.",
        "text": "This is without a doubt the most disappointing thing I have purchased on amazon. The picture in the display makes it look like the mouse has a little bit of sparkle and a fuchsia lip stamp on it. It’s the cheapest crap I have ever seen. The picture on the mouse looks like it was blown up way to large to fit on the mouse. It feels like cheap plastic and for $20 I really could have bought something much nicer. I am not happy with this at all. It’s not worth one star. Update!!! The clickers are backwards so now when I go to select something it opens up the small menu the way it would if you right click. This is completely trash. So disappointing.",
        "verified": false,
        "helpful_votes": 1
      }
    ],
    "store": "KOOLmouse",
    "tags": [],
    "price": 19.98,
    "position": 22,
    "page": 3
  },
  {
    "id": "prod_gaming_mice_028",
    "parent_asin": "B0BV2YBX3Q",
    "category": "Gaming Mice",
    "title": "HP X3000 G3 Wireless Mouse - Blue, 15-Month Battery, Side Grips for Control, Travel-Friendly, Blue LED, Powerful 1600 DPI Optical Sensor, Compatible with Wins PC/Laptop, Mac, Chromebook (683N8AA#ABL)",
    "description": "Lose the wire but not the power Hit the road with a wireless mouse that looks as good as it feels, keeps you connected, and packs lasting power. Guaranteed by HP.",
    "rating": 4.6,
    "review_count": 21339,
    "features": [
      "Looks good, feels good: Contour comfort fits either hand like a glove. All day, every day."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "works for me",
        "text": "a good mouse.  perfect for me but could be small for some people.  works great.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "HP is awesome!!",
        "text": "Great little lightweight mouse",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Works as it should",
        "text": "Looking for a mouse that works but does not breakdown within a couple of months. So far so good.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "works well",
        "text": "does what it is suppose to do",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "It works",
        "text": "This mouse works fine but the click is louder than I hoped it would be.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "HP",
    "tags": [],
    "price": 18.99,
    "position": 23,
    "page": 3
  },
  {
    "id": "prod_gaming_mice_051",
    "parent_asin": "B0C1TXDNYD",
    "category": "Gaming Mice",
    "title": "TedGem Wireless Mouse, 2.4G USB Receiver Cordless Mouse, Travel Mouse for Laptop, 6 Buttons Portable Mice, 3 Adjustable Levels Ergonomic Mouse for Windows, Computer, PC, Mac, Notebook, Desktop, Pink",
    "description": "",
    "rating": 4.4,
    "review_count": 328,
    "features": [
      "【3 Adjustable DPI Level】The wireless mouse has 800, 1200, and 1600 adjustable DPI settings. It can achieve precise tracking and sensitivity for offices or games. Adds an extra 2 side buttons on the side to move forward or backward without closing the entire page. You can easily browse articles or web pages.",
      "【Comfortable Ergonomic Design】The wireless mouse adopts the latest ergonomic design, simple and stylish. Perfectly match the position of each finger. The symmetrical design makes it suitable for left and right hands. Computer mouse meets the needs of laptops, suitable for Chromebook, home, work, or travel, satisfying users with different habits.",
      "【2.4GHz USB Quick Connect】 Wireless laptop mouse has been tested for 5 million keystrokes to ensure that this wireless mouse has excellent durability, advanced 2.4GHz wireless technology, it can still be stably connected to your computer within a distance of 33 ft, plug and play, easy to use.",
      "【Auto Sleep Mode】The wireless computer mouse will enter automatic power saving mode after 1 minute of inactivity and sleep mode after 8 minutes. The laptop mouse can be woken up by clicking any key, which is not only energy-saving and environmentally friendly but also extends battery life to a certain extent (battery life may vary depending on the user and computer situation. 1 * AA battery [Not Included].",
      "【Wide Compatibility and Service】This small wireless mouse is highly compatible with Windows 7/8/10/XP, Vista 7/8, Linux, etc. USB mouse wireless for laptops, desktops, PCs, MacBooks, and other devices. Tedgem is proud to be All our products provide a 12-month warranty and 24 / H service for all customers. If you have any questions, please contact us for free help!"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Aggravation",
        "text": "I bought this mouse for it's pretty color. And ended up with aggression!! It randomly works and doesnt work. After trying numerous things I gave up and bought a different one from a different manufacturer.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "TedGem",
    "tags": [],
    "price": 7.99,
    "position": 24,
    "page": 3
  },
  {
    "id": "prod_gaming_mice_002",
    "parent_asin": "B09ZTC6LGP",
    "category": "Gaming Mice",
    "title": "KLO Bluetooth Mouse for MacBook/MacBook air/Pro/iPad, Wireless Mouse for Laptop/Notebook/pc/iPad/Chromebook (BT/A deep Pink-Black)",
    "description": "Adopt bluetooth 3.0/5.2 technology, built-in 500mAH A product lithium battery, configuration charging line, like a mobile phone, easy to charge, more scientific, charge and discharge of more than 500 times, the mouse no longer need to buy a battery. size: 113mm x 58mm x23mm weight : 3.2 oz package: Bluetooth mouse x1, USB Charging Cable x1 How to use Bluetooth wireless mouse:Apple Mac MacBook/pro/Air 2012/2013/2014/2015/2016/2017/2018/2019: first, open the mouse switch, open the computer system preferences, open the bluetooth, when the computer Bluetooth display is searching for nearby Bluetooth devices, hold down the mouse button (at the bottom of the mouse small black button) and keep 3 to 8 seconds, and then your computer display the search bluetooth mouse, bluetooth device click on the link, and then the connection is successful Win7/8/10/XP series notebook computer usage instructions: First, open the mouse switch, open the computer settings, open the device Bluetooth function, open add Bluetooth, open Bluetooth, when the computer Bluetooth display is searching for nearby Bluetooth devices, hold down the mouse button (at the bottom of the mouse small black button) and keep 3 to 8 seconds, and then your computer display the search bluetooth mouse, bluetooth device click on the link, and then the connection is successful",
    "rating": 4.3,
    "review_count": 23550,
    "features": [
      "✪✪3DPI SWITCH:Using high-performance optical chips, up to 1600 dpi(800, 1200, 1600) accurately tracking,to meet different needs.",
      "✪✪Adopt bluetooth 3.0/5.2 technology,built-in durable 500mAh Lithium polymer rechargeable battery,high cycle life, The charging time is about 1.5-2.5 hours, lasting use time, the Auto Switch Off function will help you save energy as your bluetooth mouse will switch off when your PC is turned off or the receiver is disconnected. If you do not use the mouse for eight minutes, it will go to sleeping mode, you can press the any button to weak it up. energy saving and extremely low power consumption.",
      "✪✪It is compatible with Mac OS Windows /Win8/10/and is suitable for desktop/ipad/notebook/Mac Macbook Pro/Air(2017/2018/2019/2020/2021) iMac and other devices.",
      "✪✪contoured shape, Ultra Thin and lightweight design, smooth surface ensure maximum comfort and support for your hand even after long working hours, The rubber scroll wheel makes sure that your hand will not slip when scrolling,This bluetooth mouse can meet your demand of daily office working and personal preference.",
      "✪✪To provide you with quality after-sales service: any quality problems within a month can be directly returned or replaced.It is recommended to use the USB port of the computer to charge the mouse, or use a 5V 1A charger, no larger than 5V 1A."
    ],
    "reviews": [
      {
        "rating": 2.0,
        "title": "Short life span",
        "text": "Worked for about 4 months and then just stopped. I charged it, it says it’s connected to my MacBook, but nothing happens.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Nice Mouse but Didn't last long",
        "text": "Beautiful color and smooth clicking/tracking. A bit frustrating having to turn it off and on to take out of sleep mode but does work well.<br /><br />Sad to say that the mouse stopped working since I wrote my review. I don't know if it won't take the charge or what.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "It’s junk…",
        "text": "I bought this mouse in late July. It now early September and it won’t even hold a charge. I missed the return window, now it’s expensive garbage… buyer beware.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "so far pretty good.",
        "text": "I have been using it. so far it works pretty good.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Cheap, Easy, but the double click is infuriating",
        "text": "This mouse tends to double click and it drives me crazy. With that being said, I'm still using it.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "KLO",
    "tags": [],
    "price": 14.99,
    "position": 25,
    "page": 3
  }
]