[
  {
    "id": "prod_toothbrushes_189",
    "parent_asin": "B0C5D7FXSR",
    "category": "Toothbrushes",
    "title": "Bskifnn Plastic Toothbrush Case Six Colors Portable Dust-proof Toothbrush Cases Toothbrushes Holder for Daily and Travel Use (24)",
    "description": "PRODUCT SPECIFICATIONS: COLOR:six random color DIMENSION: 8.1x1.2\" (LxW) MATERIAL:ABS material  More benefits *Health and environmental protection, the use of safe and secure. Elegant color, elegant appearance, traveling travel storage toothbrush, compact and portable, clean and hygienic. *Durable.Capsule shape, fresh and stylish, can accommodate toothpaste, toothbrush, easy to travel, travel. *Brilliant and bright, good sealing, It can provent dust and dirt, easy to breed bacteria, travel, easy to carry.  WHY DO YOU BUY IT? With the improvement of living standards, more and more people like to travel,Buying travel essential goods is a troublesome thing. Toothbrushes and toiletries that we are essential, easy to carry toothbrush will make traveling a lot easier. If you recently prepared to travel, then you can start a such a toothbrush box Oh, super fashion, but also a very attractive, the most crucial is convenient.  The capacity of this toothbrush box is great, it can not only put a toothbrush, you can put small combs, small bottles of toothpaste, etc., is not super easy?",
    "rating": 4.8,
    "review_count": 324,
    "features": [
      "MATERIAL:ABS plastic material, eco-friendly,light and durable, dust-proof, protect the toothbrush from deformation.",
      "CLEAN and SAFE:Two-section design,keep your toothbrushes clean.Round Corner design, will not scratch other items in your bag. HEALTHY:Each case has holes for ventilation,keep the toothbrush dry and healthy ,assured the use.",
      "HEALTHY:Each case has holes for ventilation,keep the toothbrush dry and healthy ,assured the use.",
      "DIMENSION: 8.1x1.2\" (LxW), do not take up space,six colors ：green,yellow, pink, white, purple, blue convenient to carry for travelling.",
      "PRACTICAL:Can contain toothbrushes, chopsticks, stationery, great choice for travelling, outing,business trip,etc.If you have any questions, you can contract us. OUr goals are making you satisfied.We will try our best to solve your problems."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great for classroom pencil holders!!",
        "text": "I just got these, after failed attempts with dollar store pencil holders. These are sturdy, and  can hold a marker, Expo, and 2 pencils!! I will update if they break, but they seem very sturdy!! I would recommend them to all my teaching friends. If they can stand up to second graders, they will stand up to anyone needing these for travel!",
        "verified": true,
        "helpful_votes": 17
      },
      {
        "rating": 4.0,
        "title": "I bought these for my double point knitting needlseT",
        "text": "These are as promised, they come individually wrapped and are clean and free of manufacturing grease.<br />I am not using them for the intended purpose but they are great for storing my sets of dp needles. I can find the size I want immediately and they don't spread themselves all over the drawer where they're kept any longer.<br />They seem to stay together very well, I can recommend them for this purpose with no reserve.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 4.0,
        "title": "Great to use as pencil holders!",
        "text": "I am using these as pencil holders for my students. They are working great so far!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Hi",
        "text": "There bad ass I like this",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Bought for classroom",
        "text": "I use these in my classroom for pencils. Unfortunately about 4 have broken at this point just from regular wear and tear. They are probably good for travel, but don’t withstand 4th grade usage.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Bskifnn",
    "tags": [
      "Sponsored"
    ],
    "price": 15.99,
    "position": 1,
    "page": 1
  },
  {
    "id": "prod_toothbrushes_174",
    "parent_asin": "B0C4XVGFJQ",
    "category": "Toothbrushes",
    "title": "TEETHEORY Electric Toothbrush, 8 Brush Heads Sonic Electric Toothbrush with 40000 VPM Deep Clean 5 Modes, Rechargeable Toothbrushes Fast Charge (with Travel Case, Pink and Black)",
    "description": "",
    "rating": 4.5,
    "review_count": 160,
    "features": [
      "40000VPM HIGH VIBRATION - 2 pack sonic electric toothbrush equipped with World-leading Powered Motor to generate 40,000 STROKES per minute, and thus dissolve deep tooth dirt effectively. 10X Cleaning Effect than manual toothbrush and 3X than ordinary electric toothbrush. 7 DAYS to Whiten teeth & 14 DAYS for Healthier Teeth.",
      "12 x 3D DUPONT BRUSH HEADS & 2 TRAVEL CASES - 2 pack electric toothbrush comes with 12 brush heads designed by DuPont company; a world leader in quality and material science field. Each brush head lasts up to 3 months, absolutely the ideal choise for all of you! 2 different color hard shell travel cases made of the latest technology materials, can hold 1 brush head. It's very suitable for travel or business trip.",
      "5 MODES & POWER REMINDER - 2 pack sonic electric toothbrush for adult supports 5 modes: whitening, cleaning, sensitive, polishing, massage. Whitening mode fulfilled by reversing the frequency to dissolve the surface stains. And massage modes deliver smooth microbursts to the tissue to improve blood circulation and gum health. Electric toothbrush 2 pack have remaining power knowable after each use. Never worry for sudden power off.",
      "PERFECT PARTNER FOR TRIP - Last for 30 DAYS after only 4 hours full charging(2mins/2 times per day). The 2 pack sonic toothbrush come with a USB charging cable for charging anywhere. Weighs just 55g, less than half of ordinary sonic toothbrushes. IPX7 waterproof for easy water rinsing after each use.",
      "PACKAGE - 2 pack sonic electric toothbrush, 12 DuPont toothbrush heads, 2 travel cases, 2 USB charging cables, 1 User manual. Ideal GIFT CHOICE for family & friends. More than 2 million enthusiastic users around the world feel excellent of using sonic toothbrush to improve gum health and whiten teeth. family is looking forward to your joining!"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Good quality product.",
        "text": "Haven't had it long, however, I like the way my teeth feel after brushing.  Light touch buy effective cleaning. I have been a customer of Phillips Sonic for at least 26 years.  At my last dental cleaning, my hygienist also recommends Sonic.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 4.0,
        "title": "More like the impossible-to-find-Fairywill",
        "text": "This replaces a previously-ordered wireless-charging brush.  Reason for this is that it's lighter, takes a common brushhead (and we have the soft-bristle heads from previously).  Has a plug-in charger, i.e. not wireless, so that works, easy to travel with, don't have to take an induction charger with us. Also, the 30-second indicator is easy to hear/feel.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "I like it but room for improvement",
        "text": "It is a great product the reason l gave it a 3 star is l would prefer the brush to spin it just vibrates so l still have to brush and that damages the gums so not happy about that otherwise it holds a battery for at least 3 months or more before the next charge and is a powerful vibration but l will see what my dentist says when l do in on Wednesday after my 6 week check up from having a deep cleaning",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "TEETHEORY",
    "tags": [],
    "price": 44.99,
    "position": 2,
    "page": 1
  },
  {
    "id": "prod_toothbrushes_116",
    "parent_asin": "B075MLN99G",
    "category": "Toothbrushes",
    "title": "Cybersonic3 Electric Toothbrush, Rechargable Power Toothbrush with Complete Dental Care Kit including Tongue Scraper and Floss Heads",
    "description": "The Cybersonic3 Electric Toothbrush is a COMPLETE ORAL CARE SYSTEM that truly does it all, with just one product you get a premium sonic power electric toothbrush that gives you that just left the dentist feeling, with an attachable flosser head perfect for those hard to reach areas, and attachable tongue scraper to keep your breath amazingly fresh. It gives you that DENTIST CLEANING FEEL with our patented Harmonic Resonance technology moving at over 40,000 strokes per minute, making it the \"World's Fastest Toothbrush\" with each scientifically designed attachement vibrating at a specific frequency for the perfect cleaning every time. It gives you a LONG LASTING CHARGE that allows up to 1-2 weeks of usage with a fully charged brush, giving you the convenient option of leaving the charging base at home when you travel for the weekend, along with a CLEVERLY DESIGNED CHARGING BASE measures 3 inches in diameter with a detachable accessory holder, so it won't take up much needed counter space. We back our quality with our promise which is 100% SATISFACTION, with a 30 day money back guarantee no questions asked, along with 1 full year manufacturer's warranty.",
    "rating": 4.5,
    "review_count": 208,
    "features": [
      "COMPLETE ORAL CARE SYSTEM that truly does it all, with just one product you get a premium sonic power electric toothbrush that gives you that just left the dentist feeling, with an attachable floss head perfect for those hard to reach areas, and attachable tongue scraper to keep your breath amazingly fresh",
      "DENTIST CLEANING FEEL with our patented Harmonic Resonance technology moving at over 40,000 strokes per minute, making it the \"World's Fastest Toothbrush\" with each scientifically designed attachement vibrating at a specific frequency for the perfect cleaning every time",
      "LONG LASTING CHARGE allows up to 1-2 weeks of usage with a fully charged brush, giving you the convenient option of leaving the charging base at home when you travel for the weekend",
      "CLEVERLY DESIGNED CHARGING BASE measures 3 inches in diameter with a detachable accessory holder, so it won't take up much needed counter space",
      "OUR GUARANTEE TO YOU IS 100% SATISFACTION, with a 30 day money back guarantee no questions asked, along with 1 Full Year Manufacturer's Warranty"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Best toothbrush",
        "text": "This is my second cybersonic toothbrush.  When my first cybersonic failed after many years of good service I ordered a less expensive name brand electric toothbrush and after 6 weeks threw it away and ordered my new cybersonic. Lesson learned.",
        "verified": true,
        "helpful_votes": 7
      },
      {
        "rating": 5.0,
        "title": "Great product",
        "text": "I've been using Cybersonic for decades. My teeth don't feel clean without it.<br />My second handle/rechargable battery needed replacing, so I decided to try the Cybersonic 3. I was surprised how much lighter it feels. And I think the oscillation is faster, but I didn't read up on it to check. Same great result - really clean teeth. The timing indicator isn't something I wanted/needed, but doesn't bother me. I has basically ignore it. Hope this handle lasts as long as my previous ones.<br />I really like the charging base. I discarded the side attachments to hold extra brushes and accessories, which left me with a sleek, minimalistic charging base.<br />So far I'm really happy with my purchase & highly recommend this product/brand/company.",
        "verified": true,
        "helpful_votes": 3
      },
      {
        "rating": 5.0,
        "title": "Simply the best.",
        "text": "A system approach to oral hygiene that works for me, and the best oral health care product of its kind available. PERIOD!",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 3.0,
        "title": "Three Stars",
        "text": "OKAY",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "Gives great results for families.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Cybersonic",
    "tags": [],
    "price": 89.99,
    "position": 3,
    "page": 1
  },
  {
    "id": "prod_toothbrushes_150",
    "parent_asin": "B08DRP5229",
    "category": "Toothbrushes",
    "title": "SHNOKER Toothbrush,Ultrasonic Automatic Toothbrush,IPX7 Waterproof,Three Clearing Modes,Cartoon Modeling Design for Kids (Blue 3-6 Year)",
    "description": "",
    "rating": 3.9,
    "review_count": 1005,
    "features": [
      "【LOVELY CARTOON DESIGN TO ENHANCE THE FUN OF BRUSHING TEETH】 The cute cartoon design make this lovely automatic toothbrush attractive to all kids, they are excited to brush the teeth with this funny toothbrush, easy and fun for little brusher ages 3 and up. This help your kids be willing to brush teeth longer even develop healthy brushing habits.",
      "【IPX7 WATERPROOF】IPX7 waterproof sealing design is adopted, and babies can also use it when bathing. The product can be placed in a water depth of 1 meter and soaked for 15 minutes, and the product is still in normal use without being damaged.",
      "【FAST CHARGING】 The ultrasonic toothbrush is equipped with fast charging cable, which can be discharged and charged instantly. The LED lights on when USB charging is connected, and it only needs to be charged for 3 hours and can be used for 1 week. Safe, fast and convenient, easy to use at home or travel.",
      "【UNIQUE U-SHAPED DESIGN】 Ergonomic U-shaped brush head, suitable for the shape and mechanics of children's teeth structure. Soft pacifier grade silicone, soft brim around the teeth 360 degrees, providing a comfortable feeling of brushing, the original V-shaped cleaning path, effective deep cleaning, will not harm the gums, protect children's enamel.",
      "【MULTIFUNCTIONAL MODE】Our automatic toothbrush can promote the health of gums and teeth through different functional modes : 1. Strong mode for powerful teeth brushing; 2. Medium mode for comfortable teeth brushing; 3. Massage mode for gum massage.50 secs scientific timing for each brushing, it stops automatically, Parents don’t have to face to face to urge children to brush their teeth."
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "It came off",
        "text": "My daughter pull off the rubber part that it attached to the metal part. I have no idea if it was supposed to do that. She can still use it but I to help her get it out of her mouth at times. I need to see if I can have it exchanged for a new one. Its a lot easier to get her to brush her teeth she likes it and she is 4",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 1.0,
        "title": "Not worth it",
        "text": "My eldest has a difficult time with the sensation of anything against his gums.  This results in nasty plaque.  I was hopeful that this would be a solution but it's not.  Expensive let down.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 2.0,
        "title": "Worked great for 3 months",
        "text": "Worked great for 3 months. Then stopped working even though it was fully charged.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 4.0,
        "title": "Good 4 Already Clean Kid Teeth",
        "text": "Very easy and fun for toddlers who are learning to brush their teeth. Definitely must swish back and forth, for any actual cleaning to take place.<br /><br />Wouldn't recommend for children with chronic oral hygiene issues. The bristles on this brush are not meant for heavy cleaning.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Love these",
        "text": "My kids absolutely love these. The brush their teeth everyday without a fight. I love them they are small perfect for kid hands and super easy to use.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "SHNOKER",
    "tags": [],
    "price": 14.99,
    "position": 4,
    "page": 1
  },
  {
    "id": "prod_toothbrushes_199",
    "parent_asin": "B07S3241BL",
    "category": "Toothbrushes",
    "title": "Woobamboo Bamboo Toothbrush 4 Pack - Adult - Super Soft BPA Free Nylon Bristles - Eco-Friendly, Biodegradable, Compostable, Vegan",
    "description": "\"…This bundle includes (4) Adult Bamboo Toothbrushes with Super Soft Bristles …WooBamboo’s Super Soft bristled bamboo toothbrushes are designed for the eco-minded consumer that prefers a gentler bristle. They are either suffering from sensitivity issues, or simply like the lighter, cloud-like softness this particular brush provides. Like all WooBamboo brushes, it touts a beautiful handle made from a single piece of carved naturally-grown bamboo, containing NO toxins, glues, or paints.\"",
    "rating": 4.2,
    "review_count": 32,
    "features": [
      "This bundle includes (4) Adult Bamboo Toothbrushes with Super Soft Bristles",
      "Biodegradable craft paper packaging printed with soy based ink",
      "Sustainably Harvested bamboo",
      "Coated with vegan soy bean wax"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Arrived on time, in good shape.",
        "text": "I love the toothbrushes.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Soft bristles are gentle on gums!",
        "text": "I loved Woobamboo! before, but this time bought the extra-soft bristled toothbrushes. They are wonderful! I'm a senior citizen, so a lot of toothbrushes are just too rough on my old gums. These gently clean my teeth, and an added bonus of being biodegradable. Made by a responsible company and affordable!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Woobamboo",
    "tags": [],
    "price": 17.87,
    "position": 5,
    "page": 1
  },
  {
    "id": "prod_toothbrushes_168",
    "parent_asin": "B08QMC9HBW",
    "category": "Toothbrushes",
    "title": "Paw Patrol Electric Toothbrush and Paw Patrol Anticavity Fluoride Toothpaste 4.2 Ounce (Chase)",
    "description": "Your Paw Patrol fan will love this Paw Patrol Chase toothbrush and toothpaste set. As your kids grow up, their oral care needs change. So what better way to transition them to fluoride toothpaste than brushing with Paw Patrol Fluoride Toothpaste. The Paw Patrol Chase Spinbrush toothbrush has small soft bristles for smaller mouths. It’s also ergonomically designed to fit little hands perfectly.",
    "rating": 3.4,
    "review_count": 38,
    "features": [
      "HAVE FUN FIGHTING CAVITIES - Make the daily routine of brushing fun for your Paw Patrol fan with this Paw Patrol themed toothbrush and toothpaste set.",
      "ELECTRIC TOOTHBRUSH - Your child will enjoy using this Paw Patrol battery powered toothbrush featuring Chase. This toothbrush has small, soft-bristles for smaller mouths. It is ergonomically designed to fit perfectly into little hands for a comfortable grip.",
      "FLUORIDE TOOTHPASTE - Transition your little one to fluoride toothpaste with this Paw Patrol fluoride toothpaste. Your Paw Patrol fan will love the Fruity Bubble flavor!"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "The flavor is WRONG, too expensive. Don’t buy!",
        "text": "The flavor is WRONG. bought this for ridiculous markup because we’ve been looking for bubble berry. NOT the same as description or picture. Flavor is bubble fruit, which my kids hate. This is double the money of just buying the toothbrush and paste separately. I wish I read more reviews. DONT BUY.",
        "verified": true,
        "helpful_votes": 2
      }
    ],
    "store": "BCE Trends",
    "tags": [
      "Sponsored"
    ],
    "price": 20.31,
    "position": 6,
    "page": 1
  },
  {
    "id": "prod_toothbrushes_159",
    "parent_asin": "B084PPDHCX",
    "category": "Toothbrushes",
    "title": "PC6100 purple with 2pk Premium Plaque",
    "description": "",
    "rating": 4.6,
    "review_count": 83,
    "features": [
      "Gentle yet effective to whiten teeth in just 1 week vs. a manual toothbrush",
      "Protect your teeth with a pressure sensor that gently pulses to alert you when you're brushing too hard",
      "Always know when to replace your brush head for an effective clean with the brush head replacement reminder",
      "Superior Clean: clinically proven to remove up to 10x more plaque along the gum line and in between teeth than a manual toothbrush",
      "Flexible design: adjusts to the unique contours of your teeth to enable more surface contact and target plaque in hard-to-reach areas",
      "Gentle & Effective: soft, tightly packed bristles smoothly glide along the gum line, providing an amazing clean even without the perfect technique; Bristle stiffness feel: Medium soft"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Love",
        "text": "Leaves my teeth feeling like I left the dentist",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Philips Sonicare",
    "tags": [],
    "price": 136.98,
    "position": 7,
    "page": 1
  },
  {
    "id": "prod_toothbrushes_126",
    "parent_asin": "B08BC554KQ",
    "category": "Toothbrushes",
    "title": "Sonic-FX Replacement Electric Toothbrush Heads Compatible with Fairywill, Sonic-FX and SnapWhite for Adults and Kids | Soft, Long Nylon Bristles Sonic Replacement Toothbrush Heads (White, Pack of 8)",
    "description": "Ideal for Sonic-FX, SnapWhite, and Fairywill Electric Toothbrushes, these replacement toothbrush heads can be easily attached to the body with its twist and lock mechanism, ensuring to hold when brushing. The soft and different bristle lengths are specifically designed to provide more effective cleaning, ensuring no plaque build-up and efficiency for both adults and kids. It also comes in four different colors, so you know which one is yours. Each pack comes with 8 brush heads, making this product a cost and time-efficient alternative to replacing the sonic toothbrush throughout the year. From toothbrushes to whitening treatments, Sonic-FX is continually providing promising products that are both practical and convenient.\nNote:\nThese brush heads are only for vibrating toothbrushes and Not for rotating brushes.\nFeatures:\nVarying bristle lengths provide more effective cleaning\nVarying bristle lengths provide more effective cleaning\nExtra-long bristles effectively clean between the tooth\nExtra-long bristles effectively clean between the tooth\nSoft bristles, which are safer for enamel and gentle on gums\nSoft bristles, which are safer for enamel and gentle on gums\nNylon bristles for extra durability\nNylon bristles for extra durability\nDifferent colored rings\nDifferent colored rings\nOriginal, Sonic-FX Brand Toothbrush Heads\nOriginal, Sonic-FX Brand Toothbrush Heads\nOur motto is always \"\nQuality meets Affordability\n\", and \"\nCustomer Satisfaction Priority\n\". If you need new brush heads for your Fairywill, Sonic-FX, or SnapWhite toothbrush, these brush heads are the best option.",
    "rating": 4.6,
    "review_count": 2363,
    "features": [
      "𝐂𝐎𝐌𝐏𝐀𝐓𝐈𝐁𝐋𝐄 𝐖/ 𝐅𝐀𝐈𝐑𝐘𝐖𝐈𝐋𝐋, 𝐒𝐎𝐍𝐈𝐂-𝐅𝐗 𝐀𝐍𝐃 𝐒𝐍𝐀𝐏𝐖𝐇𝐈𝐓𝐄: Compatible with all Sonic-FX and SnapWhite toothbrushes. Compatible with Fairywill FW-507/508/515/917/959",
      "𝐕𝐀𝐑𝐘𝐈𝐍𝐆 𝐁𝐑𝐈𝐒𝐓𝐋𝐄 𝐋𝐄𝐍𝐆𝐓𝐇𝐒: Specially made for hard-to-reach spots, these toothbrush heads have soft and varying bristle lengths that are perfect to reach in-between each tooth for more effective cleaning.",
      "𝐇𝐈𝐆𝐇-𝐐𝐔𝐀𝐋𝐈𝐓𝐘 𝐌𝐀𝐓𝐄𝐑𝐈𝐀𝐋: Made of Dupont nylon bristles, offering extra durability to guarantee long-lasting usage. These toothbrushes provide a more effective solution than manual toothbrushes.",
      "𝐏𝐑𝐀𝐂𝐓𝐈𝐂𝐀𝐋 𝐀𝐋𝐓𝐄𝐑𝐍𝐀𝐓𝐈𝐕𝐄: These replacement brush heads are a great practical alternative instead of repurchasing the whole toothbrush since it is compatible with Fairywill, SnapWhite along Sonic-FX.",
      "𝐓𝐑𝐔𝐒𝐓𝐄𝐃 𝐌𝐀𝐍𝐔𝐅𝐀𝐂𝐓𝐔𝐑𝐄𝐑: As one of the most trusted brands in oral care and hygiene products, Sonic-FX provides its loyal customers quality oral care essentials that are both practical and convenient."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Replacement brush heads",
        "text": "I am pretty satisfied with these replacements.  It took me a while to find these because they are not the same brand as my toothbrush.  I do like these but wish they were a little stiffer.  They are really soft.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Perfect fit",
        "text": "Super fast delivery and packaged well.  Fit perfectly on my sonic toothbrush . Great value for the price",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "GreT price",
        "text": "Just great and better pro",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Perfect",
        "text": "Everything you need them for",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Sonic replacement toothbrush",
        "text": "Great value",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Sonic-FX",
    "tags": [
      "Sponsored"
    ],
    "price": 16.99,
    "position": 8,
    "page": 1
  },
  {
    "id": "prod_toothbrushes_062",
    "parent_asin": "B0BN4RJKS6",
    "category": "Toothbrushes",
    "title": "Better & Better Bamboo Sonic Toothbrush for Adults | Rechargeable Electric Toothbrush | Replaceable Bamboo Brush Heads w/Soft, Plant-Based Bristles | 5 Cleaning Modes & Long-Lasting Battery",
    "description": "",
    "rating": 4.5,
    "review_count": 24,
    "features": [
      "A Cleaner Clean and Brighter, Whiter Smile - Improve your brushing routine with Better & Better’s Bamboo Sonic Toothbrush for adults equipped with soft, natural, plant-based bristles made from castor bean oil. Our sonic toothbrush produces up to 38,000 microvibrations per minute for high polish and gentle clean. Choose from its 5 cleaning modes depending on your brushing needs.",
      "Smart, Seamless & More Powerful Cleaning - Our bamboo electric toothbrush for adults features a 2-minute dentist-recommended timer with 30-second interval pulses. Flaunt your unique smile with the help of the sonic toothbrush's 5 cleaning modes: cleaning (default) for removing plaque, whitening for improving surface color, polishing mode for brightening your front teeth, milder for gentle gum massage, and sensitive for a super gentle mode for sensitive teeth and gums.",
      "A Better Brushing Routine - The bamboo sonic toothbrush’s cleaning modes and plant-based bristles are safe to use on braces and dental restorations (fillings, crowns, veneers, or implants). Our electric toothbrush for adults is certified cruelty-free and comes in recyclable packaging.",
      "Designed for Optimal Brushing Experience - Our bamboo electric sonic brush comes with replaceable bamboo heads. The entire brush is waterproof, so you can use it in the shower. The long-lasting and rechargeable battery also makes this the perfect travel toothbrush to keep your routine tip top on the go. You only need to charge it every 30-40 days when your routine consists of brushing twice, morning and night.",
      "Better for You. Better for the Planet - We set out to make toothbrushes that are good in every way. Our unique natural bamboo brush heads create less waste when replaced. We prioritize the health of our bodies and our planet, which leads us to imagine entirely new ways of doing things. And as we minimize the ecological effects of our products and packaging, we create a better world."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Best toothbrush ever.",
        "text": "I’ve used Sonicare Diamondclean for years - but after trying this one, I’ll never go back. It’s gentler, cleans better, and less than half the price of Diamondclean. I love the bamboo, the soft bristles. The only thing I wish it had two buttons (one for on/off, one for the settings), and a wireless induction charging base.<br />But as is I still love it.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 4.0,
        "title": "Bamboo sonic toothbrush",
        "text": "Good, sonic (vibrations rather than spinning) toothbrush. I am sure it helps clean better than a manual one, but I would prefer a spinning head for myself.  It comes with only 2 replacement heads which deducts a star as I expect at least 4. It does comes with a toothbrush holder stand to recharge with a 30-40 day battery life. Many of these brushes only come with a ubs cable, so the included toothbrush holder is a great addition. Has a 2 minute timer as well as 5 cleaning modes.  This toothbrush is unique as it is made with bamboo making it a more natural product!<br /><br />Amazon will donate to your favorite charity! Use Amazon Smile (smile.amazon.com) when you order and Amazon will donate to the charity of your choice when you make a qualifying purchase. Check out how Amazon Smile works at https://smile.amazon.com/gp/chpf/about/ref=smi_se_rspo_laas_aas. My shopping is donating to my charity of choice; Unravel, at no cost to me! Unravel is a nonprofit organization working to spread knowledge about the grim realities of pediatric cancer and the devastating impact from the lack of funding. All monies raised by and for Unravel will go directly to the fight against pediatric cancer.",
        "verified": false,
        "helpful_votes": 1
      }
    ],
    "store": "Better & Better",
    "tags": [],
    "price": 69.99,
    "position": 9,
    "page": 1
  },
  {
    "id": "prod_toothbrushes_081",
    "parent_asin": "B098KT9657",
    "category": "Toothbrushes",
    "title": "Pyhralke Schallcare Replacement Brush Heads Fit for Braun Oral b, Precision Heads Compatible with Oral-B Pro1000/9600/5000/3000/1500/Genius and Smart Electric Toothbrush(4pcs)",
    "description": "",
    "rating": 4.4,
    "review_count": 241,
    "features": [
      "Compatible with Oral-B , Deep Sweep, SmartSeries, ProSeries, Triumph, Advance Power, ProfessionalCare, ProfessionalCare SmartSeries, Vitality Floss Action, Vitality Dual Clean, Vitality CrossAction, Vitality Precision Clean, Vitality Pro White, Vitality Sensitive, Vitality TriZone.(Attention: DO NOT compatible with oral b io)",
      "Schallcare brush heads, the bristles with bacterial protective function, which can prevent bacterial growth on the brush. Also with strong cleaning function, which can removes up to 3x more plaque along the gum line than a traditional manual toothbrush.",
      "Safe, healthy, and durable. Made with soft and flexible DuPont bristles and approved to meet official dental health and safety standards. At the same time, the production of brush heads uses a unique process technique, which greatly enhances the durability of the toothbrush head.",
      "The slightly longer bristles at both ends are designed to easily clean the oral blind area--every side of the innermost teeth, also clean the gap of teeth, for comprehensive cleaning, fresh breath, prevention of tooth decay.",
      "The soft to middle bristles protect teeth from harmful hard brushes and offer a more comfortable cleaning, better for your teeth and gum health. Side-to-side bristles sweep away plaque while the moving power tip penetrates hard to reach areas and fixed filaments help to whiten the enamel, reaching the most difficult areas."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Good, but take a bit to soften",
        "text": "The first time I used these they made my gums bleed. It takes a bit for the bristles to soften up. The bristles also tend to look a bit frayed after a few weeks which definitely doesn’t happen with the name brand ones.",
        "verified": true,
        "helpful_votes": 11
      },
      {
        "rating": 5.0,
        "title": "Every bit as good as the ones made by Oral-B",
        "text": "I've been using Oral-B electric toothbrushes for 15-20 years and have always purchased replacement brushes made by them.  This time I decided to see if I could save some money and give these a try, and I'm very glad that I did.<br /><br />The only difference I can see between the Schallcare ones and the ones sold under the Oral-B Sensitive Care label is that these fit tighter, which results in a surprisingly large reduction in the noise level, and of course they only cost 1/3 as much.  I've been using one the Schallcare brushes for about 6 weeks now and it shows absolutely no wear, so I think there's a good chance they will last every bit as long as the Oral-B brand ones.",
        "verified": true,
        "helpful_votes": 4
      },
      {
        "rating": 5.0,
        "title": "if it fits handle",
        "text": "works well",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Good price",
        "text": "Very satisfied with the replacement brushes",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Replacement tooth brush at great price.",
        "text": "Same quality as the original brush but much cheaper price",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Schallcare",
    "tags": [],
    "price": 5.99,
    "position": 10,
    "page": 1
  },
  {
    "id": "prod_toothbrushes_072",
    "parent_asin": "B0BTPSKNS8",
    "category": "Toothbrushes",
    "title": "SUNPRO 2 Pack Sonic Electric Toothbrush 6 Modes 42000vpm 8 Brush Heads, 2 Minute Built-in Timer (Black+Pink)",
    "description": "",
    "rating": 4.4,
    "review_count": 5,
    "features": [
      "【42000VPM HIGH VIBRATION】Vibration up to 42,000 strokes per minute,to drive fluid deep between your teeth and along the gum line for exceptional cleaning, effectively remove up to 100% more surface stains than a manual toothbrush.",
      "【6 MODES】-Supports 6 modes, Mild, Clean, Powerful, Massage, Sensitive, White, to suit different conditions of teeth and gums, so you can choose different modes according to your preferences and dentist's recommendations.",
      "【4 HOURS CHARGE LAST 60 DAYS 】After 4 hours full-charge can support 60 days long using.Sonic electric toothbrush comes with a USB charging cable for charging anywhere and compatible with any power source.",
      "【2 MINS SMART TIMER】Built-in Timer with 2 mins auto shut-off, every 30 seconds changing area reminder to develop a good brushing habit as dentists recommende,dgive you a total mouth clean.This electric toothbrush is IPX7 waterproof,can be used safely in the bath and shower.",
      "【WHAT YOU GET】 2 Electric toothbrush handles,8 DuPont toothbrush heads,2 USB cable and Instrucation Manual. If you have any questions during the purchase or use, please contact us, our customer service team will reply within 24 hours, and provide you with a satisfactory solution."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great toothbrushes",
        "text": "Great value! Love that they are rechargeable and comes with replacement heads. Battery lasts a long time too. I like that it has a 2 minute timer for my 7 year old. Pleased with this purchase.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "SUNPRO",
    "tags": [],
    "price": 94.99,
    "position": 11,
    "page": 2
  },
  {
    "id": "prod_toothbrushes_035",
    "parent_asin": "B09YMC56BF",
    "category": "Toothbrushes",
    "title": "SVITOO Infant Toddler Toothbrush, 2 Pcs Toddler Training Teeth Brushes with Thousands of Soft Bristles, Children Oral Care for Sensitive Gums for 12 Months to 6 Years Babies, Prevent Stuck Throat",
    "description": "",
    "rating": 4.3,
    "review_count": 53,
    "features": [
      "【SVITOO Baby/Children Toothbrush】Specially designed for babies and children aged 1-6 years. Food grade materials have passed FDA testing. Creative and lovely toothbrush is a gift for children",
      "【10000 Fine Soft Bristles - Soft Rubber Brush Head】the center of the brush head adopts tens of thousands of bristles, which is very soft and dense. It is our unique design, which can better clean the baby's teeth and mouth. The outer soft silicone brush head has the effect of massaging gums",
      "【Safety baffle】The bear shaped block can attract children, prevent the toothbrush from going too deep into the baby's mouth, prevent the brush head from lying flat on the table and keep it clean. This is creative toothbrush",
      "[easy to hold + suction cup] ergonomic design, suitable for female / male infants over 1 year old. The suction cup can make the toothbrush stand upright on the desktop or adsorb on the wall for convenient placement",
      "【Easy to Clean】Polymer nanomaterials can reduce bacterial reproduction and are easy to clean. You only need to wash with warm water after use. We recommend changing it once a month is better for your baby. Any questions, feel free to contact us."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Soft for gums and tiny teeth.",
        "text": "Cute little tooth brush for babies to learn with. Not going to hurt gums if they start to chew on it. Can see a two year old learning to brush well after tries as a baby with this safe brush.",
        "verified": false,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Love the design",
        "text": "Its so cute and the bristles are soft so its perfect for a toddler.",
        "verified": false,
        "helpful_votes": 1
      },
      {
        "rating": 4.0,
        "title": "Great size...",
        "text": "These toothbrushes are the perfect size for toddlers.  The bristles are soft and the handle is made of a combination of hard plastic and silicone, so it’s easy to grip.  The optional silicone guard is perfect for helping little ones learn how to control the brush.  And, each brush has a suction cup on the end of the handle, so it’s easy to stand them up in the bathroom counter.  My only issue is that one of the brushes got smashed during delivery and the silicone guard is bent inwards...it will probably pop out in time, so really only a minor issue.  Overall, nice infant to toddler toothbrushes!",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "One of my favorite toddler toothbrushes",
        "text": "I really love how theses have the guards. My nephew has special needs so while he's 8, he physically is like an infant. We are teaching him how to hold a toothbrush and brush his own teeth. This is great because he always puts too much in his mouth and ends up choking. If you have a new leader to brushing teeth this is most definitely will be your saving grace.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "SVITOO",
    "tags": [],
    "price": 5.99,
    "position": 12,
    "page": 2
  },
  {
    "id": "prod_toothbrushes_083",
    "parent_asin": "B085BFBYD3",
    "category": "Toothbrushes",
    "title": "Extra Super Soft Nano Toothbrush for Toddlers and Children by The Smiling Whale, Micro Fine Nano Bristles for Sensitive Gums for Baby and Kids, Duo Functions with Tongue Cleaner (Pink)",
    "description": "With 20,000 micro fine super soft bristles, this toothbrush able to deep clean and remove debris and plaques, and it has soft tongue cleaner on back of brush, ideal for children and adults who have sensitive gums and teeth. This toothbrush designed ergonomically with short handle, it is safe and easy to use for toddlers and children, and highly effective to store the oral health of you and your love ones. Product description: overall length id 4.3\"(11cm), handle size:0.8\"(2cm) ; Packing: 1x Ultra soft toothbrush",
    "rating": 4.5,
    "review_count": 150,
    "features": [
      "【 SUPER SOFT BRISTLES 】 This toothbrush contain 20,000 micro fine super soft bristles, ideal for sensitive gums and teeth.",
      "【 GENTLE ORAL HYGIENE CARE】With bristles which only at 80 μm in diameter, this toothbrush able to deep clean and remove debris and plaques, and it has soft tongue cleaner on back of brush. Ideal for children and adults who have soft and sensitive gums.",
      "【 SHORT AND SAFE GRIP HANDLE 】Designed ergonomically with short handle, it is safe and easy to use for toddlers and children, and highly effective to store the oral health of you and your love ones. Your child can even take over with the short-handled brush and try using it on her own.",
      "【 3 COLORS TO CHOOSE 】This lovely toothbrush come with three selection of colors, which are YELLOW, PINK AND BLUE.",
      "【 PRODUCT DETAILS 】 Overall length:4.3\"(11cm), handle size:0.8\"(2cm) ; Packing: 1x Ultra soft toothbrush"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Amazing!",
        "text": "My 1 year old would scream every time we brushed her teeth until we found this brush! It is amazing!!",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Perfect for infant teeth",
        "text": "Thrilled with the product quality and it’s the perfect size for tiny hands. Bristles are soft and gentle, and feel like they’ll hold up well!",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Nice",
        "text": "Exactly what I expected! Incredibly soft. I bought this to brush my cat's teeth because he's very sensitive and normal cat toothbrushes hurt him. He likes this one.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Dog Friendly",
        "text": "I like this toothbrush. My granddog hates having his teeth brushed. The other brushes hurt his gum tissue because he moves so much. He is much calmer when I use this brush.  Good buy",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Love this!",
        "text": "Love this and so does my toddler (2 year old) he lets me brush his teeth and I don’t worry about being too ruff bc it’s so soft",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Generic",
    "tags": [],
    "price": 7.99,
    "position": 13,
    "page": 2
  },
  {
    "id": "prod_toothbrushes_007",
    "parent_asin": "B0BR9ZFLMJ",
    "category": "Toothbrushes",
    "title": "G-Smile Eco-Friendly Bamboo Toothbrushes with BPA Free Nylon Bristles, in 4 Colors and Individually Packaged by Recyclable Paper Bag (Soft)",
    "description": "",
    "rating": 4.6,
    "review_count": 120,
    "features": [],
    "reviews": [
      {
        "rating": 5.0,
        "title": "i loved this toothbrushes and my guests loves it too",
        "text": "As a Airbnb host, i loved this toothbrushes and my guests loves it too.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 4.0,
        "title": "Good quality, inaccurate count",
        "text": "I purchased these to put in operation Christmas child boxes and to hand out to homeless people. They look relatively good quality, but there were only 143.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Good",
        "text": "Donated them to the homeless shelter through out church.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "G-Smile",
    "tags": [],
    "price": 36.89,
    "position": 14,
    "page": 2
  },
  {
    "id": "prod_toothbrushes_071",
    "parent_asin": "B0BYSP1RMQ",
    "category": "Toothbrushes",
    "title": "Initio Sonic Electric Toothbrush for Adults Rechargeable Toothbrush with Smart Timer 5 Modes 3 Brush Heads 40,000 VPM Motor Whitening Power Toothbrush IT959 (Navy Blue)",
    "description": "",
    "rating": 4.5,
    "review_count": 441,
    "features": [
      "[5 High-Performance Brushing Modes] Electric toothbrush with 5 modes of intelligence for adults and kids,including White, Clean, Sensitive, Polish, Massage to suit different conditions of teeth of gums. You can choose different modes for your electric toothbrush according to your gum conditions and preferences. Initio sonic electric toothbrush is also a perfect Valentine's Day gift.",
      "[Powerful Sonic Cleaning Effect] This electric toothbrush with the latest sonic technology delivers 40,000 strokes per minute.The sonic technology allows the fluid to gently clean between the teeth and the gum line, the Initio electric toothbrush cleaning effect is 10 times that of manual toothbrushes and 3 times that of ordinary electric toothbrushes. People who smoke or drink tea all the year round can also get brighter teeth by sticking with this electric toothbrush.",
      "[2 Minutes Smart Timer] The electric toothbrush built in smart timer control,pause every 30 seconds to remind the user to change the cleaning area. 2 minutes auto shut off as the brush time recommend by dentist. The rechargeable electric toothbrush can let you get the sweetest smile in the shortest time.",
      "[IPX7 Waterproof and Light Weight Design] Rechargeable electric toothbrush with IPX7 rated waterproof design, so you can safely use the electric toothbrush in the bath or shower. No worry about the water would enter the charge ports to short the battery life. Also,when in use this electric toothbrush, you can feel the comfort and lightness and experience the details of the electric toothbrush design.",
      "[Full Charging for 45 Days Using] This Sonic Electric Toothbrush can run for 45 days after eight hours of charging.The lightweight body design and USB charging interface make this electric toothbrush the best choice for travel-portable and convenient. Great for carrying and traveling. Also one of the best choices as a gift. Please kindly know that the package DO NOT include the AC Adaptor."
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Broke after 1yr",
        "text": "I purchased this toothbrush from another seller/company who is no longer selling this product. As you can see, the neck broke after about 1yr of usage.",
        "verified": false,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Great Electric Toothbrush",
        "text": "Very happy with this Sonic electric toothbrush. I like all the different speeds. Very simple and quick to charge and would be easy to travel with and charge. Nice snap cover for the brush making it easier to pack the brush for travel.  Timer mode works great encouraging me not to be in such a hurry brushing my teeth.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Lightweight brush that packs a punch",
        "text": "What I like:<br /><br />-lightweight and compact in size<br />-only one button to cycle through modes and turn it off<br />-comes with (3) brush heads<br />-includes USB power cord<br />-will fit in my toothbrush holder<br /><br />What I don't like:<br /><br />-need to buy power adapter to charge it<br /><br />This isn't a fancy sonic toothbrush. If you're looking for a basic electric toothbrush that's a step above the type you'd buy at the grocery store (that takes two AA batteries - you know the one), this will do it. The toothbrush cleaned my teeth well with a good amount of vibration of the bristles. I'm pretty pleased.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Toothbrush",
        "text": "[[VIDEOID:fa007684a8fa5379afdcdb30ceda64f4]] At first I couldn’t get over the vibration, but after using it a couple times I couldn’t get over how polished & white my teeth were! This toothbrush has become top tier in my dental hygiene. 10/10",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "5 Different modes",
        "text": "Works really well. It does feel weird since I’m not so used to using an electric toothbrush. Very convenient that it comes with 3 brush heads & usb cable",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Initio",
    "tags": [],
    "price": 29.99,
    "position": 15,
    "page": 2
  },
  {
    "id": "prod_toothbrushes_069",
    "parent_asin": "B07X5JBXNJ",
    "category": "Toothbrushes",
    "title": "Toothbrush Marker by CUPmarker - Set of 6 Reusable & Adjustable Toothbrush Labels for Standard Toothbrushes",
    "description": "Set of six (6) toothbrush markers by CUPmarker in assorted colors. No more mix-ups! Pick a color and slide it on to your toothbrush to make your toothbrush uniquely identifiable. These reusable toothbrush markers help to label and personalize toothbrushes of varying sizes.They are an excellent choice for home, travel, dorms and other group settings. Mix and match toothbrush markers to create a unique and personalized look or use individually.",
    "rating": 3.7,
    "review_count": 58,
    "features": [
      "Set of 6 toothbrush markers by CUPmarker (assorted colors).",
      "Stretches to fit on toothbrush handles of varying sizes .",
      "Our reusable toothbrush markers are made of food-safe materials.",
      "Low-profile minimalist label design offers excellent toothbrush grip and comfort.",
      "Personalize further by mixing and matching colors or writing on it using a permanent marker for large groups."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Worked for my purpose",
        "text": "My husband and I share an electric toothbrush and usually the toothbrush heads come with different colors but sometimes we get stuck with all the same ones so I wanted something else to mark them. They were a little small to fit on the oral b toothbrush head but I managed to get them on.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "CUPmarker",
    "tags": [
      "Sponsored"
    ],
    "price": 13.99,
    "position": 16,
    "page": 2
  },
  {
    "id": "prod_toothbrushes_018",
    "parent_asin": "B0BGXCF98P",
    "category": "Toothbrushes",
    "title": "Sonic Electric Toothbrush for Adults - 5 Powerful Cleaning & Whitening Modes with Soft Dupont Bristles, 2 Hours Quick Charge for 60 Days, IPX7 Waterproof Travel Portable Oral Dental Care Kit (Green)",
    "description": "",
    "rating": 4.4,
    "review_count": 70,
    "features": [
      "🦷【Smart Sonic Toothbrush】- Our electric toothbrush uses an ultra-powerful and industry-leading motor to drive the liquid between the teeth and deep into the gum line, effectively dissolving stains on the surface of the teeth. Provides superior cleaning by delivering soothing micro-pulses to improve gum health. Removes up to 10 times more plaque than a manual toothbrush, helps whiten teeth.",
      "🦷【5 Modes Ultra Clean】- The sonic toothbrush has 5 vibration modes, clean (mild), white (strong), polish (strong inversion frequency), massage (mild inversion frequency) and sensitive (soft). You can choose stronger or lighter modes according to different oral and gum conditions. Get healthier gums, fresher breath and whiter teeth with this low-noise, lightweight sonic toothbrush.",
      "🦷【Smart Timer Reminder】 - The electric toothbrush has a standard 2-minute brushing timer to ensure scientific brushing time. Pausing every 30 seconds to remind you to change and move on to the next brushing area, the smart toothbrush helps you develop good brushing habits. And the rechargeable toothbrush has an automatic memory function, which can record the mode used when it was turned off last time.",
      "🦷【Large Battery Capacity, IPX7 Waterproof】- The long-life rechargeable toothbrush has a battery indicator light, has a low battery reminder and automatically cuts off the power when fully charged. The large battery capacity can be used for up to 60 days in just 2 hours with fast charging (2 times a day). The IPX7-rated fully sealed charging port is more secure and waterproof, and can be used in bathtubs and showers.",
      "🦷【Gift Box Packaging Included】- Our electric toothbrush comes in a premium gift box packag. Includes 1 Sonic Electric Toothbrush, 2 DuPont Brush Heads, 1 Charging Cable, 1 Travel Case for Electric Toothbrush Handle and Brush Heads. You can also find detailed instructions and a support contact manual. Perfect as a gift for your family and friends.",
      "🦷We provide you with 1 year warranty service. If you have any questions, please contact us first, we will provide you with satisfactory customer service within 24 hours."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Brush your teeth",
        "text": "[[VIDEOID:3fb7df8324b736c48355f08468ae1f62]] You’ve got to brush those teeth.  Make them all squeaky clean !<br /><br />This seems like a standard electric toothbrush<br /><br />I like the design and think it looks nice<br /><br />It has a good feel to it overall and i thought the different settings were nice",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Superior Brushing Experience",
        "text": "This electric toothbrush is the best I've ever used. It charged quickly and lasts. It is comfortable in my hands through the entire brushing process. It has average buzzing sound. There are multiple intensities of bruising power for different parts of my mouth. My teeth went from obvious coffee drinker to noticeably whiter and healthier. The bristles are gentle regardless of which setting I used. The narrow head allows me to easily brush my back teeth and gums.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Absolutly love this color",
        "text": "i have never had so many people fight over these!  great color and design!  never seen a green toothbrush and clearly noone else has either lol  works great!",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Sonic is the best choice",
        "text": "This is an excellent gift for someone or yourself<br />Comes in a very nice black box<br />travel case too",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Works well",
        "text": "Perfect for travel- works well, love the 5 speed option and quick charge.  Gets the teeth sparkly and breath fresh!  Easy to use and charge.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "SVK",
    "tags": [],
    "price": 32.99,
    "position": 17,
    "page": 2
  },
  {
    "id": "prod_toothbrushes_143",
    "parent_asin": "B096LQ9752",
    "category": "Toothbrushes",
    "title": "Etravel Travel Toothbrush Case And Cover - Luxury Toothbrush Holder, Portable Travel Organizer, Camping Supplies, Electric Toothbrush Case For Travel - 4 Colors [Navy]",
    "description": "Etravel Toothbrush Case",
    "rating": 4.2,
    "review_count": 51,
    "features": [
      "【LUXURY DESIGN】: High-end quality, high-end design, all at an affordable price. No more cheap and thin travel cases and toiletry bags. Treat yourself and travel in style, great for both men and women.",
      "【PORTABLE AND SPACE-SAVING】: Compact and portable travel size design with practical storage space to keep all your items organized in one place. Fits perfectly into backpacks, handbags, carry-ons, luggage, etc.",
      "【RELIABLE MATERIAL】: Made of high quality and environmental friendly PP material for a sturdy yet lightweight design. Double coated for high temperature and odor resistance to keep your toiletry clean and smell-free.",
      "【CONVENIENT】: Never forget your travel essentials again! No more cheap hotel toothbrushes or toothpastes. Perfect for hotels, airports, gyms, camping trips, sleepovers or simply for daily use at home!",
      "【PERFECT GIFT】: Everybody loves to travel, nobody likes to pack, make their lives easier by gifting them the Etravel Luxury Toothbrush Case. Perfect for all ages and gender!"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Difficult to open.",
        "text": "Just returned this item. Trying to open this container is almost impossible. To open one has to turn it and pull. When doing this it makes a terrible squeaking noise. I don't understand why so many people gave this a good review when it is so bad.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Easily fits our 2 Sonicare bases w/the brushes",
        "text": "It also splits into 2 cups which is a nice feature, so we don't have to use the glasses in the hotel room as we don't know how clean those glasses are.  It's a nice weight of plastic, and the blue color is rich looking.<br /><br />The price is a bit on the higher side, but it's very good quality.<br /><br />All in all, I think this will be a very handy travel tool!",
        "verified": true,
        "helpful_votes": 2
      }
    ],
    "store": "ERV",
    "tags": [],
    "price": 17.99,
    "position": 18,
    "page": 2
  },
  {
    "id": "prod_toothbrushes_157",
    "parent_asin": "B08YRRFJD8",
    "category": "Toothbrushes",
    "title": "Kids Ultrasonic Electric Toothbrush, U Shaped Rechargeable Automatic Toothbrushes with Replacement Brush 6 Cleaning Mode Smart Timer 360° Sonic Dental Care for Ages 2-7 Child (Blue)",
    "description": "",
    "rating": 4.1,
    "review_count": 83,
    "features": [
      "U-shaped Brush Head: Ninety percent of children aged 2-7 years refuse to brush their teeth. Our upgraded version of the electric toothbrush is designed with a astronaut pattern & U shaped brush head to stimulate children's interest in brushing teeth and develop kids healthy brushing habits. The package comes with a replacement toothbrush, and the u-brush is gentle on the gums and enamel.",
      "6 Automatic Cleaning Modes: Kids electric toothbrushes with up to 5000-20000Hz sonic vibration per minute for comprehensive cleaning of teeth. Can choose from the strong mode for powerful teeth brushing, Comfortable mode, among others. All the different modes are timed to make brushing for kids easy.",
      "IPX7 Waterproof: Toddler electric toothbrush has IPX7 waterproof sealing design, the entire toothbrush can be rinsed with water, it also can be used in the shower. The toothbrush head is removable and replaceable. You can crop as needed.",
      "Rechargeable: Kids toothbrushes equipped with rechargeable battery, USB charging to support brushing for 7-10 days with just 2 hours charging; It is portable and rechargeable, fitting for home or travel use.",
      "45s Smart Timer Control: the 45-second timer control function can educate children to brush their teeth at the recommended time, which can complete tooth cleaning more scientifically. If you have any problems about toothbrush, please contact us by email."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Toddler loves this.",
        "text": "We use this to help brushing teeth during the daytime a breeze, as our 3 year old can do it himself. Then at night, do his teeth ourselves. It's come in very handy!",
        "verified": true,
        "helpful_votes": 1
      }
    ],
    "store": "KRX",
    "tags": [],
    "price": 29.99,
    "position": 19,
    "page": 2
  },
  {
    "id": "prod_toothbrushes_004",
    "parent_asin": "B077H68HM2",
    "category": "Toothbrushes",
    "title": "PerioSciences White Care Oral Care Kit - Toothpaste, Mouthwash, Gel",
    "description": "",
    "rating": 4.4,
    "review_count": 127,
    "features": [
      "For your oral health -​​ PerioSciences Whitening Oral Care System is a three-product system for daily use by individuals who undergo peroxide-based professional whitening or strips. The product trio can make teeth even brighter, soothe soft tissue, and restore pH balance in the mouth.",
      "Natural ingredients - This dental care kit is made using our signature antioxidants and botanicals such as Phloretin, perilla seed extract, and hesperetin. The whitening toothpaste contains plasdone along with grapefruit seed extracts and micro-minerals to gently polish and thoroughly cleanse surface stains while removing unhealthy build-up.",
      "Dentist recommended - PerioSciences has worked with dentists for over 10 years to perfect our formula containing scientifically proven ingredients that focus on the mouth's natural defense system. Our products are recommended and used by over 1000 dentists nationwide.",
      "Easy to use - Brush teeth with AO ProToothpaste. Rinse with 1 tsp of AO ProRinse for up to 1 minute then spit out. Apply a pea-sized amount of AO ProVantage Gel to gums using a fingertip or cotton swab, let gel dissolve, then spit out. Do not eat or drink for 30 minutes after application.",
      "Redefining Oral Care with Antioxidants - PerioSciences believes in harnessing the power of nature using antioxidants and science in a novel dual approach by using ingredients known to have properties that keep your oral health and your smile at its best."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great",
        "text": "This product works well. Although pricey, so worth it to save your teeth.",
        "verified": true,
        "helpful_votes": 4
      },
      {
        "rating": 5.0,
        "title": "It is recommended by my dentist!",
        "text": "Use it daily and keeps my oral implants clean and healthy!",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "cleans my teeth well",
        "text": "Love this set, it cleans and freshens my breath.  My teeth feel cleaner longer than with regular toothpaste.  My breath stays fresh all day.  the mouthwash does not burn and the paste is gel like and it does not taste good or bad.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Synergistic formulation",
        "text": "Excellent at controlling bad breath.<br />Especially for those of us who have a dry mouth, be it through illness or medications, I can tell you that this product is excellent and that area.<br />I used it during a time when I also had some mouth irritation. I feel that it helped to heal without any sting.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "great set of premium oral care products",
        "text": "It seems like a lot of oral care companies are now going more high end, as I am starting to see toothpaste for over $10 when you can get \"normal\" toothpaste at the drugstore for $1-$2 (with a coupon). I was drawn to this because it is fluoride free. The toothpaste is nice and minty fresh, my mouth felt clean and fresh afterwards. I know that the brownish colored toothpaste may bother some people but I have used herbal toothpaste before so no color is \"weird\" or off limits for me - as long as they taste fine. There's even a few brands out there that has black colored paste! I really like the mouthwash as well and I'm surprised it is alcohol free because I feel like it does as good of a job as an alcohol one that I just recently purchased - minus the burn. My mouth just smelled and felt amazing after using both. I wasn't as fond of the dental gel as I found it useless and not something I would want to use much of. Overall this is a very nice set of oral care products and I would highly recommend the toothpaste and the mouth wash. I personally would repurchase the toothpaste and mouthwash - I hope they have a set with just those two items.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "PerioSciences",
    "tags": [],
    "price": 69.5,
    "position": 20,
    "page": 2
  },
  {
    "id": "prod_toothbrushes_109",
    "parent_asin": "B076XVT7ZC",
    "category": "Toothbrushes",
    "title": "Extra Soft Toddler Toothbrush & Training Toothpaste Combo Pack Tom's Of Maine 1.75 oz Pack",
    "description": "The toothpaste included here is a clear gel that gently cleans their little teeth and gums without artificial flavors, colors or preservatives. It has great-tasting, mild fruit flavor that toddlers will love brushing with again and again. The extra soft toothbrush is the perfect size for the littlest brushers with a simple design to clean away plaque and food! The handle is 99% and bristles over 60% made from renewable castor plants. It's made from BPA-free #7 plastic with bristles that are dye-free and a handle colored with mineral based pigments.",
    "rating": 4.5,
    "review_count": 68,
    "features": [
      "Tom's Of Maine"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Granddaughter loves this toothpaste",
        "text": "Granddaughter loves this toothpaste",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Safe",
        "text": "Safe. Toddler likes flavor. Good sized brush for toddler to hold and practice with. Brush works and is soft. Toothpaste is clear, not dyed. Came as advertised.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "The toothbrush bristles didn't hold up great to a toddler",
        "text": "The bristles got frayed and wonky fast and she wasn't even too crazy with it",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Smells great",
        "text": "It’s new tooth paste for my little so she was afraid it world taste nasty. Right when she opened the toothpaste she said mommy it smells good and she was whiling to try to brush her teeth. So far no complaints, she loves her new toothbrush as well.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Tom's of Maine",
    "tags": [],
    "price": 11.32,
    "position": 21,
    "page": 3
  },
  {
    "id": "prod_toothbrushes_146",
    "parent_asin": "B009PNN8BQ",
    "category": "Toothbrushes",
    "title": "Sensodyne MultiCare Soft Toothbrush (Color May Vary) Newly Improved Design of Sensodyne Precision Soft Toothbrush",
    "description": "1 piece of Sensodyne MultiCare Soft Toothbrush For effective cleaning of your teeth and gums, we recommend twice daily brushing with a fluoride toothpaste and a Sensodyne toothbrush. Warnings and Precautions Children under 6 years should be supervised during brushing. Do not allow bristles or toothbrush to be chewed. It is recommended that toothbrushes are replaced every 3 months",
    "rating": 4.4,
    "review_count": 109,
    "features": [
      "One high quality soft toothbrushes by Sensodyne",
      "The newly improved design called Multicare as replacement of previous Precision Toothbrush;",
      "Multicare toothbrush with same silky bristles for gentle cleaning",
      "Domed shaped small head design"
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Four Stars",
        "text": "soft and good",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "great for small mouth.  Bristles last long.",
        "text": "Great for small mouth.  Bristles last longer than other toothbrush (Oral-B or Colgate).",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Very hard to find lately but very good",
        "text": "Very gentle toothbrush!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Best basic toothbrush, hands down.",
        "text": "It's a shame they stopped selling these in America. The smaller head size is perfect for getting the hard-to-reach back of the molars, and the super soft bristles are great if you have any issues with gun recession. Here's hoping Sensodyne recognizes that Americans would buy these again if they sold them here.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "My Favorite Toothbrush",
        "text": "Small head and soft bristles.  Cleans everything thoroughly!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Sensodyne",
    "tags": [],
    "price": 18.38,
    "position": 22,
    "page": 3
  },
  {
    "id": "prod_toothbrushes_063",
    "parent_asin": "B00QL330K2",
    "category": "Toothbrushes",
    "title": "Violife VS2T705 Slim Sonic Toothbrush, Garnet Shimmer",
    "description": "The slim sonic brings a whole new dimension to sonic toothbrushes, merging fashion, ease of use, and best of all, its slim size make it a perfect on-the-go companion. It's sleek, compact and truly portable with a snap on vented mascara style cap keeping your toothbrush clean and dry. Bring the slim sonic toothbrush everywhere, at 6.5 inch high and 2 ounce it will fit in your purse, cosmetic case, backpack or briefcase for a healthy, sexy smile anywhere anytime.",
    "rating": 4.2,
    "review_count": 155,
    "features": [
      "22,000 brush strokes per minute at the push of a button; A true sonic toothbrush preferred by dentists vs regular electronic toothbrushes producing 7,500 brush strokes per minute",
      "Brush head is replaceable; Bristles are soft to medium",
      "Includes slim sonic, 2 brush heads and 1 AAA battery",
      "Ready to use right out of the box",
      "Great gift for anyone who brushes their teeth"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Lacks power",
        "text": "China makes some good products.  This isn't one of them.  How they got away from calling it a &#34;Sonic Toothbrush&#34; is a crime.<br />  Phillips Sonicare mades a great electric toothbrush.  Violive is less effective than manual brushing by far.  Don't waste your $$$.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Sonic travel",
        "text": "Great for travel!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "Stopped working almost immediately",
        "text": "The electric part of this toothbrush stopped working almost immediately. It works OK as a normal toothbrush, just not worth the extra money.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "Great item for travel or hand bag",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Compact",
        "text": "Wish there were different settings but it works great and does what it is-a toothbrush. Perfect for traveling with. Hope the battery life is good!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "VIOLIFE",
    "tags": [],
    "price": 39.99,
    "position": 23,
    "page": 3
  },
  {
    "id": "prod_toothbrushes_123",
    "parent_asin": "B09KP4GV1G",
    "category": "Toothbrushes",
    "title": "Ooak Toothbrush, Tapered V++Max Soft Bristles, 4 Pack",
    "description": "Ooak 4 pack Standard V++ Max Light - Multiple ColorsTapered V++Max bristles offer a unique design that simultaneously cleans teeth and removes plaque along the gum line. Outer bristles are positioned to gently stimulate gums for an overall healthier mouth. Dental Professional Recommended",
    "rating": 4.4,
    "review_count": 93,
    "features": [
      "Ergonomic bristles clean teeth and gums simultaneously",
      "Reduces plaque and cleans the gum line",
      "Tapered bristles",
      "45 Degree Outer Bristles",
      "BPA Free"
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Huge Brush Head, Might Take Some Getting Used To.",
        "text": "I got these in the mail today and am mixed on them.  For one, I was instructed to do more brushing along the gum line for gum health, so these seem perfect.  I also really like that they are super soft bristles and are pretty gentle on that gum line, however, the brush head is huge and takes a little getting used to.  I have a big mouth and kind of wonder how this would work on a child or petit adult.  I was very happy with the brushing I got and I think I will be using these brushes exclusively in the coming months and will see how they went, once the coronavirus lockdown is over and dentists are back to work.",
        "verified": false,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Very cute",
        "text": "These were very cute!<br /><br />I was pleased with these toothbrushes. I think they did a good job at getting my daughter's teeth cleaned. They felt good in her mouth. I thought they worked well.<br /><br />I have been happy with this brand. We have bought dental products for a long time. They were easy to use. Teeth felt good after it. They last a while. They are a quality product. I would recommend it.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Will Take Getting Used To...",
        "text": "I was interested in trying out these toothbrushes, which I've had recommended to me by a couple of friends.  They're definitely weird in the beginning.  When you're used to a bit of coverage as you brush, having the thin strip down the middle and then on either side is a little odd.  I kept feeling like I had to rotate the brush more, which. might be a good thing?  It seems to clean as well as my normal toothbrush, but it is going to take time to be comfortable with.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great beginner toothbrush",
        "text": "Great beginner toothbrush! The bristles are really soft so great for someone just getting started. I used one in my almost 5 yr old and the other on my almost 2 year old. Both worked great and were soft enough for them.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Super soft!",
        "text": "I have a niece that hates brushing, and doing so is a pain. The design of this is unique. It has a V shaped head to reach the teeth and gums at the same time. Comes in a pack of 2 so the two will last six months. Has a wider handles for little hands.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Ooak",
    "tags": [
      "Overall Pick"
    ],
    "price": 10.61,
    "position": 24,
    "page": 3
  },
  {
    "id": "prod_toothbrushes_127",
    "parent_asin": "B07SLTPSYG",
    "category": "Toothbrushes",
    "title": "grabease Double-Sided Toothbrush for Ages 6 Months to 4 Years, Soft Bristles & Choke Protection Shield, BPA-Free, 1 Pack, Yellow",
    "description": "",
    "rating": 4.4,
    "review_count": 23,
    "features": [
      "INDEPENDENT TOOTHBRUSHING: Introducing our game-changing toothbrush designed for independent toothbrushing in babies, toddlers, and preschool kids aged 6 months to 4 years! With its two-sided design, this toothbrush encourages a positive approach to oral hygiene. The pack includes one double-sided toothbrush that's perfect for little hands, and a silicone finger brush for gentle gum massage. This toddler toothbrush is ideal for a child's first toothbrush, making dental care fun and easy.",
      "DOUBLE-SIDED TOOTHBRUSH: Our toothbrush is designed to give your child a dazzling smile in no time! The innovative, tapered bristles on both sides of this brush offer maximum contact with teeth - perfect for easily-distracted little ones. Plus, a bonus finger toothbrush is included, ideal for infants, and kids experiencing sensory or sensitivity issues. Ensure your child's dental care starts off strong with our versatile brush set.",
      "SOFT BRISTLES & CHOKE PROTECTION: Our patented design ensures a safe, mess-free tooth cleaning experience for both toddlers and parents. With a built-in choke barrier, the Brush prevents over-insertion and gagging. The soft, flexible bristles are gentle on tender gums and new baby teeth. This versatile toothbrush is a must-have for your baby's first dental care kit - perfect for toddlers, first-time brushers, and those transitioning from finger toothbrushes.",
      "EXPERT APPROVED: Specially designed for infants and toddlers, our patented toothbrush has the seal of approval from top pediatric dentists. With endorsements from the American Academy of Pediatric Dentistry, you can trust that our product is perfect for your child's needs. Remember to replace every 3-4 months for optimal oral hygiene. Shop with confidence, as our brushes ensure a safe, effective start to your baby's dental journey. Order spares or stock up now!",
      "CERTIFIED SAFE: Meticulously lab-tested to meet the most stringent USA safety standards for your baby's wellbeing. Our toothbrushes are 100% BPA, lead, and phthalate-free, ensuring your child's safety as they learn proper oral hygiene. Guide your child with our double-sided toothbrush designed specifically for their needs - from their first tooth to confident self-brushing as a toddler. Create healthy habits under your loving supervision with Grabease."
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "Not a primary toothbrush",
        "text": "It’s hard-to-impossible to clean the front of my 18 month olds teeth with this. It’s too big. I can use a different brush for that, and then give this to him to “play with” for a few minutes. He makes gagging sounds but it is safe, of course; it’s just much bigger than other baby brushes. I’d save for older toddlers and even then it might be hard for fronts of teeth.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 4.0,
        "title": "Cheaply made",
        "text": "Liked it but bristles got kind of funky quickly..",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great",
        "text": "Great baby’s first toothbrush",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "So far so good.",
        "text": "baby likes this, but i feel that it's a little bit on the shorter side. It does get the job done: cleaning teeth!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "like, but its not love",
        "text": "we've been using this for about a few weeks and it looks like we've had it for a year- its frayed pretty bad :(<br />**update- we trashed it and bought the cheaper ones. its not worth the price if its only going to last 2 weeks.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "grabease",
    "tags": [],
    "price": 10.99,
    "position": 25,
    "page": 3
  }
]