[
  {
    "id": "prod_smartwatches_146",
    "parent_asin": "B0B1M8C145",
    "category": "Smartwatches",
    "title": "LFUTARI Smart Watch Compatible with iPhone and Android Phones, Fitness Tracker with Heart Rate Monitor, Sleep Monitor & Blood Oxygen Saturation, 5ATM Waterproof Smartwatch for Women Men - Black",
    "description": "※※※Please carefully read the User Manual before using it. Any questions, please feel free to contact the seller for help. (Go to Your Order, Find the order ID in the list, Click 'Contact with us'). ※※※ 【14 Sports Modes】 Including Outdoor Run, Outdoor Walk, Outdoor Cycle, Indoor Run, Indoor Cycle, Hiking, Yoga, Rowing Machine, Elliptical Machine, Dynamic Cycling, Cricket, Pool Swimming, Open Swimming and Others. 【Sedentary Reminders】 Reminds you to stand up and move when you are busy at work or sit for a long time. 【Alarm Clocks】 You can set up to 10 alarms easily for everyday tasks such as waking up, appointments, and more. 【Deep Breath Guide】 Our fitness watch can guide your breathing and help you find moments of calm throughout the day, making you feel relaxed. 【Control your Music】 You can control the up/down song, volume up/down of the current player directly through the watch, it's helpful when you are on the go or when your phone is not at hand. Smart Phone System Requirements iOS 11.0 & higher Android 6.0 & higher Bluetooth 4.0 & below Specifications Sync: Bluetooth 5.0 Screen: 1.3\" TFT LCD Battery Capacity: 210mAh Working Voltage: 5V-500mA Working Temperature: -10℃ to 40℃ Weight: 1.27oz (36g) Waterproof Rating: 5ATM Working Time: 5-7 days What's in the Box? Smartwatch with bands  Charging cable User manual Quick start guide ※※※Please note: Smart watch data cannot be used for medical purposes. The monitoring data is for reference only. If you need medical help, please contact a professional doctor.※※※",
    "rating": 4.2,
    "review_count": 7,
    "features": [
      "【Smart Watch for Men and Women】Features a 1.3-inch TFT-LCD full touch screen with a simple and vivid interface. 5 levels of brightness are available so you can easily view the screen in sunlight, and it will auto adjust brightness at night with night mode on. The screen lights up automatically when you lift and turn your wrist. Skin-friendly and soft bands fit different wrist sizes.",
      "【All Day Activity Tracking】Supports 14 sports including walking, running, cycling, yoga, swimming and more. Accurately record all-day activities such as steps, distance, calories burned, miles walked, active minutes. Connect your GPS on your smartphone to see your real-time pace and distance during your outdoor activities and record your workout route map in the app.",
      "【Healthy in Every Day】the latest advanced sensor for accurately monitor your real-time heart rate, blood oxygen (SpO2) level. Auto-track analyze your sleep quality(deep sleep, light sleep and wake up time) to help you get a better understanding of your health and and make reasonable adjustment on your lifestyle.",
      "【5ATM Waterproof & Long Battery Life】Enjoy up to 7 days extra-long battery life, and our fitness tracker watch is designed with 5ATM waterproof, which means you can wear it without worries even while swimming. This watch also has many pratical tools such as alarm clock, music controller, deep breathing guide, sedentary reminder, stopwatch, timer and more.",
      "【Smartwatches for Android IOS Phones】Compatible with most iOS 11.0 and Android 6.0 above, Bluetooth 4.0 below smartphones. Download and install our custom app (please check page 5 of the manual for details), bind this smartwatch to your phone, you can receive alerts of calendar, incoming calls, SMS, APP notifications and SNS (Messenger, WhatsApp, Skype, Twitter, etc) and preview the messages, never let you miss anything important things (note: you can't reply to messages or make calls).",
      "【Multiple Dials & Custom Watchface】this smartwatch itself comes with 3 default dials, you can change it via watch's setting page. Also there are 14 dials in the dial gallery in our custom app, you can go download and install them to your watch at any time, and you can also choose a photo from your phone album as the background of your watch."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Useful smartwatch",
        "text": "Battery life is good! Lasts as long as advertised. BPM seems accurate. I can manage my basic music controls. The watch face is a bit small. This would be great for a child. The app is the true star and it connects to Google Fit.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "LFUTARI",
    "tags": [],
    "price": 35.99
  },
  {
    "id": "prod_smartwatches_106",
    "parent_asin": "B09H2N93K2",
    "category": "Smartwatches",
    "title": "Dirrelo Smart Watches for Women, 2022 Smart Watch Compatible with iPhone Samsung Android Phones, IP68 Waterproof Smartwatch with Blood Oxygen/Heart Rate Monitor/Sleep Tracker, Pink & Mint Green",
    "description": "",
    "rating": 4.1,
    "review_count": 274,
    "features": [
      "✔️【Blood Oxygen & 24/7 Heart Rate & Auto Sleep Monitor】Auto-track your real-time Heart Rate, Sleep quality (Light Sleep, Deep Sleep, Awake Time), and monitor your blood oxygen (SpO2) level very well. Provides professional suggestions and comprehensive analysis via the \"GloryFit\" APP to help you develop a healthier lifestyle.(Note: There is no BP monitor)",
      "✔️【360*360 High Pixel & 100+ App Watch Dails】Dirrelo new round smartwatch with 1.32 inch, 360*360 high pixel covered an aluminum alloy frame full touch screen, so sturdy and light to wear.Clear pixel brings you ultimate visual enjoyment. You can also take photos or upload your personal photos to customize the watchface, supports wrist lift to wake up the screen, very convenient to use",
      "✔️【IP68 Waterproof & 13 Sport Modes】Dirrelo fitness watch with industry-leading IP68 waterproof technology, which allows you to wash with no worries. Supports 13 sport modes, such as: Running; Walking; Cycling;Climbing; Spining Bike; Yoga; Skipping; Gymnastic; Badminton; Ping-pong; Boating; Sit-ups; Free;. It gives you more details into your body activities and tracks all your workout data (steps, pace, distance, calories burned), to help you exercise scientifically and achieve fitness goals",
      "✔️【Multi-Functions & 330mA Long Battery 】 Many smart functions, such as steps, calories, alarm clock, weather forecast, sedentary reminder, calls reminder, SMS and social apps notifications, stopwatch, timer, music control, remote camera, find your phone, women's menstrual cycle, adjustable brightness, raise hand to awake, goal achieved reminder and soon. Large 330mAh battery capacity with full charge (2.5 hours) supports 7-15 days of working time and 30 days of standby time",
      "✔️【2 Different Color Bands Provided & Wider Compatibility】We provide 2 sets of bands in different colors for your daily wear and replacement. The watch compatible with Android(5.0 above), iOS(9.0 above), smart phones. You can preview SMS messages, get a call reminder, and App notification, contains Messenger, Skype, Facebook, Whatsapp, Instagram, Twitter, LinkedIn, Mail, Snapchat, WeChat. Support set \"do not disturb\" on watch【Note: The watch can't make call or text message 】"
    ],
    "reviews": [
      {
        "rating": 2.0,
        "title": "Nice resolution",
        "text": "I bought this watch because of the high-resolution display.  And that's what I got, no more, no less.<br /><br />Upon first impression, I can tell the display has crisp graphics.  The touch screen is responsive.  The processor is fast.  Overall, the phone itself is nice.<br /><br />The app, on the other hand, is awful.  It is intuitive, but it loses Bluetooth connectivity without reason.  This is the only app that I've seen that will move forward and backward during a dial sync.  When I switch to certain dials, the progress bar will reach 61%, then count back down to 60%, then 59%, then start going back up.  It's nice to see honesty in an app, but it's just strange.<br /><br />I didn't test notifications from other apps, but no SMS text messages came through.  The setup is simple and easy with SMS notifications settings on its own section.  But once set up, no messages came through.<br /><br />Battery life?  What battery life?  After a fully charge, this watch drained to 90% in the 15 minutes I used to overlook the features and set up the app.  This from a 330mAh battery.  At this rate, the battery will be depleted in less than two hours.",
        "verified": true,
        "helpful_votes": 9
      },
      {
        "rating": 1.0,
        "title": "Junk",
        "text": "What a piece of junk. The instructions don't match the watch or the Amazon description and is written in awful broken English. And the app--- AWFUL. Navigation is bad, the English on the app is even worse than the instructions. I'm seriously concerned that downloading the app has somehow compromised anything on my phone. While I understand Amazon is a gigantic company that can't police every single item for sale, this is just BLATANTLY bad. In case my review isn't already clear, DO NOT BUY.",
        "verified": true,
        "helpful_votes": 8
      },
      {
        "rating": 3.0,
        "title": "Great watch for the price",
        "text": "It was very difficult for me to set up this watch until I scanned the scan code from the pamphlet. The directions weren't easy. I think I would like a watch a little smaller but I like the shape and bands.  The price was great. I'm still not sure about the sleep mode, nothing seems to be registering. Steps are showing up which is cool, BPM is registering. Still figuring it out. Arrived promptly.  Additional info: the watch is NOT tracking my erratic sleep pattern, which I really needed it to do. I also found the size of the round watch intrusive to my long sleeve shirts and arm. Loved the pink and green bands and the color of the watch face. Steps are also not being accurately recorded. So sad, really had high hopes for this.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Worth the money n saved my life",
        "text": "Love the feminine color. Easy to see. Helps me keep track of certain health irregularities as they happen therefore possibly averting a health emergency. Ty for having an ingenious machine in such a lovely and compact device.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Dirrelo",
    "tags": [],
    "price": 36.99
  },
  {
    "id": "prod_smartwatches_029",
    "parent_asin": "B0BVTGVS3M",
    "category": "Smartwatches",
    "title": "GYMROAD Smart Watch with Receive & Dial, Fitness Tracker Waterproof Smartwatch for Android iOS Phones 1.32\" HD Full Touch Screen Digital Watches with Heart Rate Sleep Monitor Pedometer, Black",
    "description": "",
    "rating": 4.2,
    "review_count": 88,
    "features": [
      "Buletooth Dial/Receive Calls and Smart Notification: Gymroad smart watch built-in high-quality speakers, After connecting to Bluetooth, you can making or receiving phonecalls, Bluetooth 5.0 (supports Android 6.0+, IOS9.0+ above), Also you can receive SMS and APP messages (Text, Facebook, WhatsApp, Instagram, Twitter...) , you won't miss any important information, Free your hands when you are in fitness swimming cycling and running.",
      "Track your health at all times：The fitness watch records daily steps, distance, calorie consumption. It can track and analyse Sleep time and heart rate, also monitor blood oxygen, and sleep, pays attention to your health at all times, records physical changes, and helps you better understand your health.",
      "Activity tracker fitness watch and Life assistant: This step counter watch supports 20types of fitness trackers, such as Walking, Running, Cycling, Skipping, Badminton, Basketball, and Football. Recording your steps, distance, calories, etc activity data. It can also work as an assistant: music and camera control, weather display, sedentary reminder, drink water reminder, alarm clock, stopwatch, find phone, which help you live a convenient life.",
      "Great Battery Life & IP68 Waterproof Smart Watch: When fully-charged, this watch can last for up to5~ 7 days or 20 days standby time. With IP68 waterproof, this fitness watch can meet the waterproof requirements of your daily activities such as washing hands or working out in the rain with it.",
      "1.32 Inch Full-touch Screen & Custom Watch Face: The watch with 1.32 inch LCD screen can provide you with high-quality touch and visual experience. Five levels of brightness options allow you to easily read information in the sun or dark. Also you can choose a picture you like to customize the watch face in Movwing App."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Seems to work pretty well for the most part",
        "text": "Setup was easy with a quick app download and it paired with my iPhone 12 without any drama. Biometric tracking seems to work reasonably well with the exception of heart rate, which seems to always read 70 no matter what I'm doing. I'm not too crazy about the aesthetic of the watch, it just looks kind of cheap to me. I got this mainly to use as a health tracking tool and to tell time, not to make and receive calls/texts with, so I haven't setup any of those features yet and may never get around to doing so. So i can't comment on ease of use for any of those features. I did like that there are quite a lot of different watch face designs that can be applied and without any additional purchase. For the price of around $40, this is a pretty smokin' deal for a smart watch, I think.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Not bad for the price",
        "text": "I’ve tried a few different affordable watches and my biggest issue has been the charging port. They have trouble staying connected with tiny pins and no magnetic pull. So going into this I’m more critical.<br />Upside is there is definitely a better charging system. It holds in place nicely even though it’s a pretty small pin area it is easier to charge.<br />The screen does have low sensitivity response. When pairing it it took 3 tries to get it recognize I had tapped the screen.<br />On a good note it’s reading well and has some great features like heart rate, oxygen, and sleep. Everything lined up well with my normal statistics so I feel it’s pretty accurate.<br />There’s a variety of images to choose from so you can customize the screen however you would like.<br />It’s very comfortable. The band holds like a premium watch band. It has a large face that is classy. Aesthetically it’s very nice.<br />Overall for an affordable smart watch it’s a decent option.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Okay tracker",
        "text": "For the price, it is an okay tracker.  The microphone on the watch is not of great quality as I was told sounded muffled on it.  It does have a lot of features and was quite easy to use but nothing about it made it stand out from the other hundreds of smart watches out on the market.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Cute watch is all I can say",
        "text": "Initially the watch was quick to charge and holds the charge for a couple of days.  The functions were easy to use, and a lot to choose from for the activities I do.  I mainly track my steps, distance, duration, heart rate.  It worked well for a few weeks, then I took it swimming for a few laps in the pool.  That was a mistake, battery stopped working (won't charge anymore).  Sad, I really liked the watch, it's cute but the battery died.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Great Smart watch for the essentials",
        "text": "I was looking for a good smart watch for my mother. She was a Fitbit user but her Fitbit died after years of use and wanted something with a similar feel.<br />This watch really worked out for her.<br />It's got a great screen and a good amount of apps to provide essential uses.<br />It's able to work with iOS and Android.<br />It's able to get notifications from apps and make phone calls.<br />Not a bad product at all.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "GYMROAD",
    "tags": [],
    "price": 38.89
  },
  {
    "id": "prod_smartwatches_139",
    "parent_asin": "B0BJW6R4YX",
    "category": "Smartwatches",
    "title": "Amazfit Bip U Pro Smart Watch with Alexa Built-In for Men Women, GPS Fitness Tracker with 60+ Sport Modes, Blood Oxygen Heart Rate Sleep Monitor, 5 ATM Water Resistant, for iPhone Android(Green)",
    "description": "Amazfit Bip U Pro Smartwatch is designed to give consumers an attractive alternative to today's pricey smartwatches. Boasting a 225mAh battery to deliver up to 9 days of endurance on a single charge. It also has 60+ sports modes with high-precision GPS letting you exercise at a higher level. With 5 ATM water resistance, this fitness tracker can resist any of your daily activities even swimming. Come with multiple health tracking features include 24/7 heart rate monitoring, sleep quality & stress level monitoring, menstrual cycle tracking, and blood-oxygen-level measurement, allowing you to better understand your health. With a 1.43‘’ large HD color screen and 50 watch faces to choose from, the Amazfit Bip U Pro fitness watch matches seamlessly your personal style. Amazon Alexa Built-In, Compatible with Android 5.0 or iOS 10.0 and above devices.",
    "rating": 4.2,
    "review_count": 16590,
    "features": [
      "【ALEXA & GPS BUILT-IN】You can talk to Amazon Alexa on your Amazfit Bip U Pro smartwatch, Ask questions, get translations, check the weather, control your smart home devices and more. And get precise tracking of your distance, daily step count thanks to integrated GPS..Water resistance depth:50 meters.Suported Application:Alarm,Breath Monitor,Calendar,Calorie Tracker,Heart Rate Monitor. Connectivity technology:GPS. Wireless comm standard:Bluetooth",
      "【60plus SPORTS MODES & 5 ATM WATER RESISTANT】Featuring 60plus sports modes to help you exercise at a higher level. Water-resistant upto 50 meters, you can wear the fitness watch for swimming and it will record your achievements even underwater.",
      "【MORE HEALTH TRACKING METRICS】The Amazfit Bip U Pro smart watch can provide all-around health tracking, allowing you to accurately track 24-hour heart rate, blood oxygen levels, stress levels, sleep quality, and female menstrual cycle.",
      "【LONG 9-DAY BATTERY LIFE】When fully charged you can relax and enjoy more than a full week of travel or work without worrying about chargers.",
      "【DESIGN FOR ALL-DAY COMFORT】Amazfit Bip U Pro fitness tracker only weighs 31 grams, An ultra-light design you can barely feel when striving for peak performance. ​Featuring a 1.43” large color screen with 320x302 pixel resolution, creates an exquisite visual display, making all incoming calls, messages, and reminders extremely clear.",
      "【SMART NOTIFICATIONS】Get an intelligent little pal to remind you of the incoming calls, text messages, apps, and calendars, alarm clock, weather forecast, and suport controlling the music and camera of your smartphone."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "does what it's supposed to",
        "text": "*edit: I've found a con and it bugged me enough to update my review. If your phone is on \"Do not disturb\" and you leave your phone on at night for emergency calls, the watch still vibrates with every text, regardless of whether they're on your emergency list. This is annoying when you're a light sleeper and you get a text for go cart racing or Dairy Queen at 4 am. I'm assuming it would still go off with a call as well.<br /><br />I have a Garmin Vivofit that for some reason the notification vibrations will work for a couple months, then stop working for a while, then randomly start working again. I was sick of this, and went looking for something not too expensive and found this. I'm still getting used to it, but it vibrates when I get a call or text, so I'm happy so far. The band is very flexible and comfortable, which is nice, since my Vivofit band was a little stiff.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Great watch for the price.",
        "text": "After buying the earlier brands of Fitbit which I loved. I bought myself a Luxe on sale for $100 last December 2021. It didn’t record anything accurately and just didn’t function the way it should. CS was if no help. I switched to Amazfit!  This is a great watch, the battery has lasted over a week. It accurately tells time, my heart rate, steps and I love this watch. It’s great and is so light on my wrist!!",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 1.0,
        "title": "Terrible smart watch, inaccurate and waste of time/money",
        "text": "After 5 months of use I’m done with this. It seems to be getting less accurate every workout. It can’t even get step counts correct. The accuracy of the heart beat monitoring varies too. The sleep monitor is often wrong about awake times so I don’t believe the other sleep data either. The only thing I can believe with this watch is the time of day.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 3.0,
        "title": "Good budget watch if you don't need always-on display",
        "text": "Overall, this is a very reasonably priced watch with a lot of functionality. However, the fact that it doesn't have the always-on screen option was a deal breaker for me and I had to replace it with one of their other models.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 2.0,
        "title": "Did not like this nearly as much as my original amazfit bip watch",
        "text": "I bought an Amazfit Bip watch a year or more ago and have really been enjoying it  The app tracks all my cycling trips and the sleep monitoring is useful.  Iam really a big fan of the long battery life of the older model.<br /><br />This watch has a 9 day battery life which is not nearly as long as the 30 days of the original watch.<br /><br />This watch meausres blood oxygen levels but taking the measurement requires holding your wrist it the right position and takes much longer that the finger tip device Ihave.<br /><br />I did not exhaustively evaluate the new app that came with this phone but it did not look nearly as good as the original app.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Amazfit",
    "tags": [],
    "price": 54.99
  },
  {
    "id": "prod_smartwatches_036",
    "parent_asin": "B087NDDDHY",
    "category": "Smartwatches",
    "title": "SWEES Leather Bands Compatible with Fitbit Blaze Smart Watch, Genuine Leather Replacement Band with Metal Frame Small & Large for Women Men, Champagne Gold, Rose Gold, Black, Brown, White, Grey, Beige",
    "description": "Features:\n- 100% Brand new and high quality, durable and abrasion resistant.-Compatible with smart watch Fitbit Blaze; With well assembled watch band and frame. Size for 5 -8 inch wrist.-Adopt premium crazy horse genuine leather, exquisite and durable. -Personalize your fitness tracker with the secure genuine leather strap at a much less price, perfect for any occasions, like doing sports, outdoor, working or study. -Gift package design, buy more for your family and friends\nSpecifications: -Fitting Wrist Size: Fits 5 - 8.2 inches Wrists.-Material: Genuine Leather, Stainless Steel Buckle; Stainless Steel Watch Frame.-Color Combination: (Black / Vintage Brown / Red ) Band + Silver Frame Or White Band + Rose Gold Frame\nPackage Includes:\n-1 * Leather Band for Fitbit Blaze(Tracker is NOT included )-1 * Metal Frame\nNote:\n-\nSwees\nis a registered trademark and brand in United States and protected by US Trademark Law. -\nSwees\nnever authorizes any other third-party to sell our products, and please directly buy from offcial store sweesdirect to get the authentic products in guarantee and protect your own interest.",
    "rating": 4.0,
    "review_count": 44,
    "features": [
      "Buckle closure",
      "Stylish genuine leather band with metal frame fit for Fitbit Blaze (Tracker is NOT included), small size fits for 5\"-7.1\" wrist, large size fits for 6.2\"-8.2\" wirst.",
      "Premium Stainless Steel Frame protects the watch from scratch and holding the band safely, easy to install on/off, symbolizing fashion, nobility, durability and elegance.",
      "Made from comfortable soft genuine leather materials, a best choice for daily and nightly wear.",
      "Trusted Craftsmanship: strap is comprised of a polished, injection molded stainless steel buckle, genuine leather, and durable linen stitching.",
      "Variety of colors and styles are great choices for men and women to personalize their smart watch."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Easy to use, leather needs to be worn to loosen",
        "text": "Fit is good - average, leather needs to be worn a few times to wear in but the colors are beautiful.  I can wear this to work or a more casual social event.  Nothing real dressy.  Easy to fit the Blaze Fitbit in and take out for charging.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Not bad for the price",
        "text": "Looks and feels great.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Gift",
        "text": "My daughter liked the bans",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "Looks cheap",
        "text": "Looks cheap",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Classy and durable.",
        "text": "Bought this for my husband, he loves it. Makes his fitbit look very classy, received tons of compliments. The leather strap has done very well with the wear and tear.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "SWEES",
    "tags": [],
    "price": 23.99
  },
  {
    "id": "prod_smartwatches_186",
    "parent_asin": "B0BNBFLJBN",
    "category": "Smartwatches",
    "title": "Hadisala Smart Watch, 1.69\" Fitness Tracker for Android iOS Phones, Activity Tracker with Heart Rate Monitor, Blood Oxygen Meter, IP68 Waterproof Smartwatch for Women Men-Silver",
    "description": "",
    "rating": 3.9,
    "review_count": 72,
    "features": [
      "【Heart Rate Monitor & Sleep Tracker】: Hadisala fitness tracker have 24 hours heart rate monitoring, blood oxygen meter and blood pressure, it will allow to check your heart rate trends. Beside, Our watch is also equipped with sleep quality analysis function that you can understand your deep, light sleep and wake up time, help you make reasonable adjustment, develop a healthier lifestyle.",
      "【24H Activity Tracking】: Hadisala smart watch with 24 different activity modes, it can accurately records your activity data, including steps, distance, calories burned, miles walked, active minutes etc. Which is help you better control your rhythm of exercise and improve your sport efficiency.",
      "【A Unique Gift】: Hadisala waterproof watch made in a 1.69 \" color full touch HD screen and ergonomic strap, which is easy to operate and easily check detailed data reports. Built-in 17 native languages and more than 100 gorgeous dials can be arbitrarily choose. What's more, You can also use your own photos to create your unique dials. An excellent gift choice of men and women!",
      "【IP68 Waterproof & Long Battery Life】: Our smartwatch designed with IP68 waterproof, whenever you are swimming, washing hands or raining, no need to worry about watch damage. In addition, the quantity of electricity can support 8 days of normal use and 50 days standby time. If you adjusted to power saving mode, even can provide 20 days of use time.",
      "【More Practical Functions】: Our watches are used with the Gloryfit app, you can receive and read message or app notifications, also can get call reminder and hang up. This fitness tracker also provides many other useful functions like alarm clocks, timer, music controller, sedentary reminder, adjust brightness, find phone, remote photography etc, bring more fun to you."
    ],
    "reviews": [
      {
        "rating": 2.0,
        "title": "Nice looking but---",
        "text": "Just received yesterday so can't comment on accuracy yet. Got watch set up through app with no problems. Then the maddening part-One of reasons I ordered this watch was watch face on Amazon pictures. Well, I scrolled down through all the faces on the app 4 times and the shown watch face was not even there for download-What the hell!!!!! I've ordered 6 or 7 smart watches and this is the first one without magnetic charging cable. Has this plastic thingy at end of cord you have to push watch down into in order to charge. Don't like this at all. Haven't decided whether to keep or not but not off to a good start.<br />After a few days another problem. Battery charge on watch shows 100% all the time even after 2 days of wearing. Impossible for battery level not to go down somewhat if not a lot. Returning.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Cheap watch with premium features!",
        "text": "I own several smart watches only because I like different styles. I have to say this one is very stylish and elegant. Works very well and has tons of features. The watch band feels strong and durable.<br /><br />Some of the reading features such as the blood pressure monitor is not 100 percent accurate but pretty close compared to a cuff system.<br /><br />Battery last a few days before needing a charge again. It’s also IP68, has music control once paired to your phone, heart rate monitor, blood oxygen readings, call & text notifications, and so much more!<br /><br />If you are looking for a smart watch that would not break the bank, then this is it! Go and get yourself one of these today! It’s highly recommended!",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Hadisala",
    "tags": [],
    "price": 14.99
  },
  {
    "id": "prod_smartwatches_120",
    "parent_asin": "B0BWFHXJWZ",
    "category": "Smartwatches",
    "title": "Nicohoas Smart Watch, 1.85\" Touch Screen Smart Watches for Women, Fitness Tracker with Heart Rate Monitor and Sleep Monitor, Activity Tracker for Android iOS, Pink",
    "description": "",
    "rating": 3.9,
    "review_count": 37,
    "features": [
      "⌚ 【1.85 Inches Large Screen Smart Watch】 Equipped with 1.85 inches IPS full screen touch , make a great breakthrough in button touch fitness watch and advanced health smartwatch that helps you tune in to your body with tools for sleep tracking, sport record, menstrual health tracking, relax guidance and so on.",
      "⌚ 【Bluetooth Call Receiving/Dialing for Android Phones Samsung iPhone】 Compatible with iPhones running iOS 10.0 and Android phones running Android 5.0 or newer (Smartphone only, not for PC, iPad or Tablet). . Download and install Free \"FitCloudPro\" APP, bind this smartwatch in your cell phone, you can receive alerts of calendar, SMS, incoming calls and SNS (Facebook, Twitter, Whatsapp, Skype, Snapchat and more) on this watch; It will never let you miss any important events.",
      "⌚ 【110+ Sports Modes Tracking】 The smartwatch supports 100+ sports modes. Such as running, cycling, jumping rope, tennis, badminton, climbing, hiking, yoga, etc. You can track your activities like steps, distance, calories burned and the minutes you take etc.",
      "⌚ 【Heart rate, Sleep Monitoring 】 The smartwatch supports real -time heart rate, sleep monitoring. You can enable 24-hour heart rate detection in the APP. The high-performance motion sensor monitors sleep status (deep sleep, light sleep and wake-up time) and provides comprehensive sleep quality analysis.",
      "⌚ 【IP67 Waterproof Fitness Watch and Long Life Battery】 The waterproof grade of our smart watch is IP67, so you don't need to worry when swimming in the swimming pool. Large capacity and low power consumption design can provide longer battery life. It supports 7 days of normal use and 25 days of standby time."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Nice smartwatch",
        "text": "I just got this smartwatch today. The watch face itself is not bulky, it's a little flatter, which I like. I bought this to wear in case I don't have my phone on me or beside me. Not sure how much farther away from my phone I can place a call when I'm home, but be sure to keep the bluetooth on when in use. This watch has many functions, which I have yet to use, but so far it's cute and I like it!",
        "verified": true,
        "helpful_votes": 1
      }
    ],
    "store": "Nicohoas",
    "tags": [],
    "price": 25.99
  },
  {
    "id": "prod_smartwatches_166",
    "parent_asin": "B07V346YQ3",
    "category": "Smartwatches",
    "title": "Fintie Band Compatible with Fitbit Versa 2 / Versa/Versa Lite, Premium Resin Replacement Wristband Strap Bracelet Compatible with Fitbit Versa Smart Watch, Pink-tone",
    "description": "Fintie, a quality product within your reach!\nTech Specs:\n1. Material: High quality Resin with metal buckle2.Color: Pink-tone, Tortoise-tone, Purple. Various colors available to dress up your Fitbit Versa and match any suit in your wardrobe\nCompatible with\nVersa 2, Versa 2 Special Edition, Versa Special Edition, Versa and Versa Lite Edition watches.\nWhat's in the Box:\n1 x Sport Loop Band for Fitbit Versa; 3 x Quick Release Spring Pins (the Fitness Tracker is NOT included)",
    "rating": 4.5,
    "review_count": 20,
    "features": [
      "Buckle closure",
      "Perfect accessory band Compatible with Versa 2, Versa 2 Special Edition, Versa Special Edition, Versa and Versa Lite Edition watches. (The Fitbit device is not included.)",
      "Combined with premium Resin and stainless steel metal buckle, this strap stands as a symbol of luxury, nobility, elegance and durability, feels like plastic lightweight design, but more durable and comfortable than plastic.",
      "Adjustable Length: The size can be adjusted according to the circumstance of individual wrist, fits 6.65\"-8.15\" (169mm-207mm) wrist.",
      "Durable Buckle: Refined double button folding clasp design, firmly closed, and prevent loosen automatically, safe and beautiful.",
      "Quick Release Design: Easy to replace or exchange the strap band without tools within seconds. Package Contents: 1 x Smart Watch Band, 3 x Quick Release Spring Bars, 1 x Link Removal Tool and 1 x User manual. (Note: watch is Not included.)"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "These where exactly what I needed",
        "text": "Great band. I ended up getting two different colors. Easy to switch out and extremely cute.",
        "verified": true,
        "helpful_votes": 1
      }
    ],
    "store": "Fintie",
    "tags": [],
    "price": 12.99
  },
  {
    "id": "prod_smartwatches_038",
    "parent_asin": "B0C3WF3W29",
    "category": "Smartwatches",
    "title": "AMAZTIM Smart Watch, 60 Days Extra-Long Battery, 50M Waterproof, Rugged Military Bluetooth Call(Answer/Dial Calls) Fitness Tracker, 1.85\" Ultra Large HD Display, AI Voice Assistant 24H Sleep Monitor",
    "description": "",
    "rating": 4.1,
    "review_count": 1940,
    "features": [
      "⌚Military-Standard quality - AMAZTIM M2 features 1.85-inch second generation Corning Gorilla screen. As the first 9H twin glass cover, it's strong enough to deal with a range of screen-destroying behaviors. The TC4 titanium unibody and the exclusive developed two-color silicone rubber is the world's first two-color integration in a smart watch; military-grade materials and fully enclosed design makes it the toughest and sturdiest watch. Successfully passed 12 Military Tests Including, extreme temperature,dust resistance, salt spray, fluid pollution,etc. Certified to MIL-STD810H , Our smart watches for men ensures that you use them confidently in a variety of harsh conditions.",
      "⌚50M Waterproof /Extremely resistant to damage - Incredibly strong and corrosion-resistant titanium case has been used to enclose and giving cover, the rugged military grade smart watch with fully enclosed ultra-thin case design can be easily submerged into 50M (IP69K waterproof) deep water. Our durable smartwatch has withstood the extreme conditions and passed drilling, crushing and hot steam washout tests, making our sports watch suitable to use under high temperature and pressure.",
      "⌚IndustryLeading dual smart chip - ① AI Voice Assistant & Make Calls: A very handy tool built in the watch. Use your voice to give instructions and the voice assistant will do the rest. You can ask questions, play your desired music, and check weather, set alarms and timers. You can also make voice calls through the voice assistant, makes the scenes that are inconvenient to hold a mobile phone in daily exercise and life more concise and smart. ② Intelligent sports recognition: features BioTracker PPG optical sensor and the advanced AI algorithm,M2 enables smart recognition of 6 sports. The system can automatically sense current sports status without entering Sports Modes manually.",
      "⌚60+ Days super battery life - M2 is equipped with a 100% pure cobalt battery (military grade), the battery capacity is as high as 380mAh ensuring optimal performance and longevity which is twice as much as that of conventional smart watches. At the same time, super power-saving AI algorithm breaking the industry is adopted to minimize power consumption, enough to last up to 2 weeks under normal use, and can continue to use sports mode, health index measurement and other functions for up to 60+ days in power-saving mode. With 30-minute charge, you can have enough battery backup to last for up to 3 days.",
      "⌚24H Health monitoring /70 Exercise modes - AMAZTIM M2 collects the health data with its advanced real-time monitoring function. The fitness watch helps you monitor All-day sleep, 24-hour heart rate, and real-time blood pressure and blood oxygen. The fitness tracking watch includes a pedometer to keep track of the calories burned throughout the day. Supports up to 70 sports modes including indoor and outdoor exercises such as hiking, skiing, swimming, etc. The smartwatches collects the data with pinpoint precision and accuracy, ensuring that every workout is counted."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Easy to set up, very accurate, keeps me updated with many aspect of my health",
        "text": "I really appreciate this watch and the features it has. First off, the smart watch was very easy to pair to my phone. I have an Android phone, and it only took a few minutes to pair the watch with my phone.<br />First enable Bluetooth and find the device listed as \"C20\"<br /><br />Next, download the app that's shown in the QR code. Once you have the watch paired via Bluetooth to your smart phone and the app is downloaded, your watch ready to go, and should be syncing to your smart phone. The connection has been great thus far; it hasn't disconnected/lost connection to my phone.<br /><br />As someone who has suffers from pulmonary lung disease, I was very excited when I found out this smart watch has the capability to track my oxygen saturation, heart rate, and blood pressure. In addition, you don't have to do anything, the watch will automatically to measurements periodically throughout the day.<br /><br />It's helping me monitor and compare results over a few days. I suggest authorizing Google Fit so your hearth history is accessible when it. For me, it helps to have a history when I meet with my pulmonologist.<br /><br />The watch has great standby battery life, and it's light weight. After m three days  it's only dipped minimally in available battery percentage. I highly recommend this!<br /><br />**Updated**<br /><br />So it's been several days now since I first posted the review and I am amazed how little the battery has drained. Needless to say this smartwatch has fantastic standby battery life; especially considering it's constantly looking for/measuring heart rate. As you can see from the photos the readings are very accurate. I own a pulse oximeter and a blood pressure monitor to keep my pulmonary hypertension in check. My resting heart rate is 95 bpm, which may seem high, but the reading is accurate and normal which makes this product more the reassuring.",
        "verified": true,
        "helpful_votes": 28
      },
      {
        "rating": 5.0,
        "title": "Great Watch!",
        "text": "Ok, I have had fitness watches from Samsung to Fitbit to Garmin and this one is the best....especially for the price.  First thing since turning 60 I need a watch I can read in the sunlight.  This has a brightness level I actually do not have to turn it all the way up and the workout data is big enough to read. I think all the health data is correct, but do not trust the Blood Pressure readings because of the science behind it. Actually do not trust any BP on a fitness watch.  There is a lot of customization you can do......I recommend a custom watch face along with setting up quick view on a schedule. I am now going to see if I can get a spare charging cord,",
        "verified": true,
        "helpful_votes": 11
      },
      {
        "rating": 1.0,
        "title": "Cheap, Inaccurate, but Cheap",
        "text": "What works, the clock.<br />What doesn't work, everything else.<br />Bought in August, really tried to give it a chance. I knew for the price it was a gamble.",
        "verified": true,
        "helpful_votes": 3
      },
      {
        "rating": 4.0,
        "title": "Step count",
        "text": "Like the look, heft, easy set up.<br /><br />But I question the accuracy since driving 1 miles and it's counted 30 steps, this is AFTER it logged 82 steps during at my desk.<br /><br />3 month update.  Battery life is still excellent however the watch has stopped connecting to the app<br /><br />6 month update: Batter life is excellent, I notice it has started to decline, but that could also be heavier use.  Step count still seems a bit wonky, but not egregiously off.  The Strap is starting to break at the clasp and I will need to replace as soon as I'm able to find a replacement.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 3.0,
        "title": "Nice",
        "text": "Having used different smart watches was looking forward to this one. But it disappointed me. Accuracy on everything was off compared to reality. Other smart watches for less were more accurate. I returned said watch.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "AMAZTIM",
    "tags": [],
    "price": 99.99
  },
  {
    "id": "prod_smartwatches_094",
    "parent_asin": "B0BX4HM3Z6",
    "category": "Smartwatches",
    "title": "Smart Watch, Smart Watch for Android Phones & iOS with 1.7\" Full Touch Screen, 5 ATM Waterproof Fitness Watch with Heart Rate & Blood Oxygen Monitor, Sleep Monitor, Smart Watch for Women Men",
    "description": "",
    "rating": 4.3,
    "review_count": 179,
    "features": [
      "Heart Rate, Sleep, Blood & Activity Tracking - With our smartwatch, it accurately monitors your heart rate in real time. Also, it provides a detailed analysis of your sleep quality by continuously recording your sleep patterns. During exercise, the smartwatch automatically records daily steps, distance counter, calories burned, active minutes, measure your blood oxygen saturation and understand your physical state",
      "Large HD Color Touch Screen - 1.69 large color screen and full screen touch and hand sliding. it ensures smooth operations and 240*280 resolution for you. Our screen is better at color saturation and reproduction. Personalize your smart watch for men women with multiple customized watch faces provided, make your own stylish smart watch.",
      "Smart Watch Compatible with iPhone Android Phones - This smart watch is compatible with most iOS 8.0 & Android 4.4 and above smart phones. Connected to the app through Bluetooth, you can control the music player, view the local weather today, and apps notifications straight to your smartwatch including Facebook, Instagram, Twitter, Whatsapp, and more.Download and install “VeryFit” for free, then connecting our smartwatch to your phone and start your journey of smart life.",
      "14 ACTIVITY TRACKING & Waterproof: This fitness sport watch has 14+ sports modes check all-day activities data like steps, distance. Smart Watch is designed with 5ATM waterproof rating, so no need to worry when you wear it while swimming or sweating out.",
      "Long-lasting Battery Life & 5ATM Waterproof - The large battery capacity (300mAh) and low power consumption design offers longer endurance. It could last about 8 days when in auto monitoring mode for heart rate."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Great activity tracker with AMAZING Battery Life.",
        "text": "[[VIDEOID:e0fda475d57018948d4bdf5116c091bf]] I had a different version activity watch that was way more expensive to match my phone. For the cost this watch does just about everything I need it to for way less money.<br /><br />A few things I love about the watch...the Battery Life. OMG the battery life! It lasted me a full week with wearing it to bed most nights, through multiple exercise walks and a few work outs, and hundreds of notifications from my messaging apps and phone calls. It's easy to clear the notifications I receive on the watch. I love that it tracks my sleep, heart rate, and stress levels easily. I also tested out in my pool for swimming and it was waterproof without having to shake the watch or turn on any special modes to keep it watertight.<br /><br />I haven't figured out of it auto detects a work out but that could be because I obviously don't work out that much.<br /><br />I tested it against my health app on my phone and they were pretty accurate against each other info steps and mileage. I can't figure out how to get the watch and the app to register my GPS coordinates to see the map of my walks but I could be missing the settings.<br /><br />The app that gives the data is easy to navigate and update any settings. Seems very similar to other track laps I've used.<br />A few things I'm not liking about this watch...<br />I feel like the band and the watch itself that comes with the watch is a little too big for my wrist. And I have a bigger wrist for a female at my size. The watch face is bigger than some of my friends apple watches and taller than my old Samsung gear fit watch. I can SEE notifications on the watch but I can't respond or give a quick response to any messages. For Whatsapp or Facebook Messenger I wouldn't expect that but for SMS messages I would like to be able to give a quick text back either by speaking a response or by selecting from some quick options.<br /><br />Those are really my only 2 complaints. I like this watch and will continue to use!",
        "verified": false,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Such a great Apple Watch dupe!",
        "text": "This smart watch works great! It’s also so cute and the band has lots of holes for adjusting. The only difference I see that’s noticeable is the watch band is a flimsier rubber. But it also makes it feel more comfortable than my Apple Watch. Would make a great gift as well!",
        "verified": false,
        "helpful_votes": 1
      },
      {
        "rating": 1.0,
        "title": "Did the job for a week, then it drowned",
        "text": "I charged the watch out of the box.  Followed instructions and setup was pretty much straightforward.  There is a decent amount of sports mode available.  I mainly use run, walk, and swimming.  For walk and run the data captured was okay for duration, calories, distance, number of steps, pace, heart rate. and nighttime monitoring sleep was interesting.  Then I took it for laps in the pool, and that is when it did not do well.  The ad shows person swimming in pool, but I don't believe it can survive in the pool.  because the watch died.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "A sluggish, inaccurate, subpar sports/health smart watch.",
        "text": "I needed a backup sports smart watch for my Apple Watch.  Let's check out this Veryfit watch.<br /><br />What works:<br />Charged up in about 2-3 hours from 60% battery level.<br />Easy to install the Veryfit app and pair with my old iPhone 12 Pro.<br />Has many of the basic sports watch functions: stopwatch, alarm, timer, along with biometrics: Heart rate, Blood oxygen monitoring, Stress level, Breath training, Sleep, etc.<br />Big, easy to read watch face, only a bit narrower than my 44mm Apple Watch.<br />A variety of watch faces to download.<br />Nice, soft, comfortable watch straps.<br /><br />What don't work:<br />Once linked up to my iPhone, app takes some effort to set up.<br />Can only receive notifications and phone call alerts, no relay of calls.<br />Heart rate monitor is erratic with a wide range of random readings.  My resting heart rate is 56bpm yet this watch measures a range of 62 to 125bpm at various times.<br />Requires about 25s to get each biometric reading.<br />What's up with the 3-2-1 countdown to start each exercise?  Start/Stop is what most users prefer.<br />Perhaps the Android version works better?<br />Don't expect too much from this $34.99 smart watch (after -30% off coupon on Feb. 19, 2023) but there are other smart watches in this price range that function better.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "I like it",
        "text": "It's a little bulky but not enough for me not to still wear it every day",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "AlERTSEAL",
    "tags": [],
    "price": 45.99
  },
  {
    "id": "prod_smartwatches_086",
    "parent_asin": "B0BHQV88HC",
    "category": "Smartwatches",
    "title": "Choiknbo Smart Watch Make/Answer Call for Android iOS Phones 1.9'' Fitness Tracker with Heart Rate Blood Pressure SpO2 Sleep Monitor IP67 Bluetooth Receive SMS Messages Sport Step Activity Trackers",
    "description": "",
    "rating": 4.0,
    "review_count": 20,
    "features": [
      "【Make/Call Answer & Information Reminders】Smart watch that can answer calls and equipped with a high-quality speaker, won't affect your call quality. Our smartwatch for men women built-in call dial, make/receive calls directly from your watch. Liberate your hands, leave your phone in your pocket. Receive notifications of SMS/SNS/FB/Twitter/Ins and other social software messages from your smart watch anytime, anywhere",
      "【24/7 All-round Health Activity Tracking】Equipped with the latest high-precision optical sensor, monitor your health at all times. Our fitness tracker watch for men women with heart rate blood pressure and SpO2 monitor, automatically records your sleep data and tracks your sleep type to analyze your sleep quality",
      "【Sports Activity Tracker Watch with 8 Sport Modes】Record your all day activities like steps, calories burned and distance traveled, the 2022 newest fitness tracker supports 8 types of sports tracking such as walking, running, skipping, cycling, basketball, football, badminton. Manage your sports more scientifically by our bluetooth smart watch",
      "【1.7\" Large Screen & Custom Watch Face】1.7'' full touch high-resolution screen makes smartwatch perfect for using. Quote the latest technology, use smoothly without lag, provide you a pleasant experience that other watches at the same price can't bring you. Biult in 100+ watch faces, can also choose your favorite picture as a watch face with one click, customize your personalized fitness smart watch",
      "【IP67 waterproof & Compatibility】Our smart watch for android ios phones compatible adopts IP68 waterproof for daily life such as anti-sweat, anti-rain and hand washing. 230mAh large-capacity battery can be used for 7 days and standby for 30 days when full charged. Compatible with Android 4.4, iOS 9.0 and above, such as iPhone, Galaxy, HU-AWEI etc"
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Better than my Apple Watch",
        "text": "Got this for the kiddo. He’s 14 and Captain Destructo. This kid literally body slams trees for fun and the best and sturdiest gifts for him last about a week. Two if you’re lucky. We’re never lucky. However, it’s been a while and he wears it nonstop. Get this, it still works. He loves the band and all of the features. The battery life makes my jaw drop. I have to charge my Apple Watch at least once a day. This watch does more and has a battery life that won’t quit. I’d fight him for it but again…he body slams trees. Great purchase, guys. It’s also a smart and inexpensive way to test your kid’s level of responsibility before buying more expensive products and flushing your money.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Good quality and not overpriced",
        "text": "I bought this product as present for my son, he enjoys wearing it. I like the quality. And it does not cost an arm and a leg.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Good one",
        "text": "Presented it to my cousin and he loved it alot.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Easy set up",
        "text": "Easy set up to any phone, and it offers the same features that the name brand smart watches offer for a fraction of the cost.  There are some differences with display appearances which is expected for the price, text come through like reading an old dot matrix system but it gets the job done.",
        "verified": false,
        "helpful_votes": 2
      }
    ],
    "store": "Choiknbo",
    "tags": [],
    "price": 28.99
  },
  {
    "id": "prod_smartwatches_196",
    "parent_asin": "B09CLDQCJZ",
    "category": "Smartwatches",
    "title": "8 Pack Silicone Bands Compatible with Fitbit Versa 3 Bands and Fitbit Sense Bands, Classic Soft Sport Bands Replacement Wristbands for Fitbit Sense/Versa 3 Smart Watch Women Men (Large, 8 Pack C)",
    "description": "Amzpas Replacement Sport Wristbands only Compatible with Fitbit Versa 3 Bands and Fitbit Sense Bands for Women Men, (Fitbit versa 3 / Fitbit Sense Watch only, NOT for Versa 2 / Versa / Versa Lite)\nKindly Notices:\nOur bands are only suitable for Fitbit Versa 3 & Fitbit Sense, other series are not suitable!\nSpecial features:\n1.Sweat and water-resistant: Replacement bands for Fitbit Versa 3 bands are Crafted from Premium durable TPU material. It is lightweight, flexible, easy cleanness, no fading. There is no irritation to your skin. you can wear it day and night.2.Fitbit versa 3 Bands & sense Bands come with a completely new design of the connector, both sides with smart watch lugs replace the old stainless steel pin-and-tuck connector.3.You can mix up different colors of bands to personalize your Fitbit Versa 3 / Fitbit Sense watch to fit your mood and outfit in daily life.4.Soft Wearing Feeling - These wristbands for Fitbit Versa 3 Bands for women men are made of flexible elastomer, provide you with a smooth wearing experience.5.Classic regular design of your Fitbit Versa 3 watch to preserve the original look, you only need to take your original band off and push the new band onto the watch.\nOne-year Warranty:Every purchase is backed with 100% Satisfaction Guarantee.If you received defective bands or had any problems, Please feel free to contact us at any time. We take care of you with free replacement or full refund immediately.",
    "rating": 4.2,
    "review_count": 762,
    "features": [
      "Compatible Models --- Amzpas silicone replacement bands are only compatible with Fitbit Versa 3 bands / Fitbit Sense bands. (Fitbit versa 3 / Fitbit Sense Watch only, NOT for Versa 2 / Versa / Versa Lite)",
      "Excellent Quality Skin-friendly Material --- These Fitbit versa 3 bands are made of Eco-friendly, dust and scentless TPU (Rubber), which prevents skin from irritation or allergies. Soft texture and sweat resistant wrist band with greater durability keeps your wrist in a comfortable status and fits for your daily workout.",
      "Perfect Fit Design --- Amzpas sport wristbands with connectors are seamlessly and securely compatible with Fitbit Versa 3 / Fitbit Sense watch interface, holds your sense bands sturdy in place even during heavy exercise. Easy to install and one button remove.",
      "Various Colour Choices --- The durable band sets compatible with fitbit versa 3 / sense band offer multiple colors available, Light or Dark, highlight your personal fashionable temperament style, perfectly accessories your daily outfits. Small Size for 5.5\" - 7.2\" (140 mm-185mm) wrist, Large Size for 6.5\" -8.5\" (165mm-215mm) wrist.",
      "12 Month Warranty --- Replacement or full refund without returning for all quality-related issues with fitibit versa 3 bands and fitbit sense bands. Please feel free to contact us at any time, we will give you a response within 12 hours."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "They work great with my Fitbit Sense!",
        "text": "They worked great! Fit properly and I love the colors! I am going to get the other pack with the different colors too!",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 1.0,
        "title": "Poor fit. Band constantly falls off.",
        "text": "These bands are very poor fitting. They constantly fall off. My watxh face has cracked thanks to these bands. Buy something else.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 3.0,
        "title": "Not easy to fasten",
        "text": "I do like my watch. The bands are a bit difficult to fasten. I wish the just had the old fashion buckle!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "lots of variety",
        "text": "n/a",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Don’t fit the Sense",
        "text": "They don’t snap in. I tried several in the pack and all are the same.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Amzpas",
    "tags": [],
    "price": 14.99
  },
  {
    "id": "prod_smartwatches_097",
    "parent_asin": "B08P4HVCBF",
    "category": "Smartwatches",
    "title": "Compatible for Garmin Venu Sq Band, YOUkei Slim Vintage Leather Strap Replacement for Women, Man, Wristband Accessories Compatible for Garmin Venu Sq Smartwatch/Venu 2 Plus Smartwatch 2022 (White)",
    "description": "",
    "rating": 4.2,
    "review_count": 94,
    "features": [
      "*Attention: Please CONTACT US at the first time if got defective items; For 30 day after the date of purchase, we take care of all quality-related issues with a REPLACEMENT or REFUND.",
      "[CHIC STYLE & ADJUSTABLE]: Stylish cut and elegant looking makes it an ideal Venu sq smart watch band replacement for you. With multiple precise holes and metal buckle, the Venu sq watch bands have been crafted to fit most wrist sizes. Fits 6.45\"-8.45\" (164mm-215mm)",
      "[EASY INSTALLATION]: Easy tool free installation with improved quick release spring bars make changing the band a snap! We have reinforced the spring bar knob so it’s no hassle to switch your strap to change up your look.",
      "[COMPATIBLE DEVICE]: Personalized your Venu sq"
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Stylish and Slim Fitting",
        "text": "I didn't like the gray plastic strap that originally came with my Garmin. So, I saw this one and thought that it would be more feminine, attractive and stylish. I have a small wrist and it fits nicely.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 1.0,
        "title": "Poor quality",
        "text": "Poor quality, bad pins",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Cost and style",
        "text": "Love this... Exactly what I wanted.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Keeps popping off",
        "text": "I bought this in white months ago. I needed a new one so I tried pink. The pink keeps popping off. I wish I wouldn't have thrown my white one away!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "YOUkei",
    "tags": [],
    "price": 14.99
  },
  {
    "id": "prod_smartwatches_017",
    "parent_asin": "B0BT9SRHFD",
    "category": "Smartwatches",
    "title": "Smart Watch for Men iPhone Android, Smartwatch with Alexa Built-in (Answer/Make Call), 1.7\" Fitness Tracker for Heart Rate Sleep Tracking, 60 Sports, Blood Oxygen, Black",
    "description": "",
    "rating": 4.0,
    "review_count": 1823,
    "features": [
      "【Smart Watch Bluetooth Call, Alexa and Smart Notification】 After connecting the watch with your phone, you can directly dial the phone number on the screen to make or answer the call. Built-in Alexa can help you with your daily life. Also you can receive SMS and APP messages (Text, Facebook, WhatsApp, Instagram, Twitter...) you won't miss any important information",
      "【24H Accurate Health Monitoring】Measure your Heart Rate, Blood Oxygen, Pressure with this smart watch. Understand your physical state, especially for high-intensity or outdoor work such as high temperature, brainstorming, stay-up and get professional analysis on how to relax in a healthier and better way. AEAC smart watch also analyzes sleep quality and score your sleep quality to help you adjust your sleep habits",
      "【60 Sports Modes & Fitness Tracker】AEAC Fitness Tracker supports 60 sports such as walking, running, mountaineering, swimming, yoga, hiking, cycling, treadmill, etc . Accurately record all-day activities like steps, distance, calories burned, miles walked, active minutes and give professional analysis on improving your sports and daily habit",
      "【1.7\" HD Full Touch Screen and Smart Life Partner】Check daily workout clearly on a 1.7'' HD bright color display. Create customized fitness schedules and goals, Get vibration alerts for all notifications, including phone calls, texts, and social media app alerts. Never miss a message with smart notifications delivered right to your wrist. You also can check real-time weather and change your music on the smartwatch",
      "【IP68 Waterproof ＆ 21 Day Battery Life】Fully charge for 2 hours, support 21 days standby time. Large capacity and low power consumption design offers longer endurance. AEAC smart watch is designed with IP68 waterproof, you can wear it when washing hands, in the rain and swimming"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Excellent buy",
        "text": "Very affordable price, Ease to use, and durable battery. Really satisfied with this smart watch",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "It’s ok but not what I expected!",
        "text": "It’s ok but not what I expected!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Very stylish",
        "text": "Just what I was looking for and very stylish.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "worth the try, gorgeous clear display, ease of use, fits my 7\" wrist,",
        "text": "It's pretty good, especially if you dont need a name brand. It has a beautifully clear display. Easy to install app and pairs  well with no hassle. Has all the bells and whistles of name brand products. While I prefer fitbit due to familiarity.<br /><br />I havent put it entirely through its paces. I noticed that it was registering nearly same heart rate as my fitbit sense. I havent it worn it long enough to determine blood oxygen. There is still a lot to learn. The learning curve feels a little clunky compared to my fitbit.<br /><br />Has ability to connect to Alexa, take and make calls, music. Can make changes through app or scroll through the screen face.<br /><br />The watch band fits my 7\" wrist and feels comfortable enough. Typical silicone band. It is attached via pins, so I imagine it is possible to swap it out but not sure. I may try some old bands to see if it is doable. I'd also prefer for it to have a soft protective cover (bumper guard) to protect screen and edges.<br /><br />I still prefer the ease of using a name brand, but this has a good looking interface. Main thing is to see how accurate it is. I think it has been fine for heart rate, steps, but will need more sleep time for seeing how well it tracks sleep and oxygen.<br /><br />I dont rate on price, but I comment. This is pretty reasonable, but it looks like there are many similar products for less. So compared to a name brand of similar features this is a bargain. Compared to other no name generics, this is competitive. Some are easily $20 less. I noticed the price on this vacillates. I think I got it for $70, and have seen it as low as 35-40.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "It’s ok",
        "text": "The oxygen part of the watch is not accurate.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "aeac",
    "tags": [],
    "price": 59.99
  },
  {
    "id": "prod_smartwatches_155",
    "parent_asin": "B0C5MD1TL9",
    "category": "Smartwatches",
    "title": "AMIHUSEl Military Smart Watch for Men Bluetooth Answer/Make Call, Waterproof Rugged Outdoor Sports Tactical Smartwatch, Activity Trackers Watches with Heart Rate Sleep Monitor for Android iOS Phones",
    "description": "How to connect the smart watch? Step 1: Scan the QR code from user manual to install the “DaFit” APP and switch on phone bluetooth for pairing. Step 2: Enter app and find T46S to bind. After connection, you can use the watch to（Call receiveing/Dial）calls and other settings. Dual Bluetooth Calling Smart Watch Support Bluetooth calling. Built-in Dial Pad, Mic and HiFi Speaker, Contact List and Call Log gives excellent handsfree calling experience. Let you make uninterrupted phone call while at work, walking on road or at Gym 24/7 Heart Rate Monitoring Advanced HR sensor will automatically monitor your real-time heart rate all day. You can also intuitively check the heart rate graph data in app. Become more aware of your health. Accuracely Track your Daily Activity Built in 7 daily sports modes ,includewalk, run, dynamic cycling, badminton, football, basketball, rope-jump.Step counter with accuracy sensor technology to track your daily activity,record your step,distance,calories burned and exercise time. Package Include: Smart Watch * 1 Specification * 1 USB cable * 1 If you have any problem about our Choiknbo T46S Smartwatch, please feel free to contact us. Customer satisfaction is our greatest pursuit.",
    "rating": 4.2,
    "review_count": 56,
    "features": [
      "Rugged Smart Watch for Man - The AMIHUSEl Smartwatch features a dual glass cover that is strong enough to handle a range of screen vandalism. Military grade materials and a metal casing make it the toughest and strongest tactical watch available. Outdoor enthusiasts can use them in all kinds of harsh conditions.",
      "Text Message Notifications And Call -The men's smart watch is equipped with an excellent Bluetooth chip, built-in high-fidelity speaker and microphone, you can make and receive calls or play music directly on the smart watch, freeing you from your phone. When you receive a message or app notification (Facebook, WhatsApp, Twitter, SMS, SNS, etc.), your Bluetooth watch will vibrate to remind you, and you can access the information from your wrist. Let you never miss important calls or messages again.",
      "24H ALL-ROUND MONITORING - Smart watches are equipped with the latest biosensors. Support 24H data monitoring and sleep monitoring, which can effectively monitor the situation and analyze your status in real-time. In addition, it also has more practical functions such as weather forecasts, alarm clocks, camera control, music control, timer, sedentary reminder, drinking water reminder, etc., to make your life more convenient.",
      "EXCELLENT SPORTS PARTNER - As a smart fitness watch, it supports 24 sports modes such as walking, running, cycling, yoga, hiking, etc. Record your steps, calories burned, distance and activity time in real time to help you exercise scientifically. It is an excellent partner for sports enthusiasts.",
      "1.8'' LARGE SCREEN&LONG BATTERY LIFE - This smart watch for men is compatible with Android 6.0 and IOS 9.0 and above. With a 1.8-inch high-definition color touch screen and 240x286 resolution, it provides you with a clearer, brighter and more delicate visual experience. Ultra-low power consumption, fully charged in 2 hours, supports 40 days of standby and 15 days of normal use. In addition, it is equipped with a screen cleaning tool and two watch screen protectors to better protect your watch.WJGSUBEIREYTQ TASUBEIREYEP"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Outstanding value",
        "text": "I got this for my spouse who has an android phone.  He absolutely loves it!  He was so thrilled with it and how easy it was to set up and use that he gave me a list of the pros and cons. Pros: comfortable; stylish (never heard him use that word before lol); there's a watchface for all tastes and occasions; the features are intuitive and the charge lasts for 24+ hours.  The only cons he mentioned was that it did not give an approximate charge time and that he can't figure out how to add contacts. I've never seen him so enthusiastic about a fitness watch before and he previously disdained them. Based on his experience, I would highly recommend this one.",
        "verified": false,
        "helpful_votes": 1
      },
      {
        "rating": 3.0,
        "title": "It works as a watch but most other functions are suspect",
        "text": "This smart watch looks nice enough - someone could easily confuse it for an older Apple Watch - and its easy to make custom watch faces (I put a pic I took at an Iron Maiden show on mine). And it is jam packed with features - way more than some other watches in this price range.<br /><br />Unfortunately, I have trouble trusting its more advanced features.<br /><br />A number of times when taking my temperature the watch says I have hypothermia, measuring me between 87-95f. I am a 200lb man living in in Southern California and my wife won’t turn the thermostat down below 74 degrees. I don’t have hypothermia. If it can’t properly read my body temperature, there’s no way I can trust its accuracy with many of the other health features - blood oxygen, blood pressure, heart rate, etc<br /><br />That step count seems pretty accurate but ONLY once I paired the watch with the Da Fit app. Before I paired the watch, it measure me taking like 350 steps while just sitting on my couch. Not sure why it would measure differently paired or unpaired but it did - significantly. I would not recommend this as a fitness tracker for someone without a smart phone (yes, there are still a few people without smart phones).<br /><br />And the sleep tracker seems to at least get my sleep times accurate, though I am unsure how well it reads light/deep sleep as I don’t really trust the readings from it’s health sensors. I want to believe its doing a good job. I like the way the app presents the sleep timeline and information. But I just don’t know if its accurate because the watch thinks I have hypothermia.<br /><br />As for the non-health related functions, they are pretty spotty too. I stopped receiving text notifications after a couple days and could not get them to start back up again without completely disconnecting the phone from the app and starting over again.<br /><br />Pros:<br />- Looks like an old gen Apple Watch.<br />- Customizable face<br />- Lots of features<br />- Doesn’t technically *need* a smart phone for many features<br />- Step counter seems accurate when paired<br />- Great battery life for a smart watch. I wore it for 5 days without charging.<br />- Nice app<br /><br />Cons:<br />- Highly inaccurate step counter when it is not paired<br />- Health features are unreliable<br />- Notifications are unreliable<br />- The speaker in the watch sounds terrible<br />- Vibration function is weak and easily missable in active situations<br />- Sometimes the watch doesn’t ‘wake’ from sleep as easily/instantly as it should. I find myself having to give it an extra shake to wake it almost every time.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great affordable smartwatch",
        "text": "[[VIDEOID:52a9c3b58a7816ac48b831c65b3aa6ca]] This is a great smartwatch at a reasonable price. It works really well, making and receiving calls, and all of the other features. It is lightweight and charges really fast. The battery life is really good too. You cannot beat the price. Great value and highly recommended.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Unboxing",
        "text": "[[VIDEOID:53bca64d7f3459321ad803eb09c234eb]] Let's start off with what I liked. I liked that is not heavy and feels comfortable. I like the size of the overall screen of the watch. I liked that it is easy to connect to your android device. I do not like that after a free trial service of the texting and monitoring of all the apps, you have to purchase monitoring space or data. I don't like that you are limited to how many contacts you can store on the device. I do not like the overall \"ability to text feature.\" I feel that the text input data can be improved. Down to what and how you reply via messages.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "AMIHUSEl",
    "tags": [],
    "price": 69.89
  },
  {
    "id": "prod_smartwatches_191",
    "parent_asin": "B0B3DKSHVB",
    "category": "Smartwatches",
    "title": "Deeprio Smart Watch 1.69 inch for Android Phones and iOS Compatible iPhone Samsung Men Women HD Screen Oxygen Pleasure Heart Rate Monitor IP68 Waterproof Smartwatch Fitness Tracker Fitness Watch",
    "description": "",
    "rating": 3.9,
    "review_count": 795,
    "features": [
      "【Digital Watch with a HD Screen】1.69\" full touch screen give you clearly view",
      "【Blood Oxygen Measurement】Measure your blood oxygen levels to get a feeling of how your body is breathing.",
      "【Heart Rate Monitor】The smartwatch tracks your heart rate throughout the day in the most accurate way possible.",
      "【Fitness Tracker】The watch supports 14 sports modes.",
      "【Pedometer Watch】The smartwatch gives accurate records of daily steps, calories, and distance.",
      "【Sleep monitor】The watch tracks and records your sleep. E.g., telling you if you had a deep sleep, light sleep, or if you are waking up.",
      "【Calls&Notifications】Calls, messages and notifications are show on your wrist through vibration.",
      "【Customized Watch Faces】The watch comes with pre-designed image backgrounds and you could also personalize it with your own pictures.",
      "【Compatibility&Warranty】The name of the APP is Deeprio and it works with Android 6. 0 or iOS 9. 0 and above. The watch also comes with 12 months warranty."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "As easy as an Apple Watch",
        "text": "Download the app and this works great.  Very easy to use and control.  Pretty much just like an Apple Watch.<br /><br />The app lets you track different items on the watch and easily change settings or your background.  The heart rate monitor seems accurate and worked well for me as well",
        "verified": true,
        "helpful_votes": 11
      },
      {
        "rating": 5.0,
        "title": "Comfort",
        "text": "This watch features a 1.69\" square screen. You can customize it with one of their backgrounds or your own. It has a 22mm soft silicone band which fits wrists from 5.5\"-8.3\" and works with smartphones running Andros 6+ or Apple iOS 9+. This tracks time, heart rate and blood oxygen level, and sleep patterns. It can handle rain or hand washing without being ruined.this allows you to easily compare and track your wellness and sleep patterns.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 1.0,
        "title": "Will not stay connected to the phone",
        "text": "The watch will not stay connected to the phone, as the app is awful.  Do not buy this product.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Nice watch. Face was to small for a man's arm. Returned it and reordered the bigger face.",
        "text": "Nice easy to you, good functionality, easy load app.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "Can't connect to my phone",
        "text": "Well will not connect to my phone",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Deeprio",
    "tags": [],
    "price": 29.99
  },
  {
    "id": "prod_smartwatches_129",
    "parent_asin": "B08RJKPG1V",
    "category": "Smartwatches",
    "title": "ANCOOL Compatible with Garmin Forerunner 310XT Watch Band, Soft Silicone Watch Strap Replacement for Forerunner 310XT Smartwatch, Grey-Orange",
    "description": "",
    "rating": 4.6,
    "review_count": 84,
    "features": [
      "[Compatible Model] Forerunner 310XT Smartwatch. Soft watch band for Forerunner 310XT, stylish color combination sport silicone replacement watch strap for Forerunner 310XT.",
      "[ Stylish Color] The forerunner 310xt band shows different color in two sides, which gives your watch a sporty and stylish appearance.",
      "[Unique Design] Compatible forerunner 310xt band comes with muti holes, allow your wrist to breatch. Easy to adjust a proper length.",
      "[Best Gift & 24H-Online Service] Perfectly wear as accessories in business meetings and parties and very proper to be used as gifts for Wedding, birthday, Valentines' day, Mothers' day, Christmas, Thanksgiving Day etc.",
      "[Note] Smartwatch is not included.If for any reason you are not satisfied, please contact us. We are always happy to help."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Works as advertised",
        "text": "The band went on easily and has been working just fine",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Just like the original",
        "text": "Just like the original but half price...! Thanks",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "ANCOOL",
    "tags": [],
    "price": 12.99
  },
  {
    "id": "prod_smartwatches_193",
    "parent_asin": "B08V1B7FC5",
    "category": "Smartwatches",
    "title": "Garmin Descent Mk2i (Titanium Carbon Gray DLC/Black) Dive Computer Watch Divers Bundle | with PlayBetter Dry Bag Set | Dive Computer Smartwatch | Multisport Training, Air Integration | 010-02132-00",
    "description": "",
    "rating": 4.9,
    "review_count": 15,
    "features": [
      "GARMIN DESCENT MK2I DIVE COMPUTER WATCH: *GET A $200 REBATE FROM 04/16 THRU 05/31 ON YOUR GARMIN DESCENT MK2I PURCHASE* A coupon will be sent via email. This advanced, watch-style dive computer with air integration capability, multiple dive modes, along with multisport training features.",
      "NEW LEVEL WATCH-STYLE DIVE COMPUTER: Access advanced features for a range of diving activities - including the ability to plan dives on the device for recreational, technical, and free diving. Enjoy up to 80 hours in dive mode, 16 days in smartwatch mode and 15 hours in GPS mode with music.",
      "AIR INTEGRATION FEATURE: The Descent Mk2i diving and multisport watch can be paired with Descent T1 transmitter for integrated pressure monitoring on up to 5 tanks via SubWave sonar data network.",
      "MUSIC, GARMIN PAY AND SAFETY ASSISTANCE: Leave your phone at home. Using select streaming services, including Spotify & Deezer, store songs directly on your wrist (including full Spotify playlists!) and stream to your Bluetooth earphones. Spotify integration requires separate Spotify Premium membership. Experience cashless payments with Garmin Pay and feel confident on adventures with the incident, assistance, and incident detection features.",
      "GARMIN DESCENT MK2i DIVERS BUNDLE: Garmin Descent Mk2i (Titanium Carbon Gray DLC/Black Band) Dive Computer Watch, PlayBetter Waterproof Dry Bag with Window, PlayBetter Waterproof Cell Phone Pouch, Extra-Long Adjustment Strap & USB Charging Cable"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Excellent Dive Computer and Smart Watch",
        "text": "I have been wearing this for a solid 4 months, using it to track dives, swimming, running, walking, treadmill workouts, etc. In watch mode the battery lasts a long time, but for activities you will find yourself charging it after about 5-8 hours of activity use.<br /><br />I was a bit worried my skin would react as I cannot usually wear anything metal unless high quality gold or sterling silver. No problems with this watch - the band is comfortable and the watch, while a bit larger than I was used to, fits well and without any reaction.<br /><br />Functions while diving were flawless. You have a lot of parameter's you can set - this thing is designed for divers. It tracks entry and exit locations accurately. I wish I could tell it when my dive is starting and when done, the automatic feature is a bit annoying in this regard. However, it is one less thing to remember when you are in the water and doing a buddy check to get going. It is pretty neat to how nicely it updates the app on your phone and makes sharing easy.<br /><br />Pool swimming is not entirely accurate - the watch cannot record kickboard laps, for example, so if you like to vary your workout you won't have accurate times or distances. Basically, any time you are not completing actual strokes you won't get a record.<br /><br />Treadmill work - you can adjust the settings to match your treadmill readings. I found it was not very accurate and finally quit bothering to adjust it. The watch was either lower in distance or higher every time, but close enough to just let it be. At least once you leave it alone you get consistent numbers, and you can also record numbers from the treadmill if you want.<br /><br />Walking and trail running features are great - I love seeing where I was with the GPS integration. I work out regularly on a measured trail and the distances are spot-on with the MK2S. There are workouts it will suggest, but I tend to stick to my own and ignore those. I was really frustrated to find my VO2 was consistently \"Poor\" all fall, but have seen some improvement recently with regular workouts. Kind of cool getting readings like that.<br /><br />I plan to use this watch for backpacking as well - I have not had an opportunity to test it since the purchase, but my last trip my sister had a different model and it worked well other than eating power. You absolutely have to carry one or two good battery packs to charge it. I really wish this had a solar option, which I understand is in future plans, so I will more than likely upgrade when that is offered. Even so, hiking puts your wrist in the shade a lot of the time unless you are hiking alpine locations, so not sure how well solar would actually work.<br /><br />All said, I love my \"toy\". It helps keep me motivated when I see I have been in the office too long or my scores are a lot lower. I am competitive and happy to compete against myself, so it works well. I don't use the connections, although I have considered seeing if anyone I know has a Garmin, but so far its all me :D While pricy, for someone who loves a wide variety of athletic activity, you can't beat the Garmin Mk2 in any of its versions. My husband is still trying to decide if he wants the Mk2S or the Mk2i but he will be getting one or the other. Fantastic product.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "PlayBetter",
    "tags": [],
    "price": 1519.99
  },
  {
    "id": "prod_smartwatches_061",
    "parent_asin": "B09SQ64XBK",
    "category": "Smartwatches",
    "title": "Polar Vantage V2 - Premium Multisport Smartwatch with GPS",
    "description": "",
    "rating": 4.3,
    "review_count": 1038,
    "features": [
      "Premium Sleek Design for superior look and feel provides you with a high-performing, lightweight (only 52g) sports watch that won’t weigh you down whilst you train.",
      "Ultra-Long Battery Life - up to 40h of training with full GPS and HR tracking (and even up to 100h with power save options). Up to 7 days in watch mode with 24/7 HR tracking.",
      "Our World-Renowned Optical HR Technology with 10 LED’s for deeper light penetration, and 4 detectors to sense light returning through the blood vessels to track your HR with precision.",
      "The Training Load Pro and Recovery tracking tools help you optimize your training and avoid overtraining. Test your performance and personalize your heart rate, speed and power zones with the running and cycling performance tests.",
      "Fully Automatic and Intelligent Overnight Recovery Measurement applications give you daily feedback on how well you recover from stress and training during the night. This helps you make optimal choices the next day."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Good watch, I recommend",
        "text": "I came from a fitbit for long years and moved to Polar because of stats and data that I wanted! I started off with the Polar Unite since November 2020 and until now I upgraded to the Polar Vantage V2! It's worth it! I love the accuracy of polar. Heart rate, sleep and GPS is super good!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "POLAR",
    "tags": [],
    "price": 353.03
  },
  {
    "id": "prod_smartwatches_049",
    "parent_asin": "B09KNFSZRX",
    "category": "Smartwatches",
    "title": "Maledan Compatible with Fitbit Charge 5 Bands Women Men - Breathable Sport Band Soft Waterproof Replacement Wristbands Strap for Fitbit Charge 5 Advanced Fitness Tracker, 3 Pack",
    "description": "",
    "rating": 4.5,
    "review_count": 2202,
    "features": [
      "Buckle closure",
      "【Compatibility】 Maledan 3 pack stylish sport bands compatible with Fitbit Charge 5. Precise & durable connectors can seamlessly lock onto your watch and keep it secure( Note: only for Fitbit Charge 5 replacement bands. NO tracker included )",
      "【Double Buckle & Fastener Notch】 Multi-holes design band with double metal buckle, keeps your charge 5 bands secure and stable, even during high-intensity workouts. And a strap holder with a notch to secure the extra length. Never worry about falling off",
      "【Flexible & Adjustable】 We make this charge 5 band one size, and add the design of 5 holes rows, which fits for most wrist size: for 130mm - 220mm(5.1\"- 8.7\") wrist. There is always a air-hole right for you, whether it's a big or tiny wrist",
      "【Soft, Breathable & Waterproof】 Maledan design for Fitbit Charge 5 bands are made of high-grade skin-friendly elastomer TPU, sweat & water resistant; More ventilation holes will allow the air and liquid pass easily, very lightweight & comfortable to wear",
      "【Must Buy Sport Bands for Charge 5 Accessories】 Our charge 5 accessory band for women men comes with various decent & vivid colors, different color strap combo offer you a great affordable option to dress up your watch. Always 24/7 friendly support for you"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Changing my review",
        "text": "Band does not clip completely into the FitBit--in fact, you do NOT get that snug \"\"snap\" or \"click\" sound when you attach it. It fell off my wrist 3 times in yoga this morning. Returning this junk.<br /><br />I bought these so I'd have something other than the band that came with my Fitbit Charge 5. These are okay. They look fine, but they are really, really long, with no way to shorten them. I have small wrists (5 3/4\") and as you can tell from the photo, the end of the band comes almost to the watch face on the other side and sticks up. I did eventually pull the tab so that it lays flat, but I'm not used to having the end of the watch band on the side. The product description online says it fits a wrist 5.1\" to 8.7\". If my wrist was any smaller, the band would probably cover the watch face. Unfortunately, there wasn't a \"small\" option.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Comfortable and durable",
        "text": "Very comfortable, great value",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great product",
        "text": "My son and daughter in law both have these bands. My original band was fine but my arm felt sweaty and itchy under it sometimes. Since both loved these bands, I ordered one. The band snapped on easily and is very secure. Love the colors. Fits nicely. Great quality for price.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Nice",
        "text": "Good color and comfortable. Love the breathable holes as well.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great value",
        "text": "I love this Fitbit band - it’s very breathable & comfortable.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Maledan",
    "tags": [],
    "price": 9.99
  },
  {
    "id": "prod_smartwatches_180",
    "parent_asin": "B07C914HZJ",
    "category": "Smartwatches",
    "title": "SHANGPULE Fitbit Charge 2 Wrist Band, Stainless Steel Metal Replacement Smart Watch Band Bracelet with Double Button Folding Clasp for Fitbit Charge 2 (Black)",
    "description": "Friendly Reminder\nOur product only sold by ”Shangpule ” please confirm about it when place your order, Only ”Shangpule”customer will enjoy 100% Satisfaction Guaranteed\nSpecification\nItem material: Stainless Steel\nPackage Included:\n1 x Stainless Steel Band 1 x Link Removal Tool\nAbout Us:\nShangpule is a specialist of electronical accessories, Shangpule team provide our customers lifetime friendly after-sale service; Any problems or dissatisfied please feel free to contact us via Amazon message system. We will help you to solve all problems at the first time.",
    "rating": 4.3,
    "review_count": 2536,
    "features": [
      "Custom designed for your fitbit charge 2, this stainless steel watch band features a combination of functionality and style.",
      "Band comes with adapter on both ends, which locks onto watch band interface precisely and securely. Easy and direct installation and removal. Unique double button folding clasp.",
      "High-tech surface finish watch strap fits your device and feels comfortable on your wrist. Fits 5.1\"-8.2\" (130mm-208mm) wrist.",
      "Precise designed to fit well for most wrist. User can adjust the length easily using the provided tool.",
      "100% Satisfaction Guarantee: one year warranty and lifetime customer service, please contact us via Amazon message system for any questions, we will reply you within 24 hours and try our best to solve your problems."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "Great quality. Very nice",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Wouldn't fit wrist",
        "text": "Love the look. Had to return due to the fit on wrist. It is not expansion, remove 1 link was to tight, remove 2 it's to loose.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "This is a man's band",
        "text": "The band was too heavy and wide to be considered unisex.  I returned it.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Love it!",
        "text": "I love it! My Fitbit Charge 2 kept popping out of the original band. This one is sturdy, stylish and was easy to adjust the size with the tool enclosed. Highly recommend!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Excellent",
        "text": "Best replacement that I have gotten yet to the original band.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "SHANGPULE",
    "tags": [],
    "price": 15.99
  },
  {
    "id": "prod_smartwatches_014",
    "parent_asin": "B08KY36YGC",
    "category": "Smartwatches",
    "title": "Leather Bands Compatible with Fitbit Versa 3/ Fitbit Sense,Soft Replacement Band Wristband Leather Accessories for Fitbit Versa 3/ Fitbit Sense Smartwatch Women Men B-Black",
    "description": "",
    "rating": 4.2,
    "review_count": 61,
    "features": [
      "Buckle closure",
      "Compatibility: Compatible with Fitbit Versa 3/ Fitbit Sense fitness smart watch, classic leather strap replacement for women and men.",
      "Soft and Comfortable: These Fitbit versa 3 bands are made of genuine leather, which will provide comfortable touch feeling on your wrist, lightweight and durable for your daily use.",
      "Easy to Install: Comes with stainless steel quick release pin, this leather band allows you to install and remove your band easily. Fits for your Fitbit Sense/ Versa 3 smart watch seamlessly and securely, no hassle to replace strap for new look.",
      "Adjustable Strap: Suitable for most wrist sizes about 6.6-9.1inches/ 170mm-230mm, small or large. There are many precise holes on the strap, so that you can easily adjust the Fitbit Versa 3 band to fit your wrist size.",
      "Various Patterns: This fashion leather watch bands for Fitbit Sense/ Fitbit Versa 3 is designed to dress up your watch. Perfect for many occasions like office, leisure, party, date, travel, etc."
    ],
    "reviews": [
      {
        "rating": 2.0,
        "title": "Doe Not Fit a Man's wrist",
        "text": "My husband's wrist is less than 8\" and you cannot comfortably latch the band into place so that it isn't too tight or too loose.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Amazing",
        "text": "Amazing",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "IMPAWFAN",
    "tags": [],
    "price": 9.99
  },
  {
    "id": "prod_smartwatches_115",
    "parent_asin": "B08FB5JPKX",
    "category": "Smartwatches",
    "title": "Baaletc for Garmin Approach S20 S5 S6 Watch Bands Replacement Colorful Strap Wristband Accessories for Approach S20 Smartwatch (navy-black)",
    "description": "",
    "rating": 4.6,
    "review_count": 1875,
    "features": [
      "【Compatible Models】- This replacement silicone band compatible with Garmin Approach S20 S5 S6 Smart Watch (No tracker included).",
      "【Install Simply】- Easy to remove or replace your current watch band.Assemble the needle through Garmin Watch lugs,then using tools to tighten the screws on both ends.",
      "【Adjustable Size】- Fit for 5.11\"--8.46\" (145mm-210mm) wrist.And you can move the holes and clasp placement to adjust size.Accessories Package include screw drivers, pins and one more watch loop.",
      "【Various Colors】- Delighted varied colors personalized your smart watch in a individual style,color combo can match your different mood and outfits.",
      "【Promise】- We promise to provide 100% satisfaction service for our customer, if you have any problem or receive defective item,please give us an opportunity to assist you to solve the issue."
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "Eh...",
        "text": "They fit well. Drivers were a nice item have include. The band keeps are what's keeping this from a 5 star review. They don't keep well, and slide allover.<br /><br />If you're buying these for a Garmin device, and just for the keepers, you can get replacement keepers for free through their website with your device serial number.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Fits Gorman watch",
        "text": "Easy to attach.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Fit a little off",
        "text": "Watch-band is a little too narrow when it is connected to the body of the watch.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Holds up better than the old",
        "text": "Fits really well on my Garmin gold watch.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "It fits Garmin Approach S20 Golf Watch PERFECTLY!!!",
        "text": "The \"Baaletc for Garmin\" Approach S20 colorful wristband is easy to install as the necessary tools are included. The band is lightweight, comfortable & stylish. A Garmin representative gave the following part number (010-12361-01) needed that would fit this golf watch & recommended Amazon. This band fit perfectly. Highly recommend.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Baaletc",
    "tags": [],
    "price": 7.97
  },
  {
    "id": "prod_smartwatches_125",
    "parent_asin": "B09BJK8KJV",
    "category": "Smartwatches",
    "title": "TenCloud Leather Bands Compatible with Fitbit Luxe, Classic Wristbands Metal Connectors Replacement Leather Strap for Luxe Fitness Tracker Women Men (Blue)",
    "description": "Leather Bands Compatible with Fitbit Luxe, TenCloud Classic Wristbands Metal Connectors Replacement Leather Strap for Luxe Fitness Tracker Women Men\nMaterial:\nSoft leather\nSize:\nOne size of 5.5\" - 8.1\", suitable for most people, no matter men, women, teenagers, or the aged. Precise multiple alternative holes allow you adjust the suitable size, with comfortable touch feeling on your wrist.\nWeight:\n19g/21g\nColor Available:\nBlack/Blue/Red/Pink/Brown\nFeature:\nIt’s thin/light and comfortable.  Package: Leather replacement band Compatible with Fitbit Luxe, smartwatch is not included\nNoticet:\nPlease DO NOT wear this band for longtime underwater activities -- such as shower, swimming, etc. It is recommended to put it in the ventilated place after you exercise sweat.",
    "rating": 3.7,
    "review_count": 88,
    "features": [
      "Elegent Replacement Straps Leather: This leather band can keep your tracker secure on wrist. It is a great choice to dress up your Luxe watch, fits for wrist size about 5.5-8.1 inches.",
      "Leather Bands Compatible with Fitbit Luxe fitness tracker.",
      "Material: Made of premium leather, the replacement band is soft and comfortable, suitable for any occasions like travel, party, work etc. Come with the texture makes the strap more attractive.",
      "Simple Installation: Premium metal connectors fit with the device as original. When you slide the band into your tracker, you could hear a \"Click\" sound, then \"fell apart\" issue solved!",
      "Notice: Please DO NOT wear this band for longtime underwater activities -- such as shower, swimming, etc. It is recommended to put it in the ventilated place after you exercise sweat."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Thanks",
        "text": "Thanks for keeping me away from the rubber wrist bands. I'm allergic and I prefer leather or metal bands.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Luxe replacement bands are hard to find. This one fits the bill.",
        "text": "Good leather. Even stitching. Nice appearance. Good value for money.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Review",
        "text": "Band is really stiff. It will probably soften up with wear.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "TenCloud",
    "tags": [],
    "price": 10.99
  },
  {
    "id": "prod_smartwatches_149",
    "parent_asin": "B07F5BRP35",
    "category": "Smartwatches",
    "title": "for Mi Band 4 Strap/Mi Band 3 Strap Replacement Xiaomi Mi Band 4 Smart Watch Wrist Strap Bands for Women Man",
    "description": "Only suitable for xiaomi bands 4/3(Not for GO-TCHA)(Not for Xiao Mi Band 2S)\nThe Xiaomi bands 3 are made of high quality tpu+tpe material for Xiaomi 3/4 Smartwatch for men or women.(The Xiaomi 3/4 device is not included)\nOurXiaomi bands 4/3 is free size, and we provide a variety of patterns and colors for you to choose from.\n1. Easy on/off: you don't need any other tools to replace. It's simple and convenient.\n2. The advantages of tpu material: Xiaomi bands 4/3 are made of tpu material, it is soft and elastic. and it's able to attach it to your arm more safely. Don't worry about losing.\n3. The advantages of Xiaomi bands 3 patterns: We provide a variety of patterns and colors. According to your mood to choose the style to wear. So cool!",
    "rating": 4.5,
    "review_count": 1554,
    "features": [
      "★Xiaomi bands 3/4★ This Xiaomi bands 3/4 can be replaced with a smart bracelet replacement wristband which is made of high quality silicone material.(The xiaomi device is not included)",
      "★Variety of colors to choose★ We offer a variety of patterns and colors for you to choose from. The Mi 4 bands size is free size 5.9\" -8.3\" wrist, easy to replacement your xiao mi 3/4 tracker",
      "★Xiaomi bands 3/4 weight ★ Xiaomi 3 bands are made of silicone material . This Xiaomi 3 band is light weight and easy to wear. the weight of Miband 3 bands is 0.03lb",
      "★Material&Structure★ Miband 3/4 bands was made by TPU,very high quality bands.The edge of the band is polished to be smooth and will not snag your clothes. It's flexible, durable and comfortable for daily wear",
      "★6 months shelf life★ We are confident about our replacement bands for Xiaomi 3/4 sport strap. Hence You can get an exchange or refund if your band has any quality issues within 6 months"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great value",
        "text": "Love the colors and price.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Baaletc",
    "tags": [],
    "price": 12.59
  }
]