[
  {
    "id": "prod_running_shoes_145",
    "parent_asin": "B077Z9H72C",
    "category": "Running Shoes",
    "title": "Reebok Men's Driftium Running Shoe",
    "description": "Reebok was founded for one of the best reasons possible: athletes wanted to run faster. So in the 1890s, joseph william Foster made some of the first known running shoes with spikes in them. By 1895, he was in business making shoes by hand for top runners; and before long his fledgling company, j.W. Foster and sons, developed an international clientele of distinguished athletes.\nReebok was founded for one of the best reasons possible: athletes wanted to run faster. So in the 1890s, Joseph William Foster made some of the first known running shoes with spikes in them. By 1895, he was in business making shoes by hand for top runners; and before long his fledgling company, J.W. Foster and Sons, developed an international clientele of distinguished athletes.",
    "rating": 4.6,
    "review_count": 243,
    "features": [
      "Textile and Synthetic",
      "Imported",
      "Rubber sole",
      "Shaft measures approximately low-top from arch",
      "Reebok Shoes",
      "Imported"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great running shoes",
        "text": "I have no complaints about thus shoe.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Reebok",
    "tags": [],
    "price": 47.99,
    "position": 1,
    "page": 1
  },
  {
    "id": "prod_running_shoes_075",
    "parent_asin": "B09XZLV44K",
    "category": "Running Shoes",
    "title": "New Balance DRFT Running Shoe White",
    "description": "New Balance DRFT Women's Running Shoe Complete your next exercise wearing the New Balance DRFT Women's Running Shoe! This style has a breathable mesh upper with a cushioned with a supportive lace-up closure and padded collar. The cushioned insole adds padding and support on the go, while the rubber outsole is lightweight and flexible, perfect for every workout. Move smoothly and comfortably wearing the New Balance DRFT Women's Running Shoe! Lace-up closure Breathable mesh upper Cushioned insole Rubber outsole Padded collar White/Black/Purple Imported | New Balance DRFT Running Shoe White",
    "rating": 4.6,
    "review_count": 54,
    "features": [
      "Imported",
      "Rubber sole",
      "Lace-up closure",
      "Breathable mesh upper",
      "Cushioned insole",
      "Rubber outsole",
      "Padded collar"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Comfortable",
        "text": "Very light and comfy.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "very comfortable",
        "text": "I love New Balance tennis shoes.  They seem to fit my feet so well.  My last pair was well worn out, so I searched on Amazon to find a new pair.  I found these and the price was so good that I ordered them.  They fit perfectly and I love them.  So cozy to wear.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "New Balance",
    "tags": [],
    "price": 58.86,
    "position": 2,
    "page": 1
  },
  {
    "id": "prod_running_shoes_097",
    "parent_asin": "B09VB9Z2P4",
    "category": "Running Shoes",
    "title": "M MGRNDL Womens Air Running Shoes Breathable Tennis Fashion Sneakers for Walking Jogging Gym",
    "description": "",
    "rating": 4.1,
    "review_count": 162,
    "features": [
      "Rubber sole",
      "Platform measures approximately 1.00\"",
      "Air Cushion: M MGRNDL women's air running shoes features air cushion design to provide cushioning and support for the feet, protect your knees.",
      "Breathable Mesh: Double-layer knitted fabric upper designs with unique knitted structures make the upper more breathable and comfortable.",
      "Memory Foam Sole: The memory foam insole and the low-density PU outsole offer these sneakers great cushioning.",
      "Occasions: Slip on sneaker suits for daily, walking, running, shopping, traveling, working, driving, jogging, training, playing tennis, casual outdoor, etc.",
      "Easy slip on sneakers: This style of shoelaces is more inclined to decoration, which is suitable for adjusting the tightness of the shoes themselves. Very easy on and off. Medium width. We recommend the wide feet to choose a half size up."
    ],
    "reviews": [
      {
        "rating": 2.0,
        "title": "Cut Foot",
        "text": "At first glance these shoes looked ideal. The uppers are mesh and they tie. The black and white look sporty. But the shoes left a,cut on the top of my left foot. The piece that holds the lace is not padded and it rubbed and cut the top of the foot. The right one was okay. Just not acceptable. I suppose yoi could afgix pads to prevent the rubbing or better yet buy shoes without that problem.",
        "verified": false,
        "helpful_votes": 1
      },
      {
        "rating": 4.0,
        "title": "Great for walking and running, on even or paved surfaces.",
        "text": "[[VIDEOID:c1b550fb45bc70f6146cd85777443b05]] The M MGRNDL sneakers are light, a bit flexible, and the air cushion design provides a cushioned impact. They have a good grip on surfaces, so they provide stability.<br /><br />They do look good and the upper mesh fabric has some breathable properties.<br /><br />They do a good job when walking and running short distances.<br />I would have liked if they mold to the foot better and had softer fabric, but at this price point it might be hard to find.<br /><br />The M MGRNDL might not provide a good experience when running on uneven surfaces. They are not as comfortable as other well known and higher priced (twice as much) running sneakers brands.<br />The air cushion do provide a bit of support and comfort when running on even ground, such as concrete, pavement, grass or sand.<br />They do provide some level of impact resistant and support on the feet.",
        "verified": false,
        "helpful_votes": 1
      }
    ],
    "store": "M MGRNDL",
    "tags": [],
    "price": 19.99,
    "position": 3,
    "page": 1
  },
  {
    "id": "prod_running_shoes_041",
    "parent_asin": "B07HQX118J",
    "category": "Running Shoes",
    "title": "Nike Women's Odyssey React Flyknit 2 Running Shoes Teal Tint and Sail 8.5",
    "description": "",
    "rating": 4.1,
    "review_count": 13,
    "features": [
      "Rubber sole"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Comfortable",
        "text": "Sneakers are super light and comfortable. Perfect for running, walking or jumping rope; I have plantar fasciitis and I don't feel pain when wearing these.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Nike",
    "tags": [],
    "price": 85.0,
    "position": 4,
    "page": 1
  },
  {
    "id": "prod_running_shoes_099",
    "parent_asin": "B0844MLRFB",
    "category": "Running Shoes",
    "title": "Xero Shoes Men's HFS Running Shoes - Zero Drop, Lightweight & Barefoot Feel",
    "description": "",
    "rating": 4.5,
    "review_count": 1129,
    "features": [
      "A NEW LIGHTWEIGHT road running shoe. Foot-shaped for comfort. Built for speed!",
      "Made in the USA or Imported",
      "GRIP + COMFORT - Flexible to support natural foot motion, and grippy with its tire tread-inspired FeelTrue rubber sole",
      "SHAPED FOR COMFORT, BUILT FOR SPEED - Xero HFS features a lightweight, minimalist build that contours to the shape of your feet. Its spacious toe-box allows you to splay, spread, and relax your toes for superior comfort",
      "XERO DROP SOLE FOR PERFECT POSTURE - The Xero Drop sole offers a non-elevated heel and is low-to-the-ground - this allows for proper posture, balance, and agility for all-round performance",
      "FLEX YOUR FEET, FEEL THE FLOOR - Our tire tread inspired patented 5.5mm FeelTrue sole strikes a balance between just-right protection and feedback - it delivers heel to toe cues to the brain for your best run ever. Allows your feet to bend and flex as nature intended",
      "TRAVEL FRIENDLY, 5000 MILE WARRANTY - Xero HFS’ extra-durable construction is backed by our 5,000 Mile Feel the World Sole Promise. Being ultra-flexible, you can roll ‘em up and put in your pack or pocket for compact storage and easy travel",
      "VEGAN FRIENDLY - Xero Shoes believes in promoting healthy and sustainable lifestyles which is why the HFS is made with zero animal products"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Surpassed My Expectations",
        "text": "I feel like now I can write an honest review. I have run for years, 3 5k per week. My go to shoes were NB or Brooks and I loved them. Started seeing Xero Shoes pop up on social media and YouTube. I looked them for months and it seemed like a gimmick product. After some time I said ok I am going to try this shoe and see if they meet their hype. In July of this year I ordered the Prio Cross Trainer model. Now their instructions said adjust over a couple of weeks. Well I said hell no and put them to the test right out of the box. I wore them every chance I got for 30 days straight. I found them comfortable right out of the box and I did not experience any foot or leg discomfort during the break period. I began liking them the more I wore them. At day 31 I put my Brooks Adrenaline runners on. Within 15 mins I was aware of how unbalanced I was in that shoe and while walking around in my home said, I can’t wear these any more I have to put my Xero Shoes on. I swear I referred to them specifically. I have since purchased 2 pairs of the HFS model runners and they are my favorite shoe. I wear them every day. In my old shoes at the end of the day I would change to my slides, I literally have these on until I go to bed. Closest thing to walking barefoot and still having a shoe on.",
        "verified": true,
        "helpful_votes": 7
      },
      {
        "rating": 5.0,
        "title": "If you like barefoot shoes give these a try.",
        "text": "I wear a size 11 in most running shoes. Ordered a 10 1/2 in this and it fits great. My feet are on wider side so shorter sizes work for me if the shoe is somewhat wide. Really comfortable and appears well made. I look forward to trying other models. Unlike many other barefoot manufacturers I didn’t see any irregularities in how the shoe was put together.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Comfortable as \"bare foot\" shoes",
        "text": "I have purchased 2 Xero Men's HFS Running Shoes - Zero Drop and I have been very happy and comfortable wearing them. I've successfully walked and run with them when I visited Philippines for a month and have gotten used to the \"bare foot\" concept. Although I'm still comfortable wearing my Adidas running shoes, I found myself to be wearing my bare foot shoes more often now as I really find them much lighter, comfortable (for bare foot shoes) and lighter/easier to pack on day or extended trips. I've only been wearing them for the last 2 months or so, so long term I would still need to see how they stand up.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Forms to feet",
        "text": "Really nice lightweight shoes that forms to feet rather than walking with slight incline on heel. One of the best work out shoes there are. Not for running or basket ball- in my opinion, though more for stretching, walking,  calisthenics, boxing or light aerobics.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Crazy not as comfortable as NEw BaLanCe Minimus",
        "text": "The sole needs a bit more cushion.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Xero Shoes",
    "tags": [],
    "price": 124.99,
    "position": 5,
    "page": 1
  },
  {
    "id": "prod_running_shoes_033",
    "parent_asin": "B005CZ2Q0A",
    "category": "Running Shoes",
    "title": "Sof Sole -Womens Cleat,running Shoes,cleats track and field equip -Ment, Silver, 3 8-Inch US",
    "description": "",
    "rating": 4.2,
    "review_count": 90,
    "features": [
      "100% Leather",
      "Rubber sole"
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "Three Stars",
        "text": "ok",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "works great",
        "text": "Needed this for a track meet. Worked great.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Works perfectly",
        "text": "Son uses for cross country and track! He loves them.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Fits and works well. WIll buy again.",
        "text": "Great product",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "They still worked great though!",
        "text": "I bought this for my brother for cross country. These however are track spikes and not cross country spikes. They still worked great though!",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Sof Sole",
    "tags": [],
    "price": 6.99,
    "position": 6,
    "page": 1
  },
  {
    "id": "prod_running_shoes_138",
    "parent_asin": "B07J5CPW33",
    "category": "Running Shoes",
    "title": "FLARUT Running Shoes Womens Lightweight Fashion Sport Sneakers Casual Walking Athletic Non Slip",
    "description": "",
    "rating": 4.2,
    "review_count": 9790,
    "features": [
      "leather-and-rubber sole",
      "Functional: Engineered Arch support and cushioning heel that it enhances comfort and safety",
      "Out-soles: Non slip, flexible rubber sole with air cushion which offer for stability and maximum moving",
      "Uppers: Breathable and durable mesh fabric material makes your feet feel cool and clean",
      "Lining: Breathable fabric lining for a great comfortable in-shoe feel",
      "Applications: runing,walking,jogging,outdoor/athletic,gym,workout,training,indoor"
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Size matters",
        "text": "I loved everything except the sizing is off - I ordered a 7 but they were too small so I sent them back and ordered an 8 they were too big- so I don’t know what to think- but I’ll wash them to shrink a little and tie them up tight cause I like evielse about them and I’m too tired to send them back again",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Light weight",
        "text": "Not much cushioning but I’ll buy an insert. Great color!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Cute and Sporty",
        "text": "Super Cute and Comfy! Nice quality style. They have an original appearance,  not like a knock-off item. Love them!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "They are terrible!!",
        "text": "Bought these shoes for wearing around the house and yard. Big mistake! The material that they have as an insole is very thin and when you put them on and stand up you can feel all the little sharp edges of the plastic sole. It was somewhat shocking when I stood up. I tried a cheap pair of insoles at the dollar store thinking that might’ve helped. As far as I am concerned they weren’t even worth returning, into the garbage they went.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Comfort",
        "text": "These shoes are a comfortable fit for all day.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "FLARUT",
    "tags": [],
    "price": 32.99,
    "position": 7,
    "page": 1
  },
  {
    "id": "prod_running_shoes_113",
    "parent_asin": "B076JJ7618",
    "category": "Running Shoes",
    "title": "ASICS Jolt Men's Running Shoe",
    "description": "Mens ASICS Jolt :: Durable, lightweight, synthetic overlays, neutral cushioning.",
    "rating": 4.6,
    "review_count": 953,
    "features": [
      "Rubber sole"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Affordable and comfortable",
        "text": "Update: I decided to keep these. Ok, so I am ashamed to wear them with jeans and a tee, I tried them for everyday but couldn't get over what I'll call the &#34;dad sneakers&#34; look. But I took these for a run and wow! They're very comfortable. A little clunky but flexible enough for daily training and the cushion is just right for me, sightly on the plush side but not squishy. These are my new daily runners. I don't know how long they'll last, but for the price, if I get 200 miles, I'll be happy.<br /><br />Also, if you're a 3e/4e and you like or need a wide toe box, these will deliver. I'm a smaller 4e but i need a wide toe box, especially since I'm not willing to give up my injinji toe socks. These are very spacious with plenty of room for my toe splay.<br /><br />-----<br /><br />Original review: From the product pictures I wasn't sure if I'd like them or hate them. But for the price I figured I might as well try them. They fit nicely, have moderate cushion, and they're more flexible than I expected. They're basic sneakers, no bells or whistles. But they're comfortable enough I would try running in them. They're certainly not fashion forward, but I wouldn't be ashamed to wear them with jeans and a tee. And if you're looking for extra-wide these fit like a true 4e. I expected to hate them but I'm pleasantly surprised and I'll probably keep them and use they for everyday sneakers or runners.",
        "verified": true,
        "helpful_votes": 8
      },
      {
        "rating": 5.0,
        "title": "these feel great and I'm on my feet all day as a ...",
        "text": "I have lots of foot issues, these feel great and I'm on my feet all day as a cook!",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Fits well and comfortable",
        "text": "My husband really liked it and said it’s really comfortable.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "quality shoe",
        "text": "second pair i have bought great fit and wear forever",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Just a little low at ankle",
        "text": "Just a little too low at ankle, so it doesn’t feel like enough support.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "ASICS",
    "tags": [
      "Best Seller"
    ],
    "price": 189.99,
    "position": 8,
    "page": 1
  },
  {
    "id": "prod_running_shoes_131",
    "parent_asin": "B0BQLVMB44",
    "category": "Running Shoes",
    "title": "New Balance Men's FuelCore Coast V4 Running Shoe",
    "description": "Whether you're running at the gym or wearing on the streets, the new fuel core coast V4 unites convenience and comfort for the ultimate everyday athletic shoe. The ground contact eva outsole creates a lightweight ride while bootie construction has a second-skin feel and is easy to slip on and go.\nNew Balance, is dedicated to helping athletes achieve their goals. It's been their mission for more than a century. It's why they don't spend money on celebrity endorsements. They spend it on research and development. It's why they don't design products to fit an image. They design them to fit. New Balance is driven to make the finest shoes for the same reason athletes lace them up: to achieve the very best.",
    "rating": 4.4,
    "review_count": 2181,
    "features": [
      "50% Synthetic, 50% Mesh",
      "Imported",
      "Rubber sole",
      "Laser Engraving",
      "NB Response 2.0 Performance Insert",
      "Bootie Construction",
      "Synthetic/Mesh Upper"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Love them!",
        "text": "Light weight with a great fit. Perfect for travel or day to day wear.  They handled a solid day of walking around city streets in comfort.  I’m ordering another pair in a different color.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Super Light weight",
        "text": "The style, color and the lightweight of the material and sole make a perfect shoe. We will see in time if they stand up to my husbands daily regime at the gym.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great running and walking shoe",
        "text": "Wonderful product, fit perfectly, wash in washing machine NOT HOT WATER, warm or cold so glued parts do not come apart. They wash many, many times with no ill effects.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "a lite duty general purpose shoe",
        "text": "I hd to send back my normal size, a 9EEE, for a size larger.  I've had this variation in size before with  New Balance so beware.  I'm still giving it 5 stars for style and price.<br /><br /> You may have noticed that price varies considerably with the color sub/style you choose.  Mine were only $21 while others are substantially more.  I assume construction is the same on all of them?  Maybe the price is based on the current inventory?  My price dropped slightly after I ordered.<br /><br />While it is sold as a running shoe (?) and is probably adequate for this purpose  a serious high mileage runner would probably pay more to get more.  If you can get the right price point as I did they are certainly worth a try as a general purpose/athletic/walking shoe.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Very nice",
        "text": "Comfortable, fit well, sharp looking.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "New Balance",
    "tags": [
      "Sponsored"
    ],
    "price": 70.14,
    "position": 9,
    "page": 1
  },
  {
    "id": "prod_running_shoes_142",
    "parent_asin": "B09MNM6GM2",
    "category": "Running Shoes",
    "title": "XIANV Women Men Running Shoes Breathable Slip On Sneakers Mesh Sport Athletic Fashion Tennis Comfort Fitness Walking Shoes",
    "description": "",
    "rating": 4.2,
    "review_count": 724,
    "features": [
      "Rubber sole"
    ],
    "reviews": [
      {
        "rating": 3.0,
        "title": "8.5 was a 41? It should be 42",
        "text": "Ordered a us 8.5 and a 41 was delivered. Every other 8.5 I have ordered has said 42 as the size. This caused my toes rub and touch the ends of the shoe. I believe sizing is wrong. Has just for fun new fashion printed on the sides which make the shoes loook really cheap. Bottom green portion not as dark as product pictures bust is acceptable. Order half a size larger then normal.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 4.0,
        "title": "A good pair of shoes",
        "text": "Bought for running but they are not performing well. They are too stiff. You get you what you pay for. So no complaints. They are surprisingly stylish. I wear them everyday.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Exactly as described",
        "text": "Fits well.  Very nice product.  Love the colors.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Worth it.",
        "text": "Comfortable right out of box. No breaking in. Love them.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Bien",
        "text": "Las trenzas o cordones podrían ser de mejor calidad aunque cumplen la tarea.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "XIANV",
    "tags": [],
    "price": 16.99,
    "position": 10,
    "page": 1
  },
  {
    "id": "prod_running_shoes_081",
    "parent_asin": "B091QY8JJJ",
    "category": "Running Shoes",
    "title": "Brooks Women's Bedlam 3 Running Shoe",
    "description": "",
    "rating": 4.2,
    "review_count": 473,
    "features": [
      "Rubber sole",
      "THIS WOMEN'S SHOE IS FOR: The Bedlam 3 is perfect for runners who want a shoe that helps them by giving energy back with each step and supports the way their body naturally wants to move.",
      "ENERGIZED CUSHIONING: Built with our best energy return, the DNA AMP midsole gives you back more of the effort you put in.",
      "SECURE, SOCK-LIKE FIT: Redesigned Fit Knit upper provides a secure, sock-like fit that moves with you.",
      "GUIDERAILS HOLISTIC SUPPORT SYSTEM: We’ve shifted our focus beyond the feet to the most injury-prone part of a runner’s body: the knees. GuideRails support keeps you moving comfortably by keeping excess movement in check.",
      "WEAR TESTERS SAY: “ I love the energy I have in these shoes, they are light but powerful! Traction and stability are very strong as well.”"
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Change the laces",
        "text": "These tennis shoes are very comfortable but the laces won’t stay tied.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Brooks",
    "tags": [
      "Sponsored"
    ],
    "price": 135.72,
    "position": 11,
    "page": 2
  },
  {
    "id": "prod_running_shoes_103",
    "parent_asin": "B0C699QDPJ",
    "category": "Running Shoes",
    "title": "Brooks Men's Ghost 14 Neutral Running Shoe",
    "description": "Smooth roads are ahead when you put on the Ghost 14. This award-winning runner favorite now features 100% DNA LOFT in the midsole, for a softer, smoother ride. We’ve also improved the fit so the shoe adjusts even more comfortably to your foot.",
    "rating": 4.7,
    "review_count": 14830,
    "features": [
      "THIS MEN'S SHOE IS FOR: Runners looking for a smooth ride that won’t distract from the fun of the run. The Ghost 14 offers a simplified midsole construction which creates more seamless transitions. This Brooks Ghost 14 is a certified PDAC A5500 Diabetic shoe and has been granted the APMA Seal of Acceptance. We recommend ordering Brooks running shoes 1/2 to one size larger than your dress shoe.",
      "SUPPORT AND CUSHION: The Ghost 14 offers neutral support while providing high energizing cushioning. Ideal for road running, cross training, the gym or wherever you might want to take them! Predecessor: Ghost 13",
      "BALANCED, SOFT CUSHIONING: BioMoGo DNA and DNA LOFT cushioning work together to provide a just-right softness underfoot without losing responsiveness and durability - yet it feels lighter than ever. DNA LOFT now makes up the entire midsole, for a softer, smoother, ride.",
      "SMOOTH, STABLE RIDE: No matter how your foot lands, our Segmented Crash Pad - an integrated system of shock absorbers - will cushion every step and stride for smooth heel-to-toe transitions.",
      "SOFT, SECURE, FIT: More strategic use of the 3D Fit Print upper technology provides structure that moves with the foot."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Great fit",
        "text": "Fits as expected and extremely comfortable. Favorite running shoes ever",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "The Brooks Ghost line is my favorite 10k-Marathon shoe",
        "text": "I've been using the Ghost by Brooks since I believe the Ghost 6. They're great for casual walking or if you like 10K-Marathon distance runs. Until they mess them up, I'll continue to purchase them.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "A disappointment",
        "text": "Wore these shoes to work and after 3 weeks have 3 rips on sides of shoes and a hole on top of shoe.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "These Brooks running shoes are the best sneakers that you can buy. Very comfortable.",
        "text": "These Brooks running shoes are the best sneakers that you can buy. Very comfortable.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Brooks has lost a step on wear/quality, but still a very good shoe",
        "text": "First, Brooks is a top running shoe manufacturer, and I always like buying their products, and they are to be applauded for releasing shoes in widths, which lets you get a shoe that fits, which is essential.  If a shoe does not fit properly, then it will be extremely difficult to run (or walk any distance in).  The Brooks Glycerin is one model up from the Ghost, that has better cushioning, but is no longer available in a Narrow width, and is more expensive, but the Ghost is a pretty good shoe on its own.  I would have given the Ghost 5 stars, but the Ghost 14 is not quite perfect, having two areas where it could be better (and was better previously).<br /><br />The first picture shows a Ghost 14 (on the left), next to a Ghost 13 (the previous model, on the right), and you can see the Ghost 14 has less tread, so wears out sooner, I would say roughly 50-75 miles of road (asphalt) running.  The picture shows both shoes new.  The Ghost 13 also was a little more cushioned, but you can offset that some by putting a different insole in the 14, and a lot of runners replace the insoles anyway.  The thinner tread means less mileage on the 14s, but still probably as good as most of the competition, just no longer better here.<br /><br />The second pictures shows the upper collar on a Ghost 14, and the fabric Brooks is using there (not so much on the 13 and earlier models) is nice and soft, but does not hold up.  I generally see holes or failures at the top of the lace area, and on some shoes, towards the back collar area.  You get a lot of fraying, sometimes holes, which is more an appearance problem than anything that would impact running in them, but means also you cannot wear them casually, at least where someone might see the failures.  That may be an aspect that is supply chain related, they used to hold up better,  but I have seen the problem on two pair of Ghost 14s, and other manufacturers do a bit better (probably needs a bit more nylon, to hold up longer).<br /><br />I will say that the Ghost 14 has a narrower tongue at the top, that is shared with the 13 but was new there, and I have not seen it much in other shoes, but actually works very well, so I give kudos to Brooks on that design innovation.  There is less chance that during a run the tongue will shift over into the forefoot, at least in a painful way, and you don't have to stop to shift it back.<br /><br />So overall, particularly at this price point, the Brooks continues to be good value and one of the top shoes to consider, but as with anything, there are a couple of areas that could use further improvement.",
        "verified": false,
        "helpful_votes": 1
      }
    ],
    "store": "Brooks",
    "tags": [
      "Sponsored"
    ],
    "price": 139.8,
    "position": 12,
    "page": 2
  },
  {
    "id": "prod_running_shoes_123",
    "parent_asin": "B08HP3TR7P",
    "category": "Running Shoes",
    "title": "Nike Women's Running Shoe",
    "description": "Nike Women's Enigma Nike Shox Black/Black/Gym Red BQ9001-001",
    "rating": 4.4,
    "review_count": 532,
    "features": [
      "Rubber sole"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Knock offs!! Just DON'T DO IT ✅",
        "text": "[[VIDEOID:e270e5dd29b72c4c1bdeae3b2a3671e1]] They are dirty with red clay mud. Very very poorly made. For $185 I expect more quality. The material is not properly laid. I am a Nike Shox NZ fanatic. I have over 10 pair and clearly  these are knock offs. The Nike swish is smaller then my pinky finger nail. The shocks are not even so the shoe tilts. I will stick to buying in the store that way I know exactly what I am getting. Ohh let me add they charge you to return items. You have to drive to UPS to drop them off and they charge you a fee. I can not make this up the attached pictures do not lie. Do not buy from this seller. Don't do it!!!! Very disappointed 😞 RETURNING!!!!!",
        "verified": true,
        "helpful_votes": 18
      },
      {
        "rating": 5.0,
        "title": "recommended for painful Plantar Fasciitis",
        "text": "recommended for painful Plantar Fasciitis . I ordered these for that reason, and pretty much wear them all the time.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Nike shox",
        "text": "Love them",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Nike",
    "tags": [],
    "price": 312.23,
    "position": 13,
    "page": 2
  },
  {
    "id": "prod_running_shoes_172",
    "parent_asin": "B07L1NC91Z",
    "category": "Running Shoes",
    "title": "New Balance Women's Cruz V2 Fresh Foam Running Shoe",
    "description": "Fresh gets even fresher with the introduction of the fresh foam cruz V2 knit. Featuring a softer, lighter version of our award-winning fresh foam technology, it's comfort youve never felt before. A heathered knit upper is as stylish as it is technical and a suede saddle and deconstructed heel support you no matter where you take the shoe. Its performance with everyday style.\nNew Balance, is dedicated to helping athletes achieve their goals. It's been their mission for more than a century. It's why they don't spend money on celebrity endorsements. They spend it on research and development. It's why they don't design products to fit an image. They design them to fit. New Balance is driven to make the finest shoes for the same reason athletes lace them up: to achieve the very best.",
    "rating": 4.3,
    "review_count": 1697,
    "features": [
      "100% Synthetic",
      "Imported",
      "Rubber sole",
      "Fresh Foam midsole cushioning is engineered for precision comfort; built for running and designed for living"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great",
        "text": "👍🏻",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "So comfy!",
        "text": "Comfortable and good for wide feet!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great Quality & Comfortable",
        "text": "Very comfortable, light weight shoe. I’m an RN and I’m on my feet all day and these shoes have been great so far.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great fit!",
        "text": "Love these shoes!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Good for around town",
        "text": "I like these cause they’re quick on and off- maybe not good for sports but comfy and stylish",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "New Balance",
    "tags": [],
    "price": 74.0,
    "position": 14,
    "page": 2
  },
  {
    "id": "prod_running_shoes_185",
    "parent_asin": "B083GV5SWM",
    "category": "Running Shoes",
    "title": "ALTRA Men's AL0A4VQM Olympus 4 Trail Running Shoe",
    "description": "",
    "rating": 4.4,
    "review_count": 7,
    "features": [
      "Imported",
      "Vibram sole",
      "Go Further: Improved breathability and premium tongues for better comfort will have you locked in",
      "Get Comfortable: Signature Altra balanced cushioning and FootShape toe boxes allow your toes to spread and encourages proper, low-impact form throughout your run",
      "Stay Focused: Vibram Megagrip rubber outsoles provide secure traction on varied terrain",
      "Push Yourself: InnerFlex midsole technology ensures increased flexibility and performance",
      "Stay Comfortable: Stack height of 33mm provides ample cushion for long runs"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Very comfortable shoe.",
        "text": "The bottom of the shoe is thick.<br />But the overall weight of the shoe is not bad.<br />I feel like I have better contact than any other shoe I own.<br />I like the quality, money well spent.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 3.0,
        "title": "Runs much smaller/shorter than the Lone Peak 6, and much stiffer than expected",
        "text": "I own a pair of Lone Peak 6 size 11 which have a little toe allowance.  Same size 11 Olympus 4 literally had my toes scrunched along the front of the shoe!  May have to go one whole size up for proper fitting.  They also felt a LOT stiffer than the Lone Peaks, which surprised me given they are supposed to have maximum cushioning;  the Lone Peaks actually feel more cushy to me.  Returning the 11s and mulling over whether I should bother trying a 11.5 or a 12, considering how much stiffer they felt.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "HD user, Size 14 feet, torn knees 50+",
        "text": "I tear up any shoes in 3-4 months and these ones hold up the best (4+months ave.)…I’ve destroyed many pairs and won’t use anything else.  They are comfortable and allow me to continue working out with aches or injury (from hiking every day).<br />Size 14 ft<br />Wgt 250<br />Ex-Athlete with numerous knee and back injuries<br />Hike 6 miles per day and workout in the gym to maintain good fitness level.<br />Neuropathy in feet.<br />Compression fractures in back (old injury)<br /><br />These shoes are made for Clydesdale ex-athletes like myself…I‘be been using Altra for 4 years…",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "A good shoe",
        "text": "As this is my third pair of Altra Olympus shoes, I can say I am a happy customer. Each pair has lasted just over 1000 miles trekking over rough terrain. The Vibram is great but only holds out so long. Thank you Altra. Great customer service too. 😜",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "I'm waiting for the hiking day.",
        "text": "searched for these shoes after recommending them on Youtuber, but I bought them after thinking about it because I didn't like the color, but it's light and I'm waiting for the hiking day.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "ALTRA",
    "tags": [
      "Sponsored"
    ],
    "price": 129.95,
    "position": 15,
    "page": 2
  },
  {
    "id": "prod_running_shoes_147",
    "parent_asin": "B083QSKPBB",
    "category": "Running Shoes",
    "title": "STQ Women's Running Shoes Breathable Air Cushion Sneakers",
    "description": "",
    "rating": 4.1,
    "review_count": 15891,
    "features": [
      "Imported",
      "Rubber sole",
      "Air Cushioning-and-rubber sole : Lightweight, flexible response.",
      "Versatile running shoe for low mileage, neutral runners",
      "Removable sockliner improves comfort, remove to accommodate orthotics",
      "Women running shoes use mesh and synthetic upper materials offer a snug, sock-like fit. Knit tennis fabric, comfortable, breathable and lightweight.",
      "Perfect for run, walk, work, weight training, park, boating, cycling jogging, garden, lawn, equestrian, basketball, rowing, athletics, tennis, volleyball, football, driving and yoga. Casual daily shoes which can bring more enjoy to your life."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "durable and comfortable",
        "text": "OK, so I was not expecting these to be comfortable for my 12.5hr shifts, nor was I expecting them to be durable. Surprise!! They are both. I am a nurse, enough said about comfort. I got poop on them, washed them in my washing machine, expecting to remove tattered and torn, I found them clean and INTACT!!!!! The color is just as bright as the day I  bought them. My coworkers are spending $150 or more on HOKA and I got these cheeeeap!! I love them!!!! Plus, when it rains they don't squeak????? I was so surprised, I don't know what to say about that. The heel is see thru and there isn't even any water inside after washing them. Sized very accurate, if anything they were 1/2 inch longer than expected. I wear a 7.5 in womens U.S. and these are not tight AT ALL, if I had gotten an 8, which I normally do when buying online and especially foreign, I would have been in trouble. Get them! I am getting another color as soon as I finish typing.",
        "verified": true,
        "helpful_votes": 4
      },
      {
        "rating": 1.0,
        "title": "Very uncomfortable",
        "text": "Very uncomfortable wore it and couldn’t wait to get the shoes off.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Purple running shoes",
        "text": "It’s a little small",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Five stars!",
        "text": "I purchased these sneakers for myself and my daughter as extra throw on pairs for running around. I usually buy Nike sneakers as I find the brand never lets me down. These are super light and extremely comfortable. I got my daughter a purple pair and she has been wearing them for kick boxing. Excellent sneaker for the price!",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Perfect fit and comfortable",
        "text": "Love the shoes comfort and look.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "STQ",
    "tags": [],
    "price": 35.11,
    "position": 16,
    "page": 2
  },
  {
    "id": "prod_running_shoes_022",
    "parent_asin": "B00GBLYOIQ",
    "category": "Running Shoes",
    "title": "EZ-STIK 13.1 Half Marathon Decal Sticker 6\" 5k 10k Running Shoes runnerA010",
    "description": "There is no background color. The surface that you apply the sticker to will become your background color. This will be a single color sticker. This is a DIE-CUT vinyl decal meaning that the background has been trimmed off. If there is a background color in the picture, it is used only as a representation. The background color will be the surface color you place the sticker on (or clear if you put it on a window). The decal will come with clear transfer tape, so you can easily apply it to anything you like (walls, windows, cars, mailbox, mirrors, laptops, etc etc etc). I use PREMIUM Oracal brand vinyl for all decals. Application is relatively easy. Your decal will come as THREE pieces - the backing paper, the sticker itself, and the clear transfer tape. Make sure you are applying to a CLEAN surface. You carefully pull the clear transfer tape up from the backing paper, making sure that it pulls the sticker up with it (if it does not, then firmly press down on it with a squee-gee or credit card or something similar until it sticks properly to the clear transfer tape). Then you apply the sticker and clear transfer tape to whatever surface you would like the decal on. You then use a squee-gee or credit card or something similar to firmly press down once again, making sure that the sticker STICKS, and then you carefully and slowly remove the clear transfer tape from the top, leaving behind only the sticker. I have found that on some surfaces (especially walls and wood surfaces), it helps to leave the clear transfer tape on for awhile to make sure everything is sticking well before removing it. I do not issue refunds or exchanges on vinyl decals. Please understand this before you bid. Some decals are more difficult to apply than others (especially the little ones!) - likewise, some surfaces are more difficult to apply decals to.",
    "rating": 5.0,
    "review_count": 1,
    "features": [
      "Easy to Apply",
      "Instructions Included",
      "Free Practice Sticker",
      "7 year Premium Vinyl",
      "Quick Shipping"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "My daughter loved this-as it shows her big acomplishment",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "EZ-STIK",
    "tags": [],
    "price": 4.99,
    "position": 17,
    "page": 2
  },
  {
    "id": "prod_running_shoes_115",
    "parent_asin": "B07DCT4HTL",
    "category": "Running Shoes",
    "title": "adidas Originals Unisex-Child Swift Running Shoe",
    "description": "adidas authentic shoes",
    "rating": 4.7,
    "review_count": 4339,
    "features": [
      "100% Rubber",
      "Rubber sole",
      "Snug fit",
      "OrthoLite sockliner",
      "Lightweight shoes"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "Love it",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "I love them",
        "text": "They feel like you have nothing on I love it",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great baby shoe!",
        "text": "Great baby shoe!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great looking shoe",
        "text": "Bought it for my son.  He love it.  Fit true to size",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great shoes",
        "text": "Love these shoes for my toddler. They fit great, always look clean, and are easily washed. They do, however, tie and not velcro. They still look great after several months of everyday wear.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "adidas Originals",
    "tags": [],
    "price": 37.29,
    "position": 18,
    "page": 2
  },
  {
    "id": "prod_running_shoes_198",
    "parent_asin": "B00ZAU59QK",
    "category": "Running Shoes",
    "title": "ASICS Women's GT-2000 4 Running Shoes",
    "description": "The gt-2000 4 is the core runner’s bread and butter with its balance of cushioning and stability, outfitted by the comfortably supportive dynamic duomax and guidance trusstic system that also enhance gait efficiency. Our rear foot and forefoot gel cushioning systems are now even more adaptive, assisting mild to moderate over pronators alike with greater support, while the fluid ride midsole offers the ultimate ride.\nIn 1949, Mr. Kihachiro Onitsuka began his athletic footwear company (Onitsuka Co., Ltd.) by manufacturing basketball shoes out of his living room in Kobe, Japan. He chose the name ASICS for his company in 1977, based on a famous Latin phrase \"Anima Sana In Corpore Sano,\" which, when translated, expresses the ancient ideal of \"A Sound Mind in a Sound Body.\" Taking the acronym of this phrase, ASICS was founded on the belief that the best way to create a healthy and happy lifestyle is to promote total health and fitness. Today, ASICS offers a full line of performance-driven athletic shoes and technical active sports apparel and accessories dedicated to bringing harmony to the body and soul.",
    "rating": 4.3,
    "review_count": 1829,
    "features": [
      "100% Synthetic",
      "Imported",
      "Rubber sole",
      "Impact Guidance System (I.G.S): ASICS design philosophy that employs linked componentry to enhance the foot's natural gait from heel strike to toe-off.",
      "Dynamic duomax Support System: This evolution of duomax system enhances stability and support, with reduced weight and increased platform support.",
      "Rear foot and Forefoot GEL Cushioning Systems: Attenuates shock during impact and toe-off phases, and allows movement in multiple planes as the foot transitions through the gait cycle.",
      "Fluid ride: fluid ride provides the ultimate combination of bounce back and cushioning properties with reduced weight and exceptional durability.",
      "Guidance Truss tic System: This Truss tic System integrates Guidance Line construction for enhanced gait efficiency while providing midfoot structural integrity."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great shoe for an over-pronator like me",
        "text": "I've used the GT-2000 shoes over the last few years and have yet to have issue with them. I over-pronate pretty badly and this shoe offers great support for that issue; My knees thank me. I found the shoe to fit exactly true to size and for those reviews that say it's small, people tend to forget that your feet swell when you run, especially longer distances! My personal size foot is between a 6.5-7 and I typically wear a 7 shoe for running, dress, or sandals. I can't say I know the difference between the GT-2000 model numbers (1-5?) except for new-ness. I have no issue with wearing older models and like the cheaper prices. For reference, I run half marathons several times a year on city sidewalks, asphalt, dirt roads, and dirt trails.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "This was a gift. Didn't fit. So, ...",
        "text": "This was a gift. Didn't fit. So, hearsay- I am not sure of the exact fit. They are exchanging for a bigger size though.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Great shoe but runs small",
        "text": "Great shoe, very supportive in the arch and heel. I love the bright colors of the Asics shoes. The only thing I would be leary of is the size of the shoe. It runs small. I wear an 8 and because of other reviews, bought a 8-1/2. They fit but are still a little snug. After wearing for a bit, they will loosen up enough to be great. If you have a wider foot, you may not like these particular shoes.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Color in photo is not quite accurate",
        "text": "Have always loved my Asics GT-2000.  32 marathons and our relationship continues!  My only comment about this particular color combo is the photo appears to be grey and more coral color.  When they arrived what looks like a coral color in the photo is closer to fluorescent orange!  They are a bit &#34;loud&#34;.  If they had been full price I probably would not have chosen them because of this.  Too &#34;loud&#34; for my preferences.  However, given the clearance price I'll make do!  :)",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "... been a fan of Asics and this did not disappoint!",
        "text": "I've always been a fan of Asics and this did not disappoint!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "ASICS",
    "tags": [
      "Sponsored"
    ],
    "price": 105.57,
    "position": 19,
    "page": 2
  },
  {
    "id": "prod_running_shoes_165",
    "parent_asin": "B00Q2JC290",
    "category": "Running Shoes",
    "title": "ASICS Mens Gel-Venture 6 Running Shoe",
    "description": "The GEL-Venture 5 provides great fit and everyday comfort, with Rearfoot GEL Cushioning and a rugged outsole ideal for a variety of terrains.\nIn 1949, Mr. Kihachiro Onitsuka began his athletic footwear company (Onitsuka Co., Ltd.) by manufacturing basketball shoes out of his living room in Kobe, Japan. He chose the name ASICS for his company in 1977, based on a famous Latin phrase \"Anima Sana In Corpore Sano,\" which, when translated, expresses the ancient ideal of \"A Sound Mind in a Sound Body.\" Taking the acronym of this phrase, ASICS was founded on the belief that the best way to create a healthy and happy lifestyle is to promote total health and fitness. Today, ASICS offers a full line of performance-driven athletic shoes and technical active sports apparel and accessories dedicated to bringing harmony to the body and soul.",
    "rating": 4.6,
    "review_count": 24394,
    "features": [
      "Rubber sole",
      "Outdoor-ready runner with mesh and brushstroke-patterned underlays",
      "Rearfoot GEL cushioning",
      "Removable sockliner accommodates medical orthotics",
      "Trail-specific outsole with reversed traction lugs",
      "AHAR outsole rubber in critical high-wear areas"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Fit",
        "text": "Good shoe",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Comfort",
        "text": "Second time buying this style because my son loves how comfortable they are.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "These shoes are PERFECT for walking and hiking. Comfortable and roomy toe box.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Five Stars",
        "text": "Love these Asics, 4th pair,",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Ok shoe",
        "text": "Length is right but width is a bit tight. Should fit better after a while of wearing in. I wear a size 11 with medium width. Get 1 width bigger. Nice quality.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "ASICS",
    "tags": [],
    "price": 39.99,
    "position": 20,
    "page": 2
  },
  {
    "id": "prod_running_shoes_153",
    "parent_asin": "B07RGTWS22",
    "category": "Running Shoes",
    "title": "New Balance Men's 410 V6 Trail Running Shoe",
    "description": "Be off-road ready in the New Balance 410v6 men’s trail shoe. Featuring a durable AT Tread rubber outsole, this shoe is fit for any adventure. Made with a sleek upper, ACTEVA midsole technology and a cushioned NB Comfort Insert, the versatile men’s running shoe is designed to keep you comfortable and stylish before, during and after your hike.\nNew Balance, is dedicated to helping athletes achieve their goals. It's been their mission for more than a century. It's why they don't spend money on celebrity endorsements. They spend it on research and development. It's why they don't design products to fit an image. They design them to fit. New Balance is driven to make the finest shoes for the same reason athletes lace them up: to achieve the very best.",
    "rating": 4.5,
    "review_count": 7439,
    "features": [
      "50% Synthetic, 50% Mesh",
      "Imported",
      "Rubber sole",
      "ACTEVA midsole cushioning delivers versatile, flexible support",
      "AT Tread outsole provides versatile traction during both on and off-road activities",
      "Lightweight injection-molded EVA foam midsole provides lightweight cushioning",
      "NB Comfort Insert offers additional cushioning",
      "Synthetic/mesh upper"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Sizing",
        "text": "Too narrow",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 2.0,
        "title": "Cheap quality",
        "text": "These are wimpy tennis shoes.  They probably wont' make it a year.  I judge the quality by picking up the shoe and twisting in my hands.  I can easily warp these shoes.  I have some Merrills and I absolutely can't bend them up.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Not the best looking shoe but the most comfortable!",
        "text": "Man my feet hurt. And because I wear the same shoes everyday all day they break down pretty quickly.  These are perfect.  The color isn't my absolute favorite BUT that was the color that was on sale. Besides I'm nearly 50 so I'm not out to impress anyone lol.  They fit my feet perfectly and  there is no better feeling of new shoes when your old shoes broke down! Just enough support.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great Walking Shoe!",
        "text": "I got these for at home. I like wearing shoes inside. So they need to be clean. I got these, and they are comfy and see like they will last a long time. They should, if I only wear them in my house.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Good fit in a large size",
        "text": "I bought these shoes as a gift for my 25 year old son, who wears a size 16. I know from past experience that New Balance provides a good, consistent fit in their large sizes, and this pair did not disappoint. The fit was great and my son liked the color and style.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "New Balance",
    "tags": [],
    "price": 59.96,
    "position": 21,
    "page": 3
  },
  {
    "id": "prod_running_shoes_003",
    "parent_asin": "B08PKY9JB9",
    "category": "Running Shoes",
    "title": "adidas Climacool Vento",
    "description": "",
    "rating": 5.0,
    "review_count": 4,
    "features": [
      "Made in USA or Imported",
      "Rubber sole"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great shoe.",
        "text": "Nice!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "adidas",
    "tags": [],
    "price": 109.99,
    "position": 22,
    "page": 3
  },
  {
    "id": "prod_running_shoes_070",
    "parent_asin": "B08K7FZ59Q",
    "category": "Running Shoes",
    "title": "Soulsfeng Running Shoes Low-top Lace-up Breathable Gym Trainer Tennis Walking Athletic Shoes Fashion Sneakers for Men Women",
    "description": "",
    "rating": 4.5,
    "review_count": 195,
    "features": [
      "Rubber sole",
      "Flamingo Shoes,Use Environmental Friendly Material",
      "Freeknit Fabric Animal Printed Upper",
      "Design base on Flamingos from Bahamas",
      "Non-slip rubber sole",
      "PU midsole with good elasticity and toughness can ensure the flexible movement and cushioning effect"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Colors are poppin in true Graffiti fashion",
        "text": "I usually wear a size 8 but since moving wear the climate is hot all year round I fit a size 9 more comfortably. This is why I am happy to write that the size 9 fit perfectly and the graffiti design is poppin with the colors. I am very happy with this purcahse.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "x STYLISH AS ALL HELL x",
        "text": "I have them on display / They are exremely stylish for the price //  for cosplay / cyberpunk / future goth .. these shoes look great //",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Soulsfeng",
    "tags": [],
    "price": 39.0,
    "position": 23,
    "page": 3
  },
  {
    "id": "prod_running_shoes_027",
    "parent_asin": "B09P785LJT",
    "category": "Running Shoes",
    "title": "Nike womens Running Shoes",
    "description": "The Nike Odyssey React Flyknit 2 Women's Running Shoe delivers a strategic combination of lightweight Flyknit and synthetic material for support just where you need it. Underfoot, Nike React cushioning delivers a soft, springy ride for a route that begs to be crushed.",
    "rating": 3.9,
    "review_count": 14,
    "features": [
      "100 % Cotton",
      "Drawstring closure",
      "Machine Wash"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Too tight",
        "text": "Bought my sneaker size which is a size that's 1/2 too big and these were too tight. Poorly made.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Nike",
    "tags": [],
    "price": 102.0,
    "position": 24,
    "page": 3
  },
  {
    "id": "prod_running_shoes_036",
    "parent_asin": "B0C23Y82BV",
    "category": "Running Shoes",
    "title": "Yontune 2X Headlights for Crocs/Sneakers, LED Shoe Lights for Night Safety Running Shoe Lights for Night Runner Funny Gifts for Hiking Camping Walking The Dogs (Red)",
    "description": "",
    "rating": 4.1,
    "review_count": 77,
    "features": [
      "⛈️【High Quality & Weatherproof】Our runner shoe lights are made of aluminum alloy and ABS plastic, IPX5 Waterproof, these lights for shoes are built to withstand the toughest rainstorm. Rather it be snow or heavy rain, our gear got your cover.",
      "🔆【Lightweight & Bright】They are pretty lightweight (each light weights only 25g). It stays stable while you walk or run without you even notice. These shoe lights for night safety are bright which can increase your visibility to avoid tripping on things and seeing the path. Let you see and be seen safely in the dark from dusk till dawn.",
      "💡【Upgraded Hidden Switch】Press on the head of the shoe light to turn on/off and switch 3 different modes base on your need (Always Bright, Flashing, or Flashing slowly). It can retain power for 72 hours on its highest setting. An essential safety equipment for any low-light activity.",
      "✨【Easy to Install】Night runner shoe lights the bottom design allows you to fix the shoe light on your shoelace or straps firmly. Note: Please remove the insulating paper between the two batteries at first.",
      "🏃🏽【Application to All Outdoor Activities】Runners shoe lights for night safety, these lights for shoes are hands-free lighting solution for runners, hikers, or any outdoor enthusiast. You can safely trek through mountains, trails, or your own neighborhood knowing you’ve got reliable, safe lighting at all times. Whether running, cycling, walking, hiking, camping, fishing, or walking your dog."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Work great",
        "text": "I was excited to receive these. I also have a pair that stick in the hole on the shoes. I prefer these, however, because you can adjust where the beam is directed by moving the heel strap around. I use my crocs for taking care of the chickens. So this is great for the walk to the coop every night.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Good quality",
        "text": "Great little product gives good light and I can pop them on my tennis shoes for camping.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Fun little headlights for your shoes",
        "text": "I've had these lights on my shoes full time for the last few days, and I really like them for evening walks.  They don't replace a flashlight, but they do light up a fair amount of the path that I wouldn't otherwise see with my small flashlight.  I've smacked them against car doors and chair rails a few times, and they've stayed solidly on my feet and are no worse for wear.  They are great for visibility for others too - your feet move a lot, and so do these lights.  Add flashing and you're much more visible either walking or on a bicycle.  I think they'd also be great for camping, and maybe at a dance party (flashing feet might be fun!)  My only thought is that they seem a little pricey, but they are one of the few that go on shoe laces and not just popping into holes in Crocs.  They're quite sturdy and battery life is great too.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Perfect for early morning/night walking",
        "text": "I bought these lights for an upcoming hike to the Grand Canyon in October. We need to start our hike before sunrise and thought these would be the perfect accessory to stop us from tripping in the dark. What I like - they are small and lightweight, with a secure clip for my shoes. The battery is a standard size. They are easy to turn off and on. I'm undecided on if these are really bright enough to be practical... is there a light - yes. Is it going to replace a flashlight - absolutely not. I don't know if I'd buy these again for the purpose of a hike, but they would be good if you are an early morning/late evening walker and runner and want additional lights for safety so cars, etc, can see you.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "They are ok",
        "text": "Batteries are not working. I have to replace them right from the start. I hope they will work.<br /><br />They seem a bit heavy but I will use them. Safety is more important.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Yontune",
    "tags": [
      "Overall Pick"
    ],
    "price": 9.99,
    "position": 25,
    "page": 3
  }
]