[
  {
    "id": "prod_smartwatches_053",
    "parent_asin": "B07DGR2NMY",
    "category": "Smartwatches",
    "title": "Bossblue Compatible Fitbit Ionic Bands for Women Men Large Small,Soft Silicone Waterproof Breathable Replacement Accessories Sport Strap for Ionic Smartwatch. (Black/White, Large(6.7\"-8.4\"))",
    "description": "for fitbit ionic Bands for Women Men Large Small ,Soft Silicone Waterproof Breathable Replacement Accessories sport strap set pack for Fitbit ionic Smartwatch.Fitness Sport tracker Band\nCompatibility:\nFitbit ionic smartwatch  NOT fit other Fitbit watch\nProduct information:\nMaterial: High quality timeproof silicone Item weight: 0.7OZ Thickness: 2mm Small: 5.5-6.7 \"  Large: 6.7-8.4\"\nMulti-colors:\nTop designer design,The perfect combination of simplicity and fashion. Black/Gray, Black/Yellow, Black/Red, Anthracite/Black, Blue/White, Blue/Pink, Blue/Yellow Purple/Lavender, Red/Black, Fushia/pink, Orange/Gray, Pink/Teal, White/Pink, White/Black, Gray/White.\nUse occasion:\nThis BossBlue ionic band great for outdoor sports / business / parties / shopping, ect. Girls, boys, kids, teens, and adults alike. No age limited.\nPackage:\n1 x Silicone Band ( Not included the Fitbit ionic smart watch)",
    "rating": 4.2,
    "review_count": 832,
    "features": [
      "Only Perfect fit for Fitbit ionic Smartwatch. DO NOT fit other Fitbit watch bands. Easy to install and adjust the size according your wrist. For Small Size Wrist: 5.5-6.7 inch(140mm-170mm),For Large Size Wrist: 6.7-8.4 inch(170mm-215mm)",
      "Ventilation Holes Design makes it wear cool and dry after you sweat during the sports. More friendly to the skin and will not damage the skin when sliding. More comfortable and breathable.",
      "Our bands for Fitbit Ionic Smartwatch are made of superior quality silicone materials, skin-friendly, soft and breathable, light and graceful; you can wear it at all hours of the day or night comfortably. If you work outside or like doing sports.",
      "Multi-colors to choice:Black/Gray, Black/Yellow, Black/Red, Anthracite/Black, Blue/White, Blue/Pink, Blue Yellow, Purple/Lavender, Red/Black, Fushia/pink, Orange/Gray, Pink/Teal, White/Pink, White/Black, Gray/White. S/L Size choices for different occasion.",
      "If you have any questions, please contact us for the first time.We will respond within 12 hours"
    ],
    "reviews": [
      {
        "rating": 2.0,
        "title": "Nice feel. but easily broken",
        "text": "I ordered this very inexpensive band knowing the quality would not be the best. I was surprised how comfortable the band was and thought it was a nice upgrade over the base Ionic Bands. However after wearing it for a few weeks, when putting it back on after charging, the connection to the latch broke and its not repairable. Its a nice feeling material but this broke way to easily and after only a few weeks of use is rather disappointing.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Month and a half and broke already",
        "text": "Had it for about a month and a half broken already",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Fitbit band",
        "text": "Bought this for my dads Fitbit and it works great, very durable.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great Buy",
        "text": "Love the fit and security of this product. It’s strong, durable, and better than others I’ve had before. I will definitely use this seller and buy this product again in the future.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Junk is being nice",
        "text": "The worst ionic band so far. The mechanism that attaches the band to the watch broke within 1 month thankfully I can return to Amazon and don't have to deal with manufacturer.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "BossBlue",
    "tags": [
      "Sponsored"
    ],
    "price": 6.99,
    "position": 1,
    "page": 1
  },
  {
    "id": "prod_smartwatches_034",
    "parent_asin": "B09P8B1NQH",
    "category": "Smartwatches",
    "title": "Maledan Compatible with Fitbit Charge 5 Bands Women Men, Soft Silicone Breathable Sport Replacement Accessories Slim Strap for Fitbit Charge 5 Advanced Fitness Tracker, 3 Pack Black/Pink/WineRed",
    "description": "",
    "rating": 4.4,
    "review_count": 753,
    "features": [
      "【Compatible Models】Maledan 3 Pack Stylish Sport Bands Compatible with Fitbit Charge 5 Advanced Fitness & Health Tracker. (Note: Only for Fitbit Charge 5, NOT for Fitbit Charge 4/3/2/1, NO Tracker Included). One Size: Fits for 5.1\"-8.7\"wrists",
      "【Soft, Smooth & Waterproof】The Charge 5 bands are made of durable premium silicone, skin-friendly & comfortable touch feeling free your wrists. Sweatproof, lightweight & breathable strap design for Charge 5 tracker, it is perfect for daily time, workouts and overnight sleep",
      "【Unique Buckle & Slim Design】The buckle and strap are integrated design, with a silicone loop and peg closure. Unique sport Charge 5 band has greater flexibility and narrower width. More lightweight and NO MORE skin irritation. A great affordable option for your watch",
      "【More Security & Easy to Install】Maledan design for Fitbit Charge 5 bands has exquisite connector, locks onto watch interface precisely, securely and seamlessly, which avoid your watch from falling off. One hand assembly and one button removal. More convenient & secure to use",
      "【Must Buy Sport Bands for Fitbit Charge 5 Accessories】3 Pack different color Charge 5 slim band combinations, prefer fits your mood & outfit and easy change for every occasion. It's the best special gift for your lovers. We offer one year guarantee and 24/7 friendly support"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Perfect size!! Thin and durable.",
        "text": "These are perfectly sized between the two sizes you get from Fitbit. Plus they are way thinner and more feminine. They don't pop off the watch either. A+",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "*****",
        "text": "These bands are perfect. They fit the Fitbit Charge 5 perfect. The slim style is a good  fit for my small wrist.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Better slim band, does not fall off!",
        "text": "Nice improvement over the wider band that came with the fitbit, it does not irritate my wrist as much as the original one. Like having the 3 diff colors, and best of all they do NOT fall off like a leather one I tried.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Comfort",
        "text": "Like the comet of the watch band.<br />I have a small wrist and the way it folds the excess band  in underneath the band is great.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "I love the slender style!",
        "text": "This fits as if fitbit had a Medium band. If you need a large, it may be snug. But it's perfect for me. I love the slim band! It makes the watch so much less bulky. And the fitbit clicks right into the clasps and feels secure. I'm getting more colors for sure.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Maledan",
    "tags": [],
    "price": 11.99,
    "position": 2,
    "page": 1
  },
  {
    "id": "prod_smartwatches_152",
    "parent_asin": "B0BVZHFST7",
    "category": "Smartwatches",
    "title": "mingwear Smart Watch for Women Bluetooth Call (Answer/Make Call), 1.83\" Full Touch Screen Smartwatch Fitness Watches with Heart Rate Sleep Monitor,Sports Modes,Activity Tracker for Android iOS(Pink)",
    "description": "",
    "rating": 4.0,
    "review_count": 31,
    "features": [
      "🌈【1.83\"Touch Screen Smartwatch& Personal Custom Watch Dial】Smart watch has a 1.83\" Large touch screen, and 240*280 pixels resolution make the screen clear and bright, easy to see all the information whether indoor or outdoor. Smart watches For men women contains 5 dials readily available to choose from along with another 80+ more dials within the app. And you can custom your smartwatches dial according to scenes to show your personality and fashion.",
      "🌈【Bluetooth Call and Smart Notification】Bluetooth smartwatch is equipped with the latest bluetooth low-power chip, and the connection stability has been greatly improved. Bluetooth smart watches have a built-in microphone and speaker, so you can easily answer and make calls and receive notifications from your phone and apps by simply connecting to your phone once via bluetooth. Tap bluetooth fitness watch's voice wake function to play music while you're exercising, working out.",
      "🌈【Multi-Sport Modes and IP67 Wateproof】Fitness watch supports 11 sport modes,fitness tracker watch accurately records all-day activities (steps, distance, calories and active minutes), motivating you to reach your exercise goal with real-time statistics on the fitness smartwatch. IP67 waterproof smartwatch，you can wear it when washing hands or running in the rain with it.You don't have to worry about short trips away from home, sports smartwatch can support 3-5 days of use.",
      "🌈【All-Round Manage Your Health】: The smartwatch health tracker can detect your 24/7 heart rate, blood pressure and blood oxygen to get a better understanding of your health (Not for medical use). The high-performance motion sensor monitors sleep status automatically and provides comprehensive sleep quality analysis (deep sleep, light sleep and awake).And a breathing function,you can keep a good mind with the health smartwatch to go for a healthier body.",
      "🌈【Wider Compatibility and Multifunction】The outdoor smartwatch is compatible with most iOS 8.2 & Android 5.1 or higher smart phones version. Fitness activity tracker watch includes more convenient life features,such as split screen function,music & camera control, 5 levels of brightness adjustment, bright screen time,weather display, sedentary & drink water reminder, flashlight, calendar, stopwatch, calculator, Alarm Clock, Do Not Disturb/Power-saving Mode, Find watch."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Seems nice",
        "text": "Seems like a nice watch.  It has a standard user interface for a smart watch.<br /><br />I like the design and think it’s nice.  Seems to have the basic functionality you’d expect for a smart watch and using it for workouts<br /><br />I like the design and think that it seems nice",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Works well for step counting and can measure heartrate upon request. Otherwise less than stellar",
        "text": "This generally works well enough for exercise purposes. I didn't get the \"dangerous app warning\" on my iPhone, though I did get a warning that if I use the watch to display messages, then the app has access to all my contacts and the text of all my messages. I doubt I'm a target for Chinese spying so I chose to ignore that, but it's still worth noting.<br /><br />I love that it's waterproof, other watch faces are available (though I couldn't figure out how to restore the original, more-helpful one without doing a full factory reset), it tracks steps and sleep, plus it's able to measure heartrate and blood pressure. Mine sometimes tells me the weather, but only immediately after connecting to my Google account on my phone; otherwise it just says \"unknown\" (and honestly, if I have to click extra buttons on my phone, I can just check the weather there). It has a music playback control, but I couldn't get that to work. It also theoretically connects to my phone and lets me enter a phone number, but I couldn't click \"dial\" so that bit felt more like a child's toy, where you pretend to call a phone but don't actually do it. But since I use this for exercise more than connectivity, I'm OK with that.<br /><br />Some things are less than stellar, like their heart rate screen always shows a default chart (I don't think it ever lets you create your own heart rate chart)... and it shows a heartrate from 120-150 ALWAYS, which catches me off guard when I've been sitting at my desk for 2 hours. But I learned it's just a concept; there is no real *graph of my heartrate that I can find, just current / min / max that I can see from my phone. Or I can click \"measure\" to get my instant heartrate on my phone (good while exercising). Blood pressure can sometimes be measured from your phone (though it takes 1-4 minutes for some reason), and sometimes that screen disappears completely; I haven't yet figured out the pattern<br /><br />It doesn't seem to measure many things other than steps automatically; you have to select each one when you're wanting to see it. Soooooooo all told it's solidly mediocre. It's good for counting steps, manually checking heartrate, and manually checking blood pressure (very slowly) on occasion; otherwise it's a lot weaker than most smart phones",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "mingwear",
    "tags": [
      "Sponsored"
    ],
    "price": 19.99,
    "position": 3,
    "page": 1
  },
  {
    "id": "prod_smartwatches_160",
    "parent_asin": "B0B74MZMMQ",
    "category": "Smartwatches",
    "title": "Military Smart Watch for Men (Answer/Dial Calls), 2023 Newest Bluetooth Tactical SmartWatch for Android and iPhone, 5ATM Waterproof Outdoor Fitness Tracker with Heart Rate/SpO2/Sleep/AI Voice, Black",
    "description": "",
    "rating": 4.0,
    "review_count": 876,
    "features": [
      "FOLLOW YOU OUTDOOR EXPLORE - The tactical outdoor smart watch with a Micro-blasted metal frame and titanium body, and the smartwatch has passed 15 military standard tests, with cold/heat temperature ictus function, and enhanced 5ATM water resistance supports 20 meters underwater. An extra camouflage band is presented exclusively for the explorer.",
      "HAND UP TO COMMUNICATE - The military smart watch has a built-in Hi-Fi speaker and ribbon microphone. It supports Bluetooth to make, and receive calls, play music, and voice assistant, freeing your hands from your phone. Turn on the \"Phone\" mode of the watch and connect to the Bluetooth named \"Audio_HM09\" (call) in the phone settings. It makes communication freer.",
      "YOUR HEALTH IS ALWAYS IN YOUR EYES - Men's smart watch is equipped with the 2022 latest high-precision optical sensors. It can efficiently monitor heart rate, blood oxygen. A rugged smart watch makes also monitors sleep and provides sleep trends for the last seven days, analyzes your health status in real-time, and helps you adjust to a healthy lifestyle.",
      "PERSONAL EXERCISE ASSISTANT - The smart watches for iPhone have 8 indoor and outdoor sports modes, tailored for you who love sports. Data can be monitored in real-time during exercise. Just lift your wrist to view various data, such as steps, distance, calories, etc., It makes helps you achieve your fitness goals. It is the best choice for summer/travel/festival.",
      "COMPREHENSIVE TECHNICAL SUPPORT - Compatible with Android 5.0/iOS 10.0 or higher and Bluetooth 5.0 or higher. Ultra-low power consumption, 1.5 hours of full charge support used for 45 days of standby, 20 days of typical use, or ten days of heavy use. Android smart watch also provides various functions such as weather forecast, alarm clock, games, timer, and more. It is the best gift for a man/him/dad/friend.",
      "24/7 AFTER-SALES SUPPORT - When you connect the watch for the first time, please follow the mobile phone prompts to turn on all the permissions required for the smart watch. If you encounter any problems during the purchase process, please feel free to contact us through Amazon. Our team of engineers is at your service in real-time!",
      "FRIENDLY REMINDER - When you get the smart watch, please charge it as soon as possible to activate the smartwatch, and it can be used normally when the watch is fully charged.(note: for sports use only)"
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "A little issue with it",
        "text": "(2) problems with it<br />1.- evertime is underwater or in the shower unlock on its own and features move around<br />2.- as I use Google maps to look for an address and start the trip the watch vibrate like crazy none stop draining the battery since sometimes I drive an hour away , only solution I found so far is to disconnect it from my phone , beside that is a good watch ,",
        "verified": true,
        "helpful_votes": 12
      },
      {
        "rating": 5.0,
        "title": "Nice looking watch",
        "text": "[[VIDEOID:b4de8e874f377ccd97bd630c275f3fb7]] Nice looking watch I thought.  Has a cooler tactical style look than an Apple Watch in my onion.<br /><br />Overall it seems nice. Good functionality that would help on a daily basis I thought.<br /><br />Band is nice with the camo style look to it.",
        "verified": true,
        "helpful_votes": 5
      },
      {
        "rating": 5.0,
        "title": "Functions as advertised",
        "text": "Some of the functions I don't have the need to use, but those that I do use perform perfectly.  The extra watch band was a plus.  Well worth the price.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "Good for the price.",
        "text": "Got this cause I don’t want to spend the money for a Apple Watch. And I’m really hard on watches and phones. All said and done it works fine. Battery life isn’t as described. About 2 days. Fits nice. Does the job.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Didn't last long",
        "text": "Stopped working about 45 days after purchasing",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Moowhsh",
    "tags": [],
    "price": 59.99,
    "position": 4,
    "page": 1
  },
  {
    "id": "prod_smartwatches_121",
    "parent_asin": "B075XRMPM4",
    "category": "Smartwatches",
    "title": "SAMSUNG GEAR S3 FRONTIER Smartwatch 46MM (Bluetooth Only) - Dark Grey (Renewed)",
    "description": "Stay in touch, without reaching for your phone, with the smartwatch that’s engineered for adventure. Convenience being the key feature, the watch offers fitness tracking, app access and watch face customization. With the Gear S3, you can pay right from your wrist and track your location as well. The Gear S3 is compatible with both Android and iOS smartphones.\nNever Miss a Moment\nThe Gear S3 is Bluetooth connected so you can receive texts, emails, and alerts without reaching for your phone. With a built-in speaker and microphone, you can also make and answer calls hands-free. Just rotate the distinctive steel bezel to easily access apps and notifications so you can instantly check texts, updates, and more.\nPay with Your Watch\nWith Samsung Pay on your Gear S3, you can easily make payments with your watch almost anywhere you can swipe or tap a credit card - even without your phone or wallet.\nGet Out There\nWhether you’re off-roading or exploring a new city, the built-in GPS tracks your activity and makes it easy to share your location.\nDesigned for The Elements\nThe military-grade Gear S3 is tough enough to handle the elements. It resists water, dust, extreme temperatures, and the occasional drop so you can venture out with confidence.\nGo for Days\nGo nonstop for days on a single charge.4 When it’s time to recharge, the wireless charger lets you power up without slowing down.\nTailored to You\nMake the Gear S3 your own. Customize your watch face, choosing from thousands of striking colors and designs. Plus easily swap out the standard 22mm band.",
    "rating": 4.2,
    "review_count": 3905,
    "features": [
      "The Samsung Gear S3 has an always-on watch face and distinctive steel bezel that you can rotate to access apps and notifications.",
      "The Samsung Gear S3 has an always-on watch face and distinctive steel bezel that you can rotate to access apps and notifications.",
      "Text, call and get notifications directly from your watch through your Bluetooth connected smartwatch.",
      "Access the apps you use every day on your Gear S3. Catch a ride, check scores, stream music, and more.",
      "With the built-in S Health app, track your steps, monitor your heart rate, and more."
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Just over 90 days and it completely died",
        "text": "Rrally liked this watch at first. The battery did not last very long, even after adjusting settings. Thought it was the battery so we bought a new one, nope just completely died now. The new battery is fine, charges up and works, but the watch will not even turn on with new battery in it.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Love this",
        "text": "Love this watch",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Husband LOVES This",
        "text": "I bought this for my husband for his birthday and Father's Day and he loves it. He used to have a Galaxy S9, but dropped it into a lake while we were fishing *face palm*. But he ended up getting an old S7 from a family member and the watch connects with that as well. The only complaint I have heard from him is about the band, which was easy and cheap to replace with a metal material that didn't stick to his wrist as much as the rubbery band that comes with the watch.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great looking watch!",
        "text": "I bought this for my husband and he loves it!  He answers his phone and text messages right on the watch.  He doesn't have an excuse not to answer me now :D",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Good watch",
        "text": "I bought this when it first came out, I needed it's walking and stair climbing metrics.<br /><br />It's big, heavy, and if you're at all active, it's on the charge cradle for around 1 hour. The big, heavy part, some like it, I wish it were a little smaller.  The battery life, it's an early version, I didn't expect much, my next watch, 20 day minimum.<br /><br />All in all, it's a very functional watch, feature laden, and good, as long as Samsung supports the OS",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Amazon Renewed",
    "tags": [
      "Sponsored"
    ],
    "price": 94.99,
    "position": 5,
    "page": 1
  },
  {
    "id": "prod_smartwatches_078",
    "parent_asin": "B0B38CSBHJ",
    "category": "Smartwatches",
    "title": "Neitooh 4 Packs Bands Compatible with Fitbit Versa/Versa 2/Fitbit Versa Lite for Women and Men, Classic Soft Silicone Sport Strap Replacement Wristband for Fitbit Versa Smart Watch",
    "description": "Neitooh Fitbit Versa Bands, Soft TPU Rubber Replacement Wristband for Women Men\nFeatures:\nCrafted from Premium durable TPU material. Very lightweight, flexible, easy cleanness, no fading. Soft and comfortable to wear.\nTwo Sizes Available for Fitbit Versa bands for women men：\nSmall size fits 5.5\"-7.8\" wrists; Large size fits 7.3\"-9.2\" wrists. Fitbit Versa Bands can be freely adjusted according to the circumstance of individual wrist.\nCompatible Devices:\nFitbit Versa/Versa 2/Versa Lite Edition/Versa SE (Tracker is NOT included)\nWide Use:\nGreat for outdoor sports / business / parties / shopping /gifts ect. Women ,Men Girls, boys, kids, teens, and adults alike. No age limited, just limited for your wrist! Stay Stylish.\nEasy to install:\nCustom-Built quick release pins allow you to do fast, convenient regulation of Remove off / on. Longer life and more sturdy use for daily replace various colors bands.\nHow to install it:\n1.Insert the pin into the indent.2.Press the pin to slide the top part into the corresponding indent.3.Check to see if it was attached to the watch.4.If not, try it again then push the pin into the indent\nPackage Content:\n4 x Packs Soft TPU Replacement wristband for Fitbit Versa/Versa 2/Fitbit Versa Lite Smartwatch2 x Durable Spring pins\nHow to message us：\nPls Log in your Amazon account > Choose \"Your orders\" > Find the order ID > Click \"Contact seller\"",
    "rating": 4.6,
    "review_count": 16034,
    "features": [
      "Buckle closure",
      "【Replacement Band for Fitbit Versa】 Neitooh Fitbit Versa/Versa 2/Fitbit Versa Lite sports wristband is made of environmentally, skin-friendly and high quality TPE material, its food grade silicone and resistant to abrasion, high temperature, no smell, waterproof, no cracking, no irritating the skin, brings a comfortable wearing experience when you exercise or leisure moments. Please note that our bands are NOT FOR Fitbit Versa 3 / Fitbit Sense.",
      "【Multi-color Choices, Two Sizes Available】 Available in multiple colors and two sizes are available for Fitbit Versa/Versa 2/Fitbit Versa Lite women men, freely adjustable stainless steel buckle holds Versa sturdily. You can choose according to dressing, daily mood, daily activities, fit for many scenes, even all kinds of intense sports, highlight your personal style. Each color is seemed like a brand new watch. Small size fits 5.5\"-7.8\" wrists; Large size fits 7.3\"-9.2\" wrists.",
      "【Perfect Design for Fitbit Versa】 Upgraded and improved-built quick release pins allow you to do fast, convenient regulation of remove off/on, The stitches on both ends of the band are designed with the seamless joint technology. It can accurately and quickly lock the Fitbit Versa tracker without any tool to install and release. And, the robust design can ensure the bands securely attached without worrying about falling out.There are additional 2 watch lugs in every package.",
      "【Ideal for Sports & Leisure】 Classic regular design for Fitbit Versa and Versa Lite and Special Edition. The wear-resistant, ventilated design allows the wrist to remain cool and dry and sweat-proof during exercise. Lightweight, it seem like nothing in your hands, help you feel comfortable in sports or leisure time. Neitooh Fitbit Versa bands personalize your Fitbit Versa to match your daily style in different occasions, which can create a high-fashion image and make you stand out of the crowd.",
      "【Premium Waterproof Material 】Neitooh Fitbit Versa replacement bands are made of flexible elastomer, sweat-proof & waterproof, comfortable to wear. When they are dirty, you can use an old toothbrush with a little bit of laundry detergent and lightly brush your band, then rinse it off, pat dry with paper towel or napkin and leave it to air dry overnight."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "The Ban fits perfectly.",
        "text": "The Watch Bands fits my wrist perfectly.  The Watch Bands are size small.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 4.0,
        "title": "Good to Have!",
        "text": "Exactly as described. They’ve come in handy.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great product",
        "text": "I love the variety! And they are durable and comfortable!!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great quality bands",
        "text": "I've purchased multiples of these before cause I love having choices for colors when I want a change. These are comfortable, and durable and I love how they don't stain at all ! Great Great purchase",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Exactly what I wanted. Original, for my versa 2",
        "text": "Different colors for my versa 2.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Neitooh",
    "tags": [],
    "price": 6.39,
    "position": 6,
    "page": 1
  },
  {
    "id": "prod_smartwatches_175",
    "parent_asin": "B0BD86VPNQ",
    "category": "Smartwatches",
    "title": "Fitness Tracker with Heart Rate Monitor, Smart Watch for Men Women, with 1.81\" Large Screen, Support Call Dial/Receive, IP65 Waterproof Fitness Watch Sleep Monitor Activity Tracker for iOS Android",
    "description": "2022 New Smart Watch for Men Women, with Large Screen (1.81\"), Supports Call Dial / Receive, Heart Rate Monitor and Sleep Tracker, Waterproof Fitness Watch (IP65) Compatible with iOS 9.0 and Android 5.0\nWhy choose us?\n👉1.81\" Large Screen, Clearer and easier to use.\n👉100+ Watch Faces, DIY Your own dial style.\n👉Silicone strap, won't hurt your skin.\n👉A variety of watch colors for your choice.\n👉19 useful functions, you can also make and receive phone calls.\nHow to use it?\n1.Search the \"M2\" app on the App Store or scan the \"M2\" QR code on the instruction booklet or in the watch, for downloading.\n2.Refer the seller's video: how to connect the watch to the phone in action and a demonstration of important features.\n★Five-star after-sales:\nWe are committed to making every family member have a good smart watch experience, If you are not satisfied with the Smart Watch you purchased, feel free to contact us, the professional team is happy to serve you!\nPackage Included:\n1pcs x smart watch dial\n1pcs x silicone watch band\n2pcs x magnetic charging cable\n1pcs x a User manual\nSpecification:\nColor: black, gold, grey\nSmartwatch size: 25.5*4*1cm/10.04*1.57*0.39inches.",
    "rating": 2.3,
    "review_count": 6,
    "features": [
      "✅【1.81\" LARGE SCREEN & 100+ WATCH FACES】Released in 2022, smart watch for android iOS phones has a large screen （1.81\") with 320*385 resolution, which makes the fitness watch stylish and easy to read even under the sun. And the screen lightness is adjustable. And there are four different interface styles （most recommend the gear-shaped one,friendly to fat fingers) and 100+ watch dials without extra charges in the app available for you to choose",
      "✅【AN INDISPENSABLE HEALTH TRACKER】Fitness watch tracks your heart rate in real time (very accurate after multiple trials), records daily steps, calories burned, distance traveled and most importantly your sleep data. It also reminds you to stand up and have a walk after your sit for too long and when it's time to get some water. All this can help you lead a healthier life",
      "✅【BLUETOOTH CONNECTIVITY AND COMPATIBILITY】When the sport watch is connected to the M2 app via Bluetooth, you can control the music player, check weather forecast, control your camera remotely and most importantly receive and make calls. As for compatibility, this smartwatch can work seamlessly with iOS 9.0, Android 5.0 and other higher Bluetooth smartphones. To make it simple to you, if your phone was bought in and after 2016. It can work with our watch in most cases",
      "✅【LONG-LASTING BATTERY AND WATERPROOF】With a large battery(250mAh), the smart watch which is also designed to be durable and long-lasting, can be used for a week or more without charging and it only takes less than 2 hours to get it fully charged with that magnetic fast charger（included）. As for it's waterproof level, it's IP65, which means you don't need to take it off while washing your hands or showering",
      "✅【MULTI-FUNCTIONAL】Fitness Tracker watch is equipped with many other practical functions like alarm, stopwatch, breath training, little games and time format changing. And it can display in 22 different languages. One more user-friendly and thoughful design is its notification settings: silent, vibrate, normal"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Impressive watch with features",
        "text": "Watch has many features for fitness and heath I bought 2. Some of the screens are well thought out. Accuracy is a key benefit of this watch. Needed to use newer version of app and works with my android phone. Current version is metric and new version is to have imperial values. Vendor was responsive and resolved questions ASAP. Plan to buy new version with upgrades when available",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "lastima el software del celular",
        "text": "Este reloj tiene varias cosas interesantes, pero lastimosamente el software del celular que lo controla tiene muchas fallas, por ejemplo cuando uno agrega una lista de contactos favoritos al reloj, esporadicamente desaparece y hay que volver a  crearla. Tambien es frecuente que se desconecta el programa y el reloj, por lo que se dejan de recibir notificaciones en el reloj.<br /><br />Tambien hay problemas con la personalizacion del skin, donde uno selecciona una foto de fondo, la descarga al reloj y aveces despues de unos minutos u horas desaparece y toca volver a hacer el proceso.<br /><br />Tambien la aplicacion del celular esta mal diseñada, algunos botones no se ven bien y es dificil encontrar como seguir cuando se quiere configurar el reloj.<br /><br />Lo bueno del reloj:<br />- permite recibir y hacer llamadas desde el reloj ya que trae microfono y un pequeño parlante, pero hay que aclarar que necesita al celular cerca y conectado por bluetooth.<br />- Reporta bien la mayoria de notificaciones que recive el celular, como llegada de SMS, emails, mensajes de whatsapp, aunque no muestra emojins.<br /><br />-La bateria carga en 90minutos completamente y puede durar 3 dias sin tener que recargar.<br /><br />En resumen hasta que el fabricante no mejore los problemas de software no es una buena compra este reloj.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "ZEQUK",
    "tags": [],
    "price": 25.99,
    "position": 7,
    "page": 1
  },
  {
    "id": "prod_smartwatches_033",
    "parent_asin": "B0BGPQ23Y6",
    "category": "Smartwatches",
    "title": "Sunnyson 3 Pack Stretchy Nylon Watch Bands Compatible with Fitbit Versa 3/ Fitbit Sense,Soft Adjustable Bands Elastic Replacement Wristband for Fitbit Versa 3/ Fitbit Sense Smart Watch for Women Men",
    "description": "Sunnyson 3 Pack Watch Bands Compatible with Fitbit Sense and Versa 3, Bands Adjustable Braided Sport Elastic Straps Women Men Wristbands\nCompatible Models: Sunnyson 3 Pack bands perfectly fit with Fitbit Sense and Fitbit Versa 3.\nMeterial: The band made of breathable stretchy nylon, very comfortable and light to wear and easy to wash, It feels soft touch and will not harm your skin.\nDesign: The elastic wristband is designed with adjustable buckles, one size design gives a super stretchy elastic for all wrist size. without worrying about falling off.\nMult-color to Choose: There are many kinds of versa 3 bands and Fitbit Sense bands for women men. You can match fitbit versa 3 bands according to your dress up, mood etc.Create your own unique style.\nOccasion：Sunnyson Fitbit Sense bands and Fitbit Versa 3 bands are perfect for women men boys and girls to run, swim, ride, workout, parties, climb, hike, camp, travel and more outdoor activities.Classic Pretty colors dress up your watch for many occasions.Also a perfect gift choice.",
    "rating": 4.4,
    "review_count": 95,
    "features": [
      "Compatible Models: Sunnyson 3 Pack bands perfectly fit with Fitbit Sense and Fitbit Versa 3, easy to install and remove,no tool required, securely steady.",
      "Material: The band made of breathable stretchy nylon, very comfortable and light to wear and easy to wash, It feels soft touch and will not harm your skin.",
      "Design: The elastic wristband is designed with adjustable buckles, one size design gives a super stretchy elastic for all wrist size. without worrying about falling off.",
      "Multi-color to Choose: There are many kinds of versa 3 bands & Fitbit Sense bands for women men. You can match fitbit versa 3 bands according to your dress up, mood etc.Create your own unique style.",
      "Occasion：Sunnyson Fitbit Sense bands and Fitbit Versa 3 bands are perfect for women men boys and girls to run, swim, ride, workout, parties, climb, hike, camp, travel and more outdoor activities.Classic Pretty colors dress up your watch for many occasions.Also a perfect gift choice."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Good Enough",
        "text": "These are a perfect fit for my samsung fit2 watch & it's great to be able to swap out the color bands to match my clothes.  They're definitely not the same quality as the original band that came w/my watch but they work just fine.  The long charging cord is perfect!!!  No idea why they come with a stupid 4 inch charging cord so your watch has to hang from the wall by the cord - dumbest idea ever by the manufacturer.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Sunnyson",
    "tags": [],
    "price": 10.99,
    "position": 8,
    "page": 1
  },
  {
    "id": "prod_smartwatches_038",
    "parent_asin": "B0C3WF3W29",
    "category": "Smartwatches",
    "title": "AMAZTIM Smart Watch, 60 Days Extra-Long Battery, 50M Waterproof, Rugged Military Bluetooth Call(Answer/Dial Calls) Fitness Tracker, 1.85\" Ultra Large HD Display, AI Voice Assistant 24H Sleep Monitor",
    "description": "",
    "rating": 4.1,
    "review_count": 1940,
    "features": [
      "⌚Military-Standard quality - AMAZTIM M2 features 1.85-inch second generation Corning Gorilla screen. As the first 9H twin glass cover, it's strong enough to deal with a range of screen-destroying behaviors. The TC4 titanium unibody and the exclusive developed two-color silicone rubber is the world's first two-color integration in a smart watch; military-grade materials and fully enclosed design makes it the toughest and sturdiest watch. Successfully passed 12 Military Tests Including, extreme temperature,dust resistance, salt spray, fluid pollution,etc. Certified to MIL-STD810H , Our smart watches for men ensures that you use them confidently in a variety of harsh conditions.",
      "⌚50M Waterproof /Extremely resistant to damage - Incredibly strong and corrosion-resistant titanium case has been used to enclose and giving cover, the rugged military grade smart watch with fully enclosed ultra-thin case design can be easily submerged into 50M (IP69K waterproof) deep water. Our durable smartwatch has withstood the extreme conditions and passed drilling, crushing and hot steam washout tests, making our sports watch suitable to use under high temperature and pressure.",
      "⌚IndustryLeading dual smart chip - ① AI Voice Assistant & Make Calls: A very handy tool built in the watch. Use your voice to give instructions and the voice assistant will do the rest. You can ask questions, play your desired music, and check weather, set alarms and timers. You can also make voice calls through the voice assistant, makes the scenes that are inconvenient to hold a mobile phone in daily exercise and life more concise and smart. ② Intelligent sports recognition: features BioTracker PPG optical sensor and the advanced AI algorithm,M2 enables smart recognition of 6 sports. The system can automatically sense current sports status without entering Sports Modes manually.",
      "⌚60+ Days super battery life - M2 is equipped with a 100% pure cobalt battery (military grade), the battery capacity is as high as 380mAh ensuring optimal performance and longevity which is twice as much as that of conventional smart watches. At the same time, super power-saving AI algorithm breaking the industry is adopted to minimize power consumption, enough to last up to 2 weeks under normal use, and can continue to use sports mode, health index measurement and other functions for up to 60+ days in power-saving mode. With 30-minute charge, you can have enough battery backup to last for up to 3 days.",
      "⌚24H Health monitoring /70 Exercise modes - AMAZTIM M2 collects the health data with its advanced real-time monitoring function. The fitness watch helps you monitor All-day sleep, 24-hour heart rate, and real-time blood pressure and blood oxygen. The fitness tracking watch includes a pedometer to keep track of the calories burned throughout the day. Supports up to 70 sports modes including indoor and outdoor exercises such as hiking, skiing, swimming, etc. The smartwatches collects the data with pinpoint precision and accuracy, ensuring that every workout is counted."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Easy to set up, very accurate, keeps me updated with many aspect of my health",
        "text": "I really appreciate this watch and the features it has. First off, the smart watch was very easy to pair to my phone. I have an Android phone, and it only took a few minutes to pair the watch with my phone.<br />First enable Bluetooth and find the device listed as \"C20\"<br /><br />Next, download the app that's shown in the QR code. Once you have the watch paired via Bluetooth to your smart phone and the app is downloaded, your watch ready to go, and should be syncing to your smart phone. The connection has been great thus far; it hasn't disconnected/lost connection to my phone.<br /><br />As someone who has suffers from pulmonary lung disease, I was very excited when I found out this smart watch has the capability to track my oxygen saturation, heart rate, and blood pressure. In addition, you don't have to do anything, the watch will automatically to measurements periodically throughout the day.<br /><br />It's helping me monitor and compare results over a few days. I suggest authorizing Google Fit so your hearth history is accessible when it. For me, it helps to have a history when I meet with my pulmonologist.<br /><br />The watch has great standby battery life, and it's light weight. After m three days  it's only dipped minimally in available battery percentage. I highly recommend this!<br /><br />**Updated**<br /><br />So it's been several days now since I first posted the review and I am amazed how little the battery has drained. Needless to say this smartwatch has fantastic standby battery life; especially considering it's constantly looking for/measuring heart rate. As you can see from the photos the readings are very accurate. I own a pulse oximeter and a blood pressure monitor to keep my pulmonary hypertension in check. My resting heart rate is 95 bpm, which may seem high, but the reading is accurate and normal which makes this product more the reassuring.",
        "verified": true,
        "helpful_votes": 28
      },
      {
        "rating": 5.0,
        "title": "Great Watch!",
        "text": "Ok, I have had fitness watches from Samsung to Fitbit to Garmin and this one is the best....especially for the price.  First thing since turning 60 I need a watch I can read in the sunlight.  This has a brightness level I actually do not have to turn it all the way up and the workout data is big enough to read. I think all the health data is correct, but do not trust the Blood Pressure readings because of the science behind it. Actually do not trust any BP on a fitness watch.  There is a lot of customization you can do......I recommend a custom watch face along with setting up quick view on a schedule. I am now going to see if I can get a spare charging cord,",
        "verified": true,
        "helpful_votes": 11
      },
      {
        "rating": 1.0,
        "title": "Cheap, Inaccurate, but Cheap",
        "text": "What works, the clock.<br />What doesn't work, everything else.<br />Bought in August, really tried to give it a chance. I knew for the price it was a gamble.",
        "verified": true,
        "helpful_votes": 3
      },
      {
        "rating": 4.0,
        "title": "Step count",
        "text": "Like the look, heft, easy set up.<br /><br />But I question the accuracy since driving 1 miles and it's counted 30 steps, this is AFTER it logged 82 steps during at my desk.<br /><br />3 month update.  Battery life is still excellent however the watch has stopped connecting to the app<br /><br />6 month update: Batter life is excellent, I notice it has started to decline, but that could also be heavier use.  Step count still seems a bit wonky, but not egregiously off.  The Strap is starting to break at the clasp and I will need to replace as soon as I'm able to find a replacement.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 3.0,
        "title": "Nice",
        "text": "Having used different smart watches was looking forward to this one. But it disappointed me. Accuracy on everything was off compared to reality. Other smart watches for less were more accurate. I returned said watch.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "AMAZTIM",
    "tags": [],
    "price": 99.99,
    "position": 9,
    "page": 1
  },
  {
    "id": "prod_smartwatches_093",
    "parent_asin": "B07JZFML1K",
    "category": "Smartwatches",
    "title": "LDFAS Fenix 6 Pro/5 Band, Sport Quick Release Easy Fit 22mm Stainless Steel Metal Strap with Safety Buckle Compatible for Garmin Fenix 5 5 Plus 6 6 Pro/Forerunner 935 Smartwatch",
    "description": "",
    "rating": 4.3,
    "review_count": 104,
    "features": [
      "The 22mm replaceable watch band compatible with Fenix 6, Fenix 6 - Pro Solar Edition, Fenix 6 Pro and Sapphire Editions, Fenix 5, Fenix 5 Plus, Fenix 7, Fenix 7 Solar, Fenix 7 Sapphire Solar",
      "Comfortable fits 5.7\"-8.1\" (145mm-210mm) wrist, very easy to adjusting the length by the tool provided",
      "Compatible with Garmin Approach S62, D2 Delta, Forerunner 745/935/945/945 LET, quatix 5/6, Instinct Solar, Instinct 2, Epix Gen 2"
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Nice quality band",
        "text": "Nice heavy band, easy to make to size w tool included. Looks great",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Great look",
        "text": "It was easy to do the adjustment to fit to size its a sharp look for the Fenix 5  22mm is the correct band with .",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "LDFAS",
    "tags": [],
    "price": 25.99,
    "position": 10,
    "page": 1
  },
  {
    "id": "prod_smartwatches_013",
    "parent_asin": "B0BHVM4D6R",
    "category": "Smartwatches",
    "title": "Samsung Galaxy Watch3 2020 Smartwatch (Bluetooth + Wi-Fi + GPS) International Model (Bronze, 41mm)",
    "description": "The only smartwatch with a precise rotating bezel for navigating between apps. Larger screen, but lighter and thinner for more comfort: With its subtle rotating bezel, it's easier to see and focus on what's important on an even larger screen. The Galaxy Watch3 is thinner and smaller, and up to 15% lighter with a sophisticated look that, thanks to its reduced frame, is perfect for the wrist. Breathe easier with built-in oxygen measurement: The Galaxy Watch3 uses red LEDs and infrared rays to calculate your SpO2 levels or the amount of oxygen in your blood. Because oxygen saturation is directly related to physical activity, you can use the Galaxy Watch3 to push your routine to the next level. Enjoy a better sleep: The Galaxy Watch3 records your active sleep, deep sleep, and total sleep time to keep track and improve the quality of your sleep. Samsung partnered with the National Sleep Foundation to include educational content and provide tips on your device to help you sleep better. Do your best and then repeat it: With over 120 home workout programs to choose from, the Galaxy Watch3 helps you move your body at your own pace. Pick one from your phone and stream it on your TV. It will show you your heart rate in real-time while you exercise. Use the Ridge Sport strap for even more accurate stats. Continue your conversations: When you receive a new message, the Galaxy Watch3 shows your conversation history so you can follow them. You can also view images without needing an extra touch, making it easier to keep up while you're working out. Add some context with the smart answer: Respond to messages at all times and without missing a beat. The Galaxy Watch3's smart reply analyzes the texts and photos you receive and gives you possible answers in different categories, such as food, celebrations, selfies and much more.",
    "rating": 4.5,
    "review_count": 218,
    "features": [
      "1.2 \"(30.2mm) Super AMOLED, 360 x 360px Resolution, 16M Colors, CPU: Dual-Core 1.15GHz, 340mAh Battery, Tizen OS, Bluetooth, Wi-Fi",
      "The Galaxy Watch3 uses red LEDs and infrared rays to calculate your SpO2 levels or the amount of oxygen in your blood.",
      "Sensors: Accelerometer, Barometer, Gyro Sensor, Light Sensor, Optical Heart Rate Sensor. The only smartwatch with a precise rotating bezel for navigating between apps",
      "5 ATM/IP68 The water and dust resistance rating, Military-grade durability, Larger screen but lighter and thinner for more comfort.",
      "International Model No Warranty in the US. Compatible with Android and iOS devices. Samsung Pay - Not Supported."
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Don't buy this from Amazon.",
        "text": "This item does not work and I returned it but Amazon has been claiming they never got it",
        "verified": true,
        "helpful_votes": 9
      }
    ],
    "store": "SAMSUNG",
    "tags": [
      "Overall Pick"
    ],
    "price": 46.99,
    "position": 11,
    "page": 2
  },
  {
    "id": "prod_smartwatches_091",
    "parent_asin": "B09Q6K38G1",
    "category": "Smartwatches",
    "title": "PlayZoom 2 Kids Smartwatch & Headphones - Video Camera Selfies STEM Learning Educational Fun Games, MP3 Music Player Audio Books Touch Screen Sports Digital Watch Gift for Kids Toddlers Boys Girls",
    "description": "",
    "rating": 4.3,
    "review_count": 2183,
    "features": [
      "🦄 LEARN AND PLAY: This watch combines learning and fun. Help your child learn about STEM, how to tell time, set an alarm, video record, get active and fit, and more—all through the power of play! Kids will be having too much fun to realize they're learning! Plug the matching headphones into the PlayZoom's headphone jack and listen to your favorite tunes, and listen to lulabies and bed time stories before bed.",
      "🦄 SAFE AND FUN: Unlike other smart technology, our electronic watch is safe for children of any age because we don’t require a credit card, a connection to data or Wi-Fi, or downloading. The watch also features an In Case of Emergency Card on the watch. For your total peace of mind, turn to iTouch.",
      "🦄 COOL CAMERAS: Our kids' wristwatch has a swivel photo camera and video camera. Toddlers and kids alike will love getting creative by taking photos. The watch can hold up to 50 photos that can be saved and uploaded onto your computer via USB.",
      "🦄 RECHARGEABLE BATTERY: Your little one can play all day, and you won't have to swap out pesky watch batteries. With your order, you'll receive a USB charging cable that will have your child's digital toy watch ready to go for another day of fun.",
      "🦄 EXPRESS YOURSELF: These gadgets aren't just great for teaching; they also allow kids to express their unique personalities. Choose from 10+ unique band designs and watch faces! PlayZoom Smartwatches are the perfect gifts for kids of all ages!"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Angry customer",
        "text": "So after receiving these items on March 29, 2021, it took 5 hrs to charge, the headphone jack doesn't even fit the watch!  On top of that my daughter plays on it for 15 mins and it dies!  She wore it to play on it and the wrist band broke!  I'm not happy at all and will never be buying this brand ever again!  It wouldn't even turn on right away after charging! The headphones are absolutely the worst thing ever ! I plugged them in to my phone and all we heard was high pitched screeching!  I'm not asking for my money back, I'm just warning others to be careful!  Complete false advertising!",
        "verified": true,
        "helpful_votes": 11
      },
      {
        "rating": 5.0,
        "title": "Making my great grand happy",
        "text": "Yesterday I was told by my 7 year old great grand... that My giftto her was the best gift!!!!  Said she plays with it for hours at a time!!!<br />What could make me happier?????..  😂",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Daughter loves it",
        "text": "So cute, kids love them. Very durable.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Super fun functions!",
        "text": "I love all the stuff these watches have on them! AND, the headphones are amazing for parents since the sounds are a little loud. The games and educational material on these is fantastic. This is such an excellent value for an amazing little device.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Charger piece does not work",
        "text": "The charger piece did not work to charge watch, therefore after receiving it we could no longer use it. My grand-daughter never got to enjoy her birthday present. We made several attempts to charge watch utilizing other technology",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "PlayZoom",
    "tags": [],
    "price": 40.0,
    "position": 12,
    "page": 2
  },
  {
    "id": "prod_smartwatches_012",
    "parent_asin": "B096MFS66S",
    "category": "Smartwatches",
    "title": "Withings Scanwatch - Hybrid Smartwatch & Activity Tracker with Connected GPS, Heart Rate Monitor, Sleep Monitor, Smart Notifications, Water Resistant with 30-day Battery Life, Android & iOS compatible",
    "description": "ScanWatch is the first hybrid smartwatch to scan vital parameters to detect heart health conditions and help improve overall fitness. ScanWatch boasts a medical-grade ECG, an oximeter for SpO2 measures, and an exceptional battery life of up to 30 days. Technologies: an electrocardiogram and an oximeter to provide on-demand essential vital parameters.",
    "rating": 4.2,
    "review_count": 1053,
    "features": [
      "ELECTROCARDIOGRAM ON DEMAND — Detect atrial fibrillation or normal heart rhythm in just 30 seconds via ECG.",
      "WRIST-BASED OXIMETRY — Provides on demand clinically validated oxygen saturation level (SpO2) in just 30 seconds.",
      "HEART RATE TRACKING — Track heart rate continuously during workouts to optimize training, and monitor daily and overnight heart rate to help improve health over time.",
      "TRACK BREATHING DISTURBANCES — Follow your nights and wake to signs of breathing disturbances in the app.",
      "AUTOMATIC SLEEP MONITORING — Wake to a Sleep Score based on light & deep sleep cycles, interruptions, depth & regularity.",
      "RECORD BATTERY LIFE — Spend more time moving and less time charging with a rechargeable battery that lasts up to 30 days.",
      "SMART NOTIFICATIONS — Customize call, text, event & app notifications from your smartphone right on the watch screen. ScanWatch seamlessly syncs with the free Health Mate app via Bluetooth. Works with Alexa, Apple Health, Google Fit, Strava and 100+ top health & fitness apps.",
      "SWAPPABLE WRISTBANDS — If you have multiple bands, it's easy to change them in seconds to wear ScanWatch your way: leather, silicone or metal."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Absolutely stellar watch but battery life is meh for a hybrid",
        "text": "Withings wearer for almost two years here. Have had the Scanwatch for a couple months and had the Steel HR before that.<br /><br />First off, if you're reading the reviews you should definitely buy either this watch or the Steel HR. I absolutely love it. It's gorgeous, the app is great, it fits in well to daily life. Looks fantastic whether suited up or wearing grubbies to work on the car. My doctor even hooked up tri-leads to me to compare the ECG with actual medical equipment and they thought it was pretty darn close! Same with O2 sat monitor and heart rate. Quality wise, on par with its excellent forerunner, the Steel HR. The functional twisting crown with haptic feedback is a nicer touch than the push button on the old one.<br /><br />I have to ding it on one star because of the battery life and charge time compared to the prior model. My Steel HR lasted for about a month with all features enabled and charged almost completely in the time it took to take a shower. This one lasts about five days with all features enabled (I know, there are more features). But the bigger problem is charge time. I take the watch off for showers and that's a logical time to charge (obviously you want to wear this in your sleep). About 30 minutes does not come anywhere near to fully charging the battery. Just now it only went from 30-40%. So you need to find time to charge it during the day or occasionally not wear it while sleeping. I think I'm going to disable some of the continuous monitoring features which puts me back at my Steel HR just with sleep disturbance monitoring and O2 sat on demand.<br /><br />Ultimately, if you want activity tracking, heart rate monitoring, enhanced sleep monitoring, ECG and O2 sat WHILE still wearing an attractive watch, this is hard to beat. If you don't care about ECG, O2 and sleep disturbance tracking the Steel HR is the watch to get as it's more or less the same just without those features and is cheaper. As to whether the ScanWatch is with the extra money over the Steel HR, I think that depends on how much you prioritize those extra features and battery life. If this would last a week plus on a charge I'd say the extra hundred bucks is a no brainer. But battery life as it is... tougher call.<br /><br />One other note. While this watch will give you notifications, they're a bit cumbersome on the small screen. I have it turned off.",
        "verified": true,
        "helpful_votes": 20
      },
      {
        "rating": 1.0,
        "title": "Screen fogged up after only a few days",
        "text": "Was exited by this smart watch, look and capabilities. But within a few short days the screen had fogged up on the inside without having come near water in any way. Very disappointing.",
        "verified": true,
        "helpful_votes": 9
      },
      {
        "rating": 4.0,
        "title": "Great watch! Battery myth...",
        "text": "The best looking, excellent build quality, thoughtful app. Notification is done nicely.<br /><br />Battery Myth:<br /><br />My first green horizon watch battery is very  bad the battery dropped 14% on day one. I tried Amazfit, and it only drops 5% a day. I tried to disable a lot of things and it became about 7-8% a day.<br /><br />Second Blue horizon, more than 24 hours later, it still shows 100%. I could not believe it. Almost like I complained and they did something remotely and manipulated the battery meter... 😊<br /><br />Sleep Track is nice and main reason I bought it.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "great appearance, perfect for work",
        "text": "I love the product. The ease of use, it's intuitive nature. It looks like a regular watch-quite stylish in my opinion, but it functions like a smart watch but with just the essentials that I need. If you are regularly using the smart watch functions with blue tooth to your phone--the battery life is closer to two weeks than a month.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "Update:  Watch cannot keep time!  Needs frequent adjustment Not trustworthy!",
        "text": "Update:  Watch now 10 months old and does not keep accurate time.  Initially a couple months ago, I noticed the time difference and using instructions adjusted it, thinking it must have been an odd glitch.  I am used to watches that rarely need to be adjusted and thought a Hybrid Smartwatch would be smart and never be off time.  Boy was I wrong.<br /><br />Since writing the original glowing review, last May 2022 which was two weeks after purchase.  I have had to adjust the time several times.  The first time it was off it was 12 minutes difference.  Right now it is off 5 minutes.  A couple weeks ago it was off 4 minutes.  This is not an isolated incident.  Interestingly, the hands do not match the digital time, but all the same, both are off.  Right now the hands read exactly 4:30 while the digital is 4:31 even though the real time according to my computer and Samsung S21 phone is 4:36.  This is really a shame given the watch cost $300.  IMO, the watch is unusable if you cannot trust it for its most basic function.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Withings",
    "tags": [],
    "price": 299.95,
    "position": 13,
    "page": 2
  },
  {
    "id": "prod_smartwatches_179",
    "parent_asin": "B09Y96WTWN",
    "category": "Smartwatches",
    "title": "Deeprio Smart Watch 1.2\" AMOLED Always-on Display 3ATM Waterproof for Android Phones and iPhone Compatible Samsung Men Women Heart Rate Blood Oxygen Monitor Smartwatch Fitness Tracker Grey",
    "description": "",
    "rating": 3.9,
    "review_count": 573,
    "features": [
      "AMOLED Always on Display & 3ATM Waterproof: Comes in a aviation aluminum frame, the smart watch has a 1.2 inch full touch color AMOLED screen with 390 X 390 hight resolution, giving you a vibrant crystal clear viewing experience for all your data. 3ATM waterproof design let you wear everywhere from the gym to the pool to your bed.",
      "Quick Reply & Smart Notifications: For iPhone or Android phone users, you can get notifiations of calls, text messages such as SMS or social media app messages when your phone is nearby. Only for Android phone users, you can even make use of the preset \"quick reply\" to answer messages or calls immediately. Plus drinking water reminders, sedentary reminders and different reminders as set in alarms.",
      "Heart Rate & Blood Oxygen Monitor: The health watch performs 24/7 high-precision monitoring of your heart rate. Plus measure your blood oxygen saturation (SpO2) level within seconds, let you understand how your body feels and prioprity your training endurance.",
      "Fitness Tracker Watch & Sleep Tracking: Focus on your workout and exercise with built-in 14 sport modes, the fitness watch records your steps, distance, heart rate changes, calories burned, active minutes and more. Record your night sleep patterns such as deep sleep, light sleep, REM and creat intuitive charts. You can understand and improve your lifestyle for better health.",
      "Fast Charging & Wide Compatibility: Say goodbye to daily recharge, 20 minutes charging offers one day wearing, 2 hours fully charging offers you one week worry-free wearing. Compatible for Android 6.0+ or iOS 10.0+. Connected with Deeprio app, you can check weather, play music, find your phone and get more that make you living a easier life."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Nice watch",
        "text": "I’ve got a few Deeprio watches now.  They’re really nice a good value for the money compared to an Apple Watch!<br /><br />I like the styling they have and the finish is always really nice.<br /><br />You turn this on, pick language and pair with your phone.  the app takes over from there and gives you access to all the cool features like heart rate monitoring and fitness tracking.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "WORKS GREAT & EASY TO USE",
        "text": "[[VIDEOID:cc0b7e541be31c4c16b260b7d8ef969b]] I am giving this to my grand daughter, since joing the military she has started to really like running. This smart watch monitors your health in all kinds of different sports modes. I like how soft and flexible the band is. It is well made. It has a long battery life. It has mobile apps.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Smart",
        "text": "I bought this watch as a gift for my sister, she was very happy, it has a high-definition LED screen that is touchscreen. The price is very affordable and it looks great. She can tell  the time, can record heart rate and fitness records and count her steps. You can also watch the weather, play music, and has a lot of features that feels just like a cell phone, which is a great experience. My sister loves it.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Easy to use. Easy to link",
        "text": "Love the watch. Still learning things but I didn't read the manual lol. But super easy to figure out!!!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Nice watch if you get a low price for it",
        "text": "This is a nice watch with many features. I like that you can leave the time on all the time but it does suck out the battery life to only a day",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Deeprio",
    "tags": [],
    "price": 45.99,
    "position": 14,
    "page": 2
  },
  {
    "id": "prod_smartwatches_144",
    "parent_asin": "B08NXC2F9R",
    "category": "Smartwatches",
    "title": "Maxjoy Compatible with Fitbit Versa 3/ Sense Bands, Versa3/ Sense Stainless Steel Band Versa 3/ Sense Metal Mesh Bracelet Wristband Compatible with Fitbit Versa 3/ Sense Smart Watch, Colorful",
    "description": "",
    "rating": 3.9,
    "review_count": 342,
    "features": [
      "Maxjoy VERSA 3/ SENCE BANDS - Replacement for Fitbit Versa 3/ Fitbit Sense bands. Personalize your Versa 3/ Sense wristband with this stainless steel band, made your Versa 3/ Sense smart watch more stylish and elegant. The Fitbit Versa 3/ Sense Smart Watch is not included. (NOT Compatible with Fitbit Versa/ Versa 2/ Versa Lite/ Versa SE/ Versa 4/ Sense 2)",
      "DURABLE METAL CLASP & CONCAVE CONVEX GROOVE MESH DESIGN - Breathable 316L stainless steel mesh Fitbit Versa 3/ Sense with metal clasp. Concave convex groove mesh design, clamp the Versa 3/ Sense stainless steel band firmly to prevent it from falling off. Narrow width metal band provides comfortable and classy feeling for your wrist, a good choice for daily use with a stylish look",
      "ADJUSTABLE FREE SIZE - Upscale Versa 3/ Sense mesh stainless steel strap fits 5.5\"-8.1\"/ 140-206mm/ Small - Large wrists. One size fits most wrists, the size can be adjusted according to the circumstance of individual wrists",
      "EASY TO INSTALL AND REMOVE - Upgrade longer pull rod quick release pins, easy to install and remove without any tool, no hassle to replace your Fitbit Versa 3/ Sense bands. Secured metal clasp to keep your Versa 3/ Sense on your wrist, providing you a comfortable wearing experience when doing sport, working or outdoor",
      "PACKAGE INCLUDE - Package included: 1 * Maxjoy Compatible Fitbit Versa 3/ Sense Metal Band. If you are not COMPLETELY satisfied with the Versa 3/ Sense mesh metal band, just click \"Contact Seller\" for quick service"
    ],
    "reviews": [
      {
        "rating": 2.0,
        "title": "Not durable, hard to latch",
        "text": "I liked the shape of this band and how it looked on my sense. Unfortunately it was less than a week before it started snagging on blankets and towels. Then it started snagging my tighter woven clothes. Within a couple of weeks the area that was snagging on things bent outward resulting in it scratching myself and others along with snagging anything that got close to it.<br /><br />It is also very hard to do the clasp with one hand. At least if you have a reduced level of manual dexterity. I did figure out how to put it on. Taking it off is easier.<br /><br />I can't recommend this item. I sent it back for a refund.",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 4.0,
        "title": "Colorful band",
        "text": "I love the color . The band narrows once it comes off the fitbit. My only dislike is the extra band goes under the band instead of on top.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "I have a love hate relationship with this band.",
        "text": "I love the look of this band on my Fitbit, it matches perfectly. How you fasten it is kind of a pain. It slips through and runs under itself, which prevents a floppy tail of band, but it can be tricky to do and adjust. Everything else about the band is great. It's lightweight, matches my Fitbit perfectly, and is easy to clean.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "Nice Band",
        "text": "I like having options when it comes to the band of my Fitbit Versa3. This one looks nice. It's a little less casual than the silicone ones. It fits my Versa fine and was easy to attach. I wear my Fitbit on my left arm (I'm right handed). I found it a little more difficult to put on my wrist than my other bands. I was able to get it, but it took a few tries. Once on my wrist, my Versa feels secure and I'm not concerned about it coming undone.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Super Cute",
        "text": "Loving this wristband. It fits great and stays on without problems. Totally adjustable and wears really nicely. Couldn't be happier with this wristband.",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Maxjoy",
    "tags": [],
    "price": 9.98,
    "position": 15,
    "page": 2
  },
  {
    "id": "prod_smartwatches_123",
    "parent_asin": "B08ZS8WMP5",
    "category": "Smartwatches",
    "title": "Wearlizer Resin Band Compatible with Fitbit Versa/Versa 2 /Versa Lite/Versa SE Bands for Women Men Lightweight Bracelet Replacement Wristband Strap for Versa 2 Smartwatch, Fluorescent White",
    "description": "",
    "rating": 4.5,
    "review_count": 1383,
    "features": [
      "【Compatible Models】Wearlizer resin band is ONLY compatible with Fitbit Versa 2/Versa/Versa Lite/Versa Special Edition bands. DO NOT compatible for Fitbit Sense/Versa 3. (Band ONLY, watch is not included).",
      "【Unique Design】 Made of top resin material with colorful and stylish design. Each piece of resin is slowly polished by the skilled worker, which as a symbol of luxury, nobility and elegance. Lightweight (1.1oz) and waterproof design makes it comfortable to wear, suitable for wash hands; swimming and snorkeling, but not scuba diving.",
      "【Special Feature】Resin material is more rigid and durable. No fading-The color of the watch bands will not fade. Don’t worry about rust—Resin material will never worry about rust. Scratch proof and anti-collision—Resin material is harder than plastic and will not be damaged easily.",
      "【Easy to Resize & Install】5.7-8inch (140-205mm), fit most people's wrist. Come with a removal tool that allows you to remove and replace band links for a perfect fit. Exclusive double button folding clasp ensure the safety and beauty, easy to install and remove.",
      "【Buy with Confidence】 Compatible with fitbit versa 2 bands for women really dresses up the watch from a sporty look to a nice dressy casual look making you different from others and fit any occasions, dress or mood in your daily life. Wearlizer offers a 1 year warranty for replacement or full refund without return the band."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Like it was made by Fitbit!",
        "text": "I love this strap it is so pretty and such a value for the money. It looks like it cost way more. The little kit it came with to attach it to the Fitbit and to remove extra links was so handy and easy to use. It attached with no trouble at all.<br /><br />The only issue I had with it was that the rose gold color is slightly off from the Fitbit, but when wearing it, it’s not next to it directly so you can’t really tell. It’s not enough to bother me or take a star off but it could be for some.",
        "verified": true,
        "helpful_votes": 8
      },
      {
        "rating": 5.0,
        "title": "Surprised at the comfort and beauty of the band.",
        "text": "I've only had it on for a few hours, but I love it.  The colors, black, pink on the resin look so rich and shiny. And it's a comfortable fit. I did have to take out 2 tabs to get a snug fit. Taking out the tabs wasn't difficult after figuring out the way the tool that came with it. Can't  say the instructions were the best, but I figured it out.<br />I always got the magnetic mesh band in rose gold, but it always discolored and no matter what i tried I couldn't get it cleaned.<br />This is why I tried a new band. A review prompt gave suggestions of different things to comment on. One of the suggestions was a mobile app. I have no idea what that had to do with the band. Maybe someone knows and can let me know.<br />UPDATE:<br />I've been wearing it 24 hours a day, except when showering or recharging the watch.  NO discloration, no running of colors (bracelet) and it doesn't get dirty looking like the metalic bands. I'm going to buy another one, just in case something happens to this. So worth the money.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Love this",
        "text": "Kept breaking out to the old bands never had a problem with this one!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Love it!!",
        "text": "Love the colors on the band. I like the way the band closes.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Strong Enough For Every Day Use",
        "text": "This is my 2nd band and I love them! I wear them every day and they hold up fantastically! I highly recommend trying them and I will definitely be buying more colors in the future.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Wearlizer",
    "tags": [],
    "price": 17.97,
    "position": 16,
    "page": 2
  },
  {
    "id": "prod_smartwatches_182",
    "parent_asin": "B08HHSFT21",
    "category": "Smartwatches",
    "title": "Samsung Galaxy Watch 3 (45mm, GPS, Bluetooth) Smart Watch with Advanced Health Monitoring, Fitness Tracking, and Long Lasting Battery - Mystic Black (US Version) (Renewed)",
    "description": "Spend your time moving while Galaxy Watch3 tracks seven popular activities automatically. Get more out of each movement thanks to a built-in run coaching.",
    "rating": 4.5,
    "review_count": 4729,
    "features": [
      "Galaxy Watch3 combines powerful technology with a premium, customizable design so you can manage the day-today from your wrist, beautifully.",
      "Keep an eye on wellness with advanced health monitoring, and go for days without charging.",
      "Keep an eye on your fitness and health with SpO2, VO2 max, and heart-rate monitoring. Help is just a tap away if you stumble. And track your cycle in an easy and discreet way. *This device and related software are not intended for use in the diagnosis of disease or other conditions, or in the cure, mitigation, treatment or prevention of disease. SPO2, VO2 max and running coach features not available at the time of launch, will become available during Q3. Features will require a software update. **This device and related software are not intended for use in the diagnosis of disease or other conditions, or in the cure, mitigation, treatment or prevention of disease. ***Trip detection recognizes falls when engaged in dynamic motion, not when still. Requires network connection to notify emergency contact. GPS accuracy may be affected by obstructions to satellite signal such as buildings.",
      "Galaxy Watch3 combines style—two sizes, three colors, 50,000-plus watch faces and premium leather bands—with military-grade durability and water resistance.",
      "Spend your time moving while Galaxy Watch3 tracks seven popular activities automatically. Get more out of each movement thanks to a built-in run coaching."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Great watch, much better than my old \"smart\" watch",
        "text": "I got Moto 360 several years ago when smart watches first came out and it was nice, but annoying.  It was tied into everything and kept giving me alerts and so eventually I got tired of it.  My wife also had a first generation Samsung Gear watch and that was about the same as the Moto.<br />Well, fast forward a few years and now my wife, daughter, son and daughter-in-law all have newer smart watches (Apple Watches and Fitbit) and they all love them.  It was time to get a new phone, so I got a Samsung  S20 FE and then decided to get the Samsung watch.  I saw on the reviews that it really works well with Samsung phones and so I decided to get the Watch 3.  I was looking at the Watch 2, which had a few less features and then I found the Watch 3 in the 41mm size and then found a refurbished one so I ended up paying about the same for the Watch 3 as I would have for the Watch 2.<br />I'm very impressed with the watch and really love it.  I didn't get the one with a cell phone, it just connects to my phone with bluetooth and/or wifi, but it's really amazing.  I get my messages, and can turn off the ones that I don't want and then I also get all the health apps.  So, now it tells me to get off my chair and walk around and does EKG and stress tesing and Oxygen levels..<br />I was concerned that the 41 mm might be too small, but it is a great size for me as you can see from the pic.  I have had a Citizen Echo Drive for more than 10 years and it is a little larger, but I like the size of the Watch 3 better.<br />If you are thinking about getting a watch, this one is a good deal right now and I believe it does work best if you use it with a Samsung phone.",
        "verified": true,
        "helpful_votes": 9
      },
      {
        "rating": 3.0,
        "title": "Love the watch, hate the battery.",
        "text": "I don't use the sleep tracking because the watch is bulky and annoying while trying to sleep. The mobile app is ok, constantly running in background.  The battery life sucks, only good for a day and sometimes a day and a half which is to bad because I do love all the things it does. I think I can answer my phone on my watch (still figuring out how) can definitely hang up on unwanted calls and can read messages.  Good pedometer and workout tool. Overall nice watch with crappy battery life.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "I like it.",
        "text": "I had to change out the band. The buckle was a pain. I must recharge every day.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Upgrade",
        "text": "I initially gave my mom the first samsung watch and when it went down, she let me have it. Because I initially spoiled her with the first one I figured it was time to upgrade her. And she loves it, her favorite accessory thus far....",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 4.0,
        "title": "The price! Bought refurbished and love it",
        "text": "Love the price, as I only paid $136 because it was refurbished, but looks brand new and works great! Two things that I'm disappointed with 1 no YouTube app to listen to free music 2 must buy a subscription to Spotify! To listen to music on the watch. Besides those two negative things. The watch is a great buy",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Amazon Renewed",
    "tags": [],
    "price": 82.97,
    "position": 17,
    "page": 2
  },
  {
    "id": "prod_smartwatches_133",
    "parent_asin": "B09NMGBJPQ",
    "category": "Smartwatches",
    "title": "Adjustable Elastic Wrist Band/Ankle Band for Compatible with Fitbit Charge 5 Fitness Tracker, Stretchy Band for Men and Women (Black)",
    "description": "Soft, stretchy, comfortable and lightweight, very useful replacement accessories pack for your fitbit charge 5 fitness tracker, offering two different way to wear your watch (short strap for wrist, long strap for ankle), you will love to use all day, idea for anyone looking for a replacement, back-up or additional accessories.",
    "rating": 3.7,
    "review_count": 47,
    "features": [
      "Compatible with fitbit charge 5 fitness tracker ONLY",
      "Handmade, elasitc woven fabrics, good elasticity and doesn't emit any odor",
      "Easy to remove and install. Lightweight and super cute",
      "Package include 2 straps, short strap for wrist, Long strap for ankle",
      "One size but adjustable, short strap fits 5.7~9.5 inches wrist, long strap fits 7.5~13.5 inches ankle"
    ],
    "reviews": [
      {
        "rating": 1.0,
        "title": "Don't Bother. I have tried 4 of these from them for my Charge 5. Also comes loose from the Fitbit",
        "text": "Headline says it all. My first order, I was hoping it was just a rando, but exchanged, and every single one has the same problem.  Just sloppy construction -- enough out of spec that it might or might not work. I love the band. It's a crying shame it doesn't stay connected to the fitbit. Can't imagine how there could be even a single 5-star -- maybe the first batches were fabricated correctly.  Unfortunately there's nothing as nice or comfortable that I've been able to find for charge-5, so I may end up getting yet a 5th and 6th trial and frankensteining them with parts that do work to get something that works and something I like. I'll let you know",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 1.0,
        "title": "Waste of money",
        "text": "The band keeps stretching out as you wear it. Within a month I couldn’t tighten it anymore.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Yasss!!",
        "text": "No more irritation from original band! I love it and wish I got it sooner",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Grestun",
    "tags": [],
    "price": 12.97,
    "position": 18,
    "page": 2
  },
  {
    "id": "prod_smartwatches_094",
    "parent_asin": "B0BX4HM3Z6",
    "category": "Smartwatches",
    "title": "Smart Watch, Smart Watch for Android Phones & iOS with 1.7\" Full Touch Screen, 5 ATM Waterproof Fitness Watch with Heart Rate & Blood Oxygen Monitor, Sleep Monitor, Smart Watch for Women Men",
    "description": "",
    "rating": 4.3,
    "review_count": 179,
    "features": [
      "Heart Rate, Sleep, Blood & Activity Tracking - With our smartwatch, it accurately monitors your heart rate in real time. Also, it provides a detailed analysis of your sleep quality by continuously recording your sleep patterns. During exercise, the smartwatch automatically records daily steps, distance counter, calories burned, active minutes, measure your blood oxygen saturation and understand your physical state",
      "Large HD Color Touch Screen - 1.69 large color screen and full screen touch and hand sliding. it ensures smooth operations and 240*280 resolution for you. Our screen is better at color saturation and reproduction. Personalize your smart watch for men women with multiple customized watch faces provided, make your own stylish smart watch.",
      "Smart Watch Compatible with iPhone Android Phones - This smart watch is compatible with most iOS 8.0 & Android 4.4 and above smart phones. Connected to the app through Bluetooth, you can control the music player, view the local weather today, and apps notifications straight to your smartwatch including Facebook, Instagram, Twitter, Whatsapp, and more.Download and install “VeryFit” for free, then connecting our smartwatch to your phone and start your journey of smart life.",
      "14 ACTIVITY TRACKING & Waterproof: This fitness sport watch has 14+ sports modes check all-day activities data like steps, distance. Smart Watch is designed with 5ATM waterproof rating, so no need to worry when you wear it while swimming or sweating out.",
      "Long-lasting Battery Life & 5ATM Waterproof - The large battery capacity (300mAh) and low power consumption design offers longer endurance. It could last about 8 days when in auto monitoring mode for heart rate."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Great activity tracker with AMAZING Battery Life.",
        "text": "[[VIDEOID:e0fda475d57018948d4bdf5116c091bf]] I had a different version activity watch that was way more expensive to match my phone. For the cost this watch does just about everything I need it to for way less money.<br /><br />A few things I love about the watch...the Battery Life. OMG the battery life! It lasted me a full week with wearing it to bed most nights, through multiple exercise walks and a few work outs, and hundreds of notifications from my messaging apps and phone calls. It's easy to clear the notifications I receive on the watch. I love that it tracks my sleep, heart rate, and stress levels easily. I also tested out in my pool for swimming and it was waterproof without having to shake the watch or turn on any special modes to keep it watertight.<br /><br />I haven't figured out of it auto detects a work out but that could be because I obviously don't work out that much.<br /><br />I tested it against my health app on my phone and they were pretty accurate against each other info steps and mileage. I can't figure out how to get the watch and the app to register my GPS coordinates to see the map of my walks but I could be missing the settings.<br /><br />The app that gives the data is easy to navigate and update any settings. Seems very similar to other track laps I've used.<br />A few things I'm not liking about this watch...<br />I feel like the band and the watch itself that comes with the watch is a little too big for my wrist. And I have a bigger wrist for a female at my size. The watch face is bigger than some of my friends apple watches and taller than my old Samsung gear fit watch. I can SEE notifications on the watch but I can't respond or give a quick response to any messages. For Whatsapp or Facebook Messenger I wouldn't expect that but for SMS messages I would like to be able to give a quick text back either by speaking a response or by selecting from some quick options.<br /><br />Those are really my only 2 complaints. I like this watch and will continue to use!",
        "verified": false,
        "helpful_votes": 2
      },
      {
        "rating": 5.0,
        "title": "Such a great Apple Watch dupe!",
        "text": "This smart watch works great! It’s also so cute and the band has lots of holes for adjusting. The only difference I see that’s noticeable is the watch band is a flimsier rubber. But it also makes it feel more comfortable than my Apple Watch. Would make a great gift as well!",
        "verified": false,
        "helpful_votes": 1
      },
      {
        "rating": 1.0,
        "title": "Did the job for a week, then it drowned",
        "text": "I charged the watch out of the box.  Followed instructions and setup was pretty much straightforward.  There is a decent amount of sports mode available.  I mainly use run, walk, and swimming.  For walk and run the data captured was okay for duration, calories, distance, number of steps, pace, heart rate. and nighttime monitoring sleep was interesting.  Then I took it for laps in the pool, and that is when it did not do well.  The ad shows person swimming in pool, but I don't believe it can survive in the pool.  because the watch died.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 3.0,
        "title": "A sluggish, inaccurate, subpar sports/health smart watch.",
        "text": "I needed a backup sports smart watch for my Apple Watch.  Let's check out this Veryfit watch.<br /><br />What works:<br />Charged up in about 2-3 hours from 60% battery level.<br />Easy to install the Veryfit app and pair with my old iPhone 12 Pro.<br />Has many of the basic sports watch functions: stopwatch, alarm, timer, along with biometrics: Heart rate, Blood oxygen monitoring, Stress level, Breath training, Sleep, etc.<br />Big, easy to read watch face, only a bit narrower than my 44mm Apple Watch.<br />A variety of watch faces to download.<br />Nice, soft, comfortable watch straps.<br /><br />What don't work:<br />Once linked up to my iPhone, app takes some effort to set up.<br />Can only receive notifications and phone call alerts, no relay of calls.<br />Heart rate monitor is erratic with a wide range of random readings.  My resting heart rate is 56bpm yet this watch measures a range of 62 to 125bpm at various times.<br />Requires about 25s to get each biometric reading.<br />What's up with the 3-2-1 countdown to start each exercise?  Start/Stop is what most users prefer.<br />Perhaps the Android version works better?<br />Don't expect too much from this $34.99 smart watch (after -30% off coupon on Feb. 19, 2023) but there are other smart watches in this price range that function better.",
        "verified": false,
        "helpful_votes": 0
      },
      {
        "rating": 4.0,
        "title": "I like it",
        "text": "It's a little bulky but not enough for me not to still wear it every day",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "AlERTSEAL",
    "tags": [],
    "price": 45.99,
    "position": 19,
    "page": 2
  },
  {
    "id": "prod_smartwatches_074",
    "parent_asin": "B0BRQBGGCB",
    "category": "Smartwatches",
    "title": "Apple Watch Series 8 [GPS + Cellular 41mm] Smart Watch w/Graphite Stainless Steel Case w/Midnight Sport Band-S/M. Fitness Tracker, Blood Oxygen & ECG Apps, Always-On Retina Display, Water Resistant",
    "description": "",
    "rating": 4.6,
    "review_count": 1789,
    "features": [
      "WHY APPLE WATCH SERIES 8 — Your essential companion for a healthy life is now even more powerful. Advanced sensors provide insights to help you better understand your health. New safety features can get you help when you need it. The bright, Always-On Retina display is easy to read, even when your wrist is down.",
      "CELLULAR CONNECTIVITY — Send a text, make a call, and stream music without your iPhone, even while traveling internationally. Use Family Setup to manage Apple Watch for family members who don’t have an iPhone.",
      "EASILY CUSTOMIZABLE — Available in a range of sizes and materials, with dozens of bands to choose from and watch faces with complications tailored to whatever you’re into.",
      "INNOVATIVE SAFETY FEATURES — Crash Detection and Fall Detection can automatically connect you with emergency services in the event of a severe car crash or a hard fall. And Emergency SOS provides urgent assistance with the press of a button.",
      "ADVANCED HEALTH FEATURES — Temperature sensing is a breakthrough feature that provides deep insights into women’s health. Keep an eye on your blood oxygen. Take an ECG anytime. Get notifications if you have an irregular rhythm. And see how much time you spent in REM, Core, or Deep sleep with Sleep Stages.",
      "SIMPLY COMPATIBLE — It works seamlessly with your Apple devices and services. Unlock your Mac automatically. Find your devices with a tap. Pay and send money with Apple Pay. Apple Watch requires an iPhone 8 or later with the latest iOS version.",
      "INCREDIBLE DURABILITY — Tougher than tough. It’s crack resistant, IP6X-certified dust resistant, and swimproof with WR50 water resistance.",
      "A POWERFUL FITNESS PARTNER — The enhanced Workout app gives you new ways to train, and advanced metrics for more information about your workout performance. And Apple Watch comes with three months of Apple Fitness+ free.",
      "APPS ON YOUR WRIST — With access to tens of thousands of apps on the App Store right on your wrist, Apple Watch is the perfect personal device for whatever you love to do.",
      "LEGAL DISCLAIMERS — This is a summary of the main product features. See below to learn more."
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Works - but prefer Samsung products",
        "text": "Long story short - I won an i phone 14 Plus.. I have been a Samsung owner for years including a galaxy watch. But because of the Samsung watch and the fact that if I left my phone at home or at the office I still was able to make and take calls, texts, etc - I purchased this Apple watch to go with  my new free phone (which has cost me a lot $$$ in accessories,  (chargers - what the hell Apple??) but to review the Apple Watch it functions - but I must say for the money it is lacking a lot based on the Galaxy watch.",
        "verified": true,
        "helpful_votes": 20
      },
      {
        "rating": 4.0,
        "title": "Comfortable to wear and very functional",
        "text": "Comfortable to wear and very functional.  Excellent for exercising and playing sports",
        "verified": true,
        "helpful_votes": 5
      },
      {
        "rating": 5.0,
        "title": "Great for outdoor exercise.",
        "text": "It gives me a skin reaction under the watch so have to put steristrips on my skin.  They don’t affect the watch accuracy, so a good solution to what seems to be a rather common problem.",
        "verified": true,
        "helpful_votes": 3
      },
      {
        "rating": 5.0,
        "title": "It an apple watch!!!",
        "text": "If you liked the ones that came before you will love this one as well. Same product more features. Apple making sure that you keep on keeping on......making them money!",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Good watch",
        "text": " ",
        "verified": true,
        "helpful_votes": 1
      }
    ],
    "store": "Apple",
    "tags": [
      "Sponsored"
    ],
    "price": 629.0,
    "position": 20,
    "page": 2
  },
  {
    "id": "prod_smartwatches_168",
    "parent_asin": "B07YWHSY8M",
    "category": "Smartwatches",
    "title": "NotoCity Compatible with Fenix 6X Watchbands Silicone Sport Watch Strap for Fenix 5X/5X Plus/Fenix 6X/Fenix 6X Pro/Fenix 7X/Fenix 3/Fenix 3 HR/Tactix/Descent MK1/D2 Delta PX/D2 Charlie Smartwatch. (Black-Grey)",
    "description": "",
    "rating": 4.7,
    "review_count": 1273,
    "features": [
      "The 26mm soft silicone watch band fit for Fenix 5X,fenix 5X Plus,Fenix 6X,Fenix 6X Pro,Fenix 7X,Fenix 3,Fenix 3 HR,Tactix,Descent MK1,D2 Delta PX,D2 Charlie Smartwatch.Please take attention▶Just fit for 26mm garmin watch.",
      "More Safe Clasp: the clasp is made of high quality stainless steel, more strong than the silver ones. Even you swim or soaked in water for a long time,it still cannot never fade.",
      "Stay stylish and sport-ready by swapping out your compatible watch band for a new color on garmin watch",
      "Fits wrist between 7.51inches-8.81inches (190mm-224mm)，Please measure your wrist and make sure the size before you purchase.",
      "What we can promise to our customers is that we provide better quality products and customer services. Any problem with the item you receive or any opinion, please don't hesistate to contact us, we will find the best solution to solve."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Every bit as good as the Garmin band",
        "text": "Every bit as good as the Garmin band but, $37+ cheaper. I got 2 of these. I am amazed at the quality and comfort. If I didn't know better, I'd swear it was a Garmin Band. If you need a band, get this one!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Orange Color",
        "text": "Inexpensive and fits like a champ. Like the color, it is easy to find while I am camping.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Best OEM replacement",
        "text": "Best replacement I have found to date! This one fits greats, looks almost OEM and is a fraction of the price. I would say better built than OEM!",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Good band",
        "text": "Everything is good",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Sporty looks!",
        "text": "My new favorite band. Looks very sturdy and matches the big 5x plus very good.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "NotoCity",
    "tags": [],
    "price": 13.99,
    "position": 21,
    "page": 3
  },
  {
    "id": "prod_smartwatches_145",
    "parent_asin": "B098NCQ2Y7",
    "category": "Smartwatches",
    "title": "Smart Watch for Android iOS Phones, 1.69\" Touch Screen Smartwatch for Men, Fitness Tracker Watch with Heart Rate Blood Pressure Monitor, Pedometer Running Watch, IP68 Waterproof Bluetooth Watch",
    "description": "",
    "rating": 4.1,
    "review_count": 435,
    "features": [
      "[1.69 Inch large full touch screen smart watch] :This fitness watch adopts 1.69 inch 3D curved HD touch screen, metal structure and soft breathable bands, making it very comfortable for wearing and looking stylish both for men and women. Do you want to add your photos or your favorite images to the watch face? Now it is easy to realize on watch. You can choose the existing images or upload images to customize the watch face freely, which can make your watch looks unique.",
      "[24/7 Real-time heart rate monitor smart watch] : This health tracker smart watch can always monitor your real-time heart rate, blood oxygen, step count, calories burned, sleep quality tracker (deep sleep, light sleep and awake time), You can check the day, week, month data in the app, which can help you better understanding of your health and leading a healthy life-style. More practical tools: sedentary reminder, music controller, stopwatch, deep breather guide, music controller , find phone.",
      "[Accurate Fitness Tracker & Mother's Day Gift] : This fitness sport watch supports 8 sports modes, including walking, running, cycling, skipping rope, badminton, basketball, football, swimming. View your fitness data such as your steps, distance, calories burned, mileage, workout duration, heart rate, distance travelled and more all on your smart watch or via our app.connecting the gps in your cellphone can track all your workout routes, distances, and physical status during exercise. stay motivated all day!",
      "[Call & Message Notifications] : Connect the smart watches to your iPhone/iOS/SAMSUNG , you can get real-time notifications of your calls, texts, and SNS messages, including Facebook, Twitter, WhatsApp, Linkedin, Messenger, etc. Never miss important messages. Smart Watch for Android Phones have more practical tools, such as vibration alarm clocks, sedentary reminder, music controller, stopwatch, deep breather guide, music controller. (Note: Can't answer phone calls and reply messages!)",
      "[Large Battery Life and waterproof smart watch] : this Android smart watch built-in 200 mAh battery, this watch can stand by for 25 days work for 3-5 days and 1 hour charging time.fitness watch is designed with IP68 waterproof rating,which allows you to swim in the pool with it with no worries"
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Great price for what you are getting. Attractive watch with easy to see color screen.",
        "text": "Love the price and looks of watch",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Crappy",
        "text": "Band fell off and pin broke",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Pretty Good",
        "text": "The main reason I bought it was for blood pressure measurement. However, the blood pressure is way off. I also wish it would pick up the workout automatically. Other than that I like it.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "CKYRIN",
    "tags": [],
    "price": 24.99,
    "position": 22,
    "page": 3
  },
  {
    "id": "prod_smartwatches_181",
    "parent_asin": "B082JJJVN5",
    "category": "Smartwatches",
    "title": "Skagen Connected Falster 3 Gen 5 Stainless Steel and Silicone Touchscreen Smartwatch, Color: Blue (Model: SKT5203)",
    "description": "Introducing an advanced update to our most popular smartwatch. The Falster 3 Smartwatch boasts an interactive, swimproof touchscreen and a range of smart features powered with Wear OS by Google including: heart-rate tracking, Google Assistant, smartphone notifications, activity tracking, Google Pay, GPS and more. Choose from time- or function-based displays for easy access to your favorite features, and add your favorite third-party apps from the Google Play store. A battery-efficient dial design provides up to 24 hours of use on a single charge, and the interchangeable silicone strap allows you to customize your look. Each watch comes with a magnetic charger. Visit our Learn More and FAQs pages for more information. Wear OS by Google works with phones running Android 6. 0+ (excluding Go edition) and iOS 10. 0+. Supported features may vary between platforms and countries. Wear OS by Google is a trademark of Google LLC. Google Assistant and Google Pay available in select markets. *Battery life varies based on usage. To avoid damage to your watch, only use with included charger. Do not use a USB hub, USB splitter, USB y-cable, battery pack or other peripheral device to charge. Product should be kept more than 20cm away from implanted medical devices to minimize potential for RF interference. See product insert for full details. Google, Wear OS by Google, Google Pay and Google Fit are trademarks of Google LLC. Wear OS by Google works with phones running the latest version of Android (excluding Go edition and phones without Google Play Store) or iOS. Supported features may vary between platforms and countries with compatibility subject to change.",
    "rating": 4.2,
    "review_count": 57,
    "features": [
      "Skagen's newest smartwatch powered with Wear OS by Google work with iPhone and Android Phones",
      "Extend your battery life for multiple days with new, smart battery modes; magnetic USB rapid charger included; charge up to 80% in under an hour",
      "Heart Rate & Activity Tracking using Google Fit; Built-in GPS for distance tracking; Swimproof design 5ATM; responses from Google Assistant - it’s your own personal Google, always ready to help; Speed through checkout with your watch using Google Pay",
      "This is one smart watch - now with a speaker for audible alerts and taking phone calls, Google Assistant responses and more; receive smartphone notifications and alerts; microphone; download third party apps with 4GB of storage and 1G RAM memory capacity",
      "Case size: 42mm; Band size: 22mm; interchangeable with all Skagen 22mm bands; Touchscreen functionality; Connectivity: Bluetooth(R) 4. 1 Low Energy and Wi-Fi 802. 11 b/g/n; wireless syncing; imported"
    ],
    "reviews": [
      {
        "rating": 4.0,
        "title": "Great looking watch, battery life isn't what I expected",
        "text": "The major feature that seems missing from this watch is sleep tracking.  Reviews of the watch point to the limited battery life of the watch, and not being enough to track though an average night's sleep.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Measure your wrist before you buy.",
        "text": "The blue silicone band was too small to go around my wrist. I called Skagen and they offered to sell me a bigger band. I told them I shouldn't have to pay extra for the watch to go on my wrist. They said since I bought it from Amazon there was nothing they could do. So sadly, this is getting returned.<br />I've worn plenty of watches before, and I don't have a fatty wrist. My wrist is 8 inches in circumference, which is average for a male.<br />The interesting thing about the size as I inspected and measured the watch, is that if you measure the watch laid out flat, 8 inches goes to the second to last notch, and it should fit fine. BUT -- the watch body itself obviously does not bend, which means in actual wear when the watch goes AROUND your wrist, you need an additional 3/4 to 1 inch for it to work.<br />It's basically like that one gallon jug I bought at Walmart, I got it home to make a drink mix in it just to realize that yes, it held one gallon, if you filled it to the absolute brim, at which point putting in the drink mix made it spill.<br />If your wrist is greater than 7 inches in circumference, I would not buy this watch.",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "Skagen",
    "tags": [],
    "price": 265.0,
    "position": 23,
    "page": 3
  },
  {
    "id": "prod_smartwatches_190",
    "parent_asin": "B0BNPLPKLJ",
    "category": "Smartwatches",
    "title": "JOYOZY Genuine Leather Bands Compatible Fitbit Versa /Versa2 &New Fitbit Versa Lite Smartwatch,Fitbit Versa Wristband Replacement Accessories Fitness Straps Bands Women Men",
    "description": "",
    "rating": 4.4,
    "review_count": 4732,
    "features": [
      "Buckle closure",
      "Geometric Patterns:Particular design personalize your Fitbit Versa /Versa 2/Versa Lite/Versa SE smart watch all model version with this refined replacement versa wrist band.",
      "High Quality Material:Made from a custom premium leather with stainless steel buckle.This versa leather band is very soft and comfortable to ensure the wearing comfort.",
      "Wrist Size:Fit for 5.5\"-8.0\"(140mm-200mm) wrist so it is perfect fit for a petite or a large wrist.Fitbit Versa bands provide precise 10 holes for you to adjust the length.",
      "Easy Installation:Easy tool free installation with improved quick release spring bars make changing the band a snap.Total three quick release pins in the package!",
      "Warranty&Service:18 momths warranty time, providing you a wonderful shopping experience,We offer a full refund also resend a replacement for any quality problem. Life time friendly customer service.More high quality Fitbit Bands please search Joyozy on amazon."
    ],
    "reviews": [
      {
        "rating": 5.0,
        "title": "Sooooo cute, soooo comfy",
        "text": "I am very picky when it comes to things touching my skin. My socks have to be on the correct foot, tags on clothes need to die, I’d rather wear my clothes inside out than feel a seam pressing into my skin. This band is exactly what I was looking for, barely there. It smells like real leather so I guess they weren’t lying about that. The color was labeled as blue but the picture looked greenish bluish grayish. In person it looks just like their picture and I’m happy about that. I’m petite and overweight (5’4 and 175lbs) and this size is perfect, plenty of room to go bigger or smaller. I adore the thinness of the band, no more bulky Fitbit!",
        "verified": true,
        "helpful_votes": 8
      },
      {
        "rating": 5.0,
        "title": "Wonderful quality",
        "text": "I am thrilled with the white leather band I ordered.  I wear it everyday.  So comfortable. I plan to order more colors.  Highly recommend these bands.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 2.0,
        "title": "No Go",
        "text": "Did not my watch. This item was returned",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Just as described - Nice product, Shipping was fast, good quality.  I would purchase again.",
        "text": "Just as described - Nice product, Shipping was fast, good quality.  I would purchase again.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Amazing",
        "text": "Works perfectly! Everyone loves it when they see it!",
        "verified": true,
        "helpful_votes": 0
      }
    ],
    "store": "JOYOZY",
    "tags": [],
    "price": 10.99,
    "position": 24,
    "page": 3
  },
  {
    "id": "prod_smartwatches_056",
    "parent_asin": "B0B288YMM8",
    "category": "Smartwatches",
    "title": "Parsonver Smart Watch, 5ATM Waterproof Fitness Watch for Swimming with 16 Sports Modes, Heart Rate, Blood Oxygen, Sleep Monitor, 1.69\" Smartwatch for Android and iPhone Compatible, LW45",
    "description": "",
    "rating": 4.1,
    "review_count": 1343,
    "features": [
      "CUSTOMIZED 100+ SPORTS MODES: Featuring 16 default sports modes. But you can customize sports modes from the app, more than 100 sports modes contain almost all sports! such as walking, running, treadmill, cycling, skipping rope, strength training, football, basketball, yoga and so on. Most importantly, the watch weighs only 40g, and you can hardly feel it when wear on wrist!",
      "5 ATM WATERPROOF for SWIMMING: Smartwatch upgraded waterproof up to 5 ATM and water-resistant up to 50 meters, superior to 3ATM, IP68 waterproof watches on the market; wear it with confidence while swimming, in the shower, or in any weather conditions like rain or snow. (Please do not press the button underwater)",
      "24/7 HEART RATE AND SLEEP TRACKER: Provides 24/7 real-time heart rate monitoring, and automatic sleep monitoring including Deep sleep, Light sleep, and Awake time from 9: 00 pm to 12: 00 pm the next day, to know sleep patterns and quality in detail; The smart watch provides hydration suggestions and sedentary alerts-keep an eye on your health 24 hours a day!",
      "CALL and MESSAGE REMINDER: Get incoming call notifications, SMS, email, and other message reminders including real-time notifications from WhatsApp, Linkedln, Instagram, and Twitter when connected to the mobile phone App. (Note: You can reject calls on the watch, but not answer or reply to them.)",
      "EXPLORE EVEN MORE FUNCTIONS: 1.69-inch high-definition touch screen, gives a high-quality tactile and visual experience; dial can be customized and changed at will; supports additional functions including weather forecasts, alarm clock, timer and stopwatch, taking photos, and music control."
    ],
    "reviews": [
      {
        "rating": 2.0,
        "title": "It works great for only 2 months",
        "text": "I got this watch for hubby and he loves it for 2 months until the time was an hour ahead and the date was a day behind. He mostly use it for swimming and walking. Sad that it just stopped working. We got it in June for his Birthday, today is September 2nd. Sorry I can’t give you a good review. 😢",
        "verified": true,
        "helpful_votes": 2
      },
      {
        "rating": 1.0,
        "title": "My watch is not listed on site.",
        "text": "I couldn’t link my watch because it is not listed on site. If I can’t connect I will return it.",
        "verified": true,
        "helpful_votes": 1
      },
      {
        "rating": 5.0,
        "title": "Great product",
        "text": "Good price easy to us",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 1.0,
        "title": "Could not get app to download even with the help of customer service. Returned.",
        "text": "Never able to use because the app would not download to my phone. I spoke to customer service and they were not able to help. Returned  product.",
        "verified": true,
        "helpful_votes": 0
      },
      {
        "rating": 5.0,
        "title": "Looks expensive",
        "text": "Stylish. Long lasting battery. Best aw dupe",
        "verified": false,
        "helpful_votes": 0
      }
    ],
    "store": "Parsonver",
    "tags": [],
    "price": 29.49,
    "position": 25,
    "page": 3
  }
]